[
  "paper_id='10_1016_j_jpdc_2025_105141' bibtex='@article{10_1016_j_jpdc_2025_105141,\\n  title={Edge metric basis and its fault tolerance over certain interconnection networks},\\n  author={S. Prabhu and T. Jenifer Janany and M. Arulperumjothi and I.G. Yero},\\n  journal={Journal of Parallel and Distributed Computing},\\n  year={2025},\\n  doi={10.1016/j.jpdc.2025.105141},\\n  url={https://doi.org/10.1016/j.jpdc.2025.105141}\\n}' apa='Prabhu, S., Janany, T. J., Arulperumjothi, M., & Yero, I. (2025). Edge metric basis and its fault tolerance over certain interconnection networks. Journal of Parallel and Distributed Computing.' ieee='S. Prabhu et al., \"Edge metric basis and its fault tolerance over certain interconnection networks,\" Journal of Parallel and Distributed Computing, 2025.' mla='Prabhu, S., et al.. \"Edge metric basis and its fault tolerance over certain interconnection networks.\" Journal of Parallel and Distributed Computing, 2025.'",
  "paper_id='10_47836_mjms_19_3_16' bibtex='@article{10_47836_mjms_19_3_16,\\n  title={Investigating Metric and Edge Metric Resolvability in Molecular Structures of Breast Cancer Therapeutics},\\n  author={E. Pandeeswari and J. Ravi Sankar},\\n  journal={Malaysian Journal of Mathematical Sciences},\\n  year={2025},\\n  doi={10.47836/mjms.19.3.16},\\n  url={https://doi.org/10.47836/mjms.19.3.16}\\n}' apa='Pandeeswari, E. & Sankar, J. R. (2025). Investigating Metric and Edge Metric Resolvability in Molecular Structures of Breast Cancer Therapeutics. Malaysian Journal of Mathematical Sciences.' ieee='E. Pandeeswari, J. Ravi Sankar, \"Investigating Metric and Edge Metric Resolvability in Molecular Structures of Breast Cancer Therapeutics,\" Malaysian Journal of Mathematical Sciences, 2025.' mla='Pandeeswari, E., and J. Ravi Sankar. \"Investigating Metric and Edge Metric Resolvability in Molecular Structures of Breast Cancer Therapeutics.\" Malaysian Journal of Mathematical Sciences, 2025.'",
  "paper_id='arxiv_2107_14484' bibtex='@article{arxiv_2107_14484,\\n  title={Metric and Edge Metric Dimension of Zigzag Edge Coronoid Fused with Starphene},\\n  author={Sunny Kumar Sharma and Vijay Kumar Bhat and Hassan Raza and Karnika Sharma},\\n  journal={arXiv preprint arXiv:2107.14484},\\n  year={2021},\\n  url={http://arxiv.org/abs/2107.14484v1}\\n}' apa='Sharma, S. K., Bhat, V. K., Raza, H., & Sharma, K. (2021). Metric and Edge Metric Dimension of Zigzag Edge Coronoid Fused with Starphene. arXiv preprint arXiv:2107.14484.' ieee='Sunny Kumar Sharma et al., \"Metric and Edge Metric Dimension of Zigzag Edge Coronoid Fused with Starphene,\" arXiv preprint arXiv:2107.14484, 2021.' mla='Sharma, S. K., et al.. \"Metric and Edge Metric Dimension of Zigzag Edge Coronoid Fused with Starphene.\" arXiv, 2107.14484, 2021.'",
  "paper_id='10_1016_j_tcs_2021_11_015' bibtex='@article{10_1016_j_tcs_2021_11_015,\\n  title={Computing a metric basis of a bipartite distance-hereditary graph},\\n  author={Marina Moscarini},\\n  journal={Theoretical Computer Science},\\n  year={2022},\\n  doi={10.1016/j.tcs.2021.11.015},\\n  url={https://doi.org/10.1016/j.tcs.2021.11.015}\\n}' apa='Moscarini, M. (2022). Computing a metric basis of a bipartite distance-hereditary graph. Theoretical Computer Science.' ieee='Marina Moscarini, \"Computing a metric basis of a bipartite distance-hereditary graph,\" Theoretical Computer Science, 2022.' mla='Moscarini, M.. \"Computing a metric basis of a bipartite distance-hereditary graph.\" Theoretical Computer Science, 2022.'",
  "paper_id='10_1007_978_3_642_00683_8_7' bibtex='@article{10_1007_978_3_642_00683_8_7,\\n  title={Adaptive Edge and Defect Detection as a basis for Automated Lumber Classification and Optimisation},\\n  author={Roman Louban},\\n  journal={Springer Series in Materials Science},\\n  year={2009},\\n  doi={10.1007/978-3-642-00683-8_7},\\n  url={https://doi.org/10.1007/978-3-642-00683-8_7}\\n}' apa='Louban, R. (2009). Adaptive Edge and Defect Detection as a basis for Automated Lumber Classification and Optimisation. Springer Series in Materials Science.' ieee='Roman Louban, \"Adaptive Edge and Defect Detection as a basis for Automated Lumber Classification and Optimisation,\" Springer Series in Materials Science, 2009.' mla='Louban, R.. \"Adaptive Edge and Defect Detection as a basis for Automated Lumber Classification and Optimisation.\" Springer Series in Materials Science, 2009.'",
  "paper_id='10_3390_dynamics5020016' bibtex='@article{10_3390_dynamics5020016,\\n  title={Kolmogorov–Smirnov-Based Edge Centrality Measure for Metric Graphs},\\n  author={Christina Durón and Hannah Kravitz and Moysey Brio},\\n  journal={Dynamics},\\n  year={2025},\\n  doi={10.3390/dynamics5020016},\\n  url={https://doi.org/10.3390/dynamics5020016}\\n}' apa='Durón, C., Kravitz, H., & Brio, M. (2025). Kolmogorov–Smirnov-Based Edge Centrality Measure for Metric Graphs. Dynamics.' ieee='Christina Durón, Hannah Kravitz, Moysey Brio, \"Kolmogorov–Smirnov-Based Edge Centrality Measure for Metric Graphs,\" Dynamics, 2025.' mla='Durón, C., et al.. \"Kolmogorov–Smirnov-Based Edge Centrality Measure for Metric Graphs.\" Dynamics, 2025.'",
  "paper_id='10_17654_ms102050965' bibtex='@article{10_17654_ms102050965,\\n  title={ON METRIC DIMENSION OF EDGE-CORONA GRAPHS},\\n  author={Rinurwati and Herry Suprajitno and Slamin},\\n  journal={Far East Journal of Mathematical Sciences (FJMS)},\\n  year={2017},\\n  doi={10.17654/ms102050965},\\n  url={https://doi.org/10.17654/ms102050965}\\n}' apa='Rinurwati, Suprajitno, H., & Slamin (2017). ON METRIC DIMENSION OF EDGE-CORONA GRAPHS. Far East Journal of Mathematical Sciences (FJMS).' ieee='Rinurwati, Herry Suprajitno, Slamin, \"ON METRIC DIMENSION OF EDGE-CORONA GRAPHS,\" Far East Journal of Mathematical Sciences (FJMS), 2017.' mla='Rinurwati, et al.. \"ON METRIC DIMENSION OF EDGE-CORONA GRAPHS.\" Far East Journal of Mathematical Sciences (FJMS), 2017.'",
  "paper_id='10_1142_s1793830924500769' bibtex='@article{10_1142_s1793830924500769,\\n  title={Metric basis and metric dimension of some infinite planar graphs},\\n  author={S. Vidya and Sunny Kumar Sharma and Prasanna Poojary and G. R. Vadiraja Bhatta},\\n  journal={Discrete Mathematics, Algorithms and Applications},\\n  year={2024},\\n  doi={10.1142/s1793830924500769},\\n  url={https://doi.org/10.1142/s1793830924500769}\\n}' apa='Vidya, S., Sharma, S. K., Poojary, P., & Bhatta, G. R. V. (2024). Metric basis and metric dimension of some infinite planar graphs. Discrete Mathematics, Algorithms and Applications.' ieee='S. Vidya et al., \"Metric basis and metric dimension of some infinite planar graphs,\" Discrete Mathematics, Algorithms and Applications, 2024.' mla='Vidya, S., et al.. \"Metric basis and metric dimension of some infinite planar graphs.\" Discrete Mathematics, Algorithms and Applications, 2024.'",
  "paper_id='10_29020_nybg_ejpam_v17i3_5295' bibtex='@article{10_29020_nybg_ejpam_v17i3_5295,\\n  title={Investigating Metric Dimension and Edge Metric Dimension of Hexagonal Boron Nitride and Carbon Nanotubes},\\n  author={Waseem Abbas and Faryal Chudhary and Umar Farooq and Muhammad Azeem and Yilun Shang},\\n  journal={European Journal of Pure and Applied Mathematics},\\n  year={2024},\\n  doi={10.29020/nybg.ejpam.v17i3.5295},\\n  url={https://doi.org/10.29020/nybg.ejpam.v17i3.5295}\\n}' apa='Abbas, W., Chudhary, F., Farooq, U., Azeem, M., & Shang, Y. (2024). Investigating Metric Dimension and Edge Metric Dimension of Hexagonal Boron Nitride and Carbon Nanotubes. European Journal of Pure and Applied Mathematics.' ieee='Waseem Abbas et al., \"Investigating Metric Dimension and Edge Metric Dimension of Hexagonal Boron Nitride and Carbon Nanotubes,\" European Journal of Pure and Applied Mathematics, 2024.' mla='Abbas, W., et al.. \"Investigating Metric Dimension and Edge Metric Dimension of Hexagonal Boron Nitride and Carbon Nanotubes.\" European Journal of Pure and Applied Mathematics, 2024.'",
  "paper_id='10_1007_s10476_024_00006_z' bibtex='@article{10_1007_s10476_024_00006_z,\\n  title={Reaction-diffusion equations on metric graphs with edge noise},\\n  author={E. Sikolya},\\n  journal={Analysis Mathematica},\\n  year={2024},\\n  doi={10.1007/s10476-024-00006-z},\\n  url={https://doi.org/10.1007/s10476-024-00006-z}\\n}' apa='Sikolya, E. (2024). Reaction-diffusion equations on metric graphs with edge noise. Analysis Mathematica.' ieee='E. Sikolya, \"Reaction-diffusion equations on metric graphs with edge noise,\" Analysis Mathematica, 2024.' mla='Sikolya, E.. \"Reaction-diffusion equations on metric graphs with edge noise.\" Analysis Mathematica, 2024.'",
  "paper_id='10_1088_1742_6596_1836_1_012010' bibtex='@inproceedings{10_1088_1742_6596_1836_1_012010,\\n  title={Metric and edge-metric dimensions of bobble-neighbourhood-corona graphs},\\n  author={Rinurwati and R E Nabila},\\n  booktitle={Journal of Physics: Conference Series},\\n  year={2021},\\n  doi={10.1088/1742-6596/1836/1/012010},\\n  url={https://doi.org/10.1088/1742-6596/1836/1/012010}\\n}' apa='Rinurwati & Nabila, R. E. (2021). Metric and edge-metric dimensions of bobble-neighbourhood-corona graphs. In Journal of Physics: Conference Series.' ieee='Rinurwati, R E Nabila, \"Metric and edge-metric dimensions of bobble-neighbourhood-corona graphs,\" in Journal of Physics: Conference Series, 2021.' mla='Rinurwati, and R E Nabila. \"Metric and edge-metric dimensions of bobble-neighbourhood-corona graphs.\" Journal of Physics: Conference Series, 2021.'",
  "paper_id='10_21203_rs_3_rs_3783303_v1' bibtex='@article{10_21203_rs_3_rs_3783303_v1,\\n  title={Fault-Tolerant Metric Dimension (FTMD) of M-polynomial of Zigzag Edge Coronoid Fused by Starphene},\\n  author={Umar Farooq and Faryal Chudhary and Deeba Afzal and Waseem Abbas},\\n  journal={},\\n  year={2023},\\n  doi={10.21203/rs.3.rs-3783303/v1},\\n  url={https://doi.org/10.21203/rs.3.rs-3783303/v1}\\n}' apa='Farooq, U., Chudhary, F., Afzal, D., & Abbas, W. (2023). Fault-Tolerant Metric Dimension (FTMD) of M-polynomial of Zigzag Edge Coronoid Fused by Starphene. .' ieee='Umar Farooq et al., \"Fault-Tolerant Metric Dimension (FTMD) of M-polynomial of Zigzag Edge Coronoid Fused by Starphene,\" , 2023.' mla='Farooq, U., et al.. \"Fault-Tolerant Metric Dimension (FTMD) of M-polynomial of Zigzag Edge Coronoid Fused by Starphene.\" , 2023.'",
  "paper_id='10_24891_ea_24_1_172' bibtex='@article{10_24891_ea_24_1_172,\\n  title={The metric basis for assessing corporate sustainability},\\n  author={Sergei V. PETROV},\\n  journal={Economic Analysis: Theory and Practice},\\n  year={2025},\\n  doi={10.24891/ea.24.1.172},\\n  url={https://doi.org/10.24891/ea.24.1.172}\\n}' apa='PETROV, S. V. (2025). The metric basis for assessing corporate sustainability. Economic Analysis: Theory and Practice.' ieee='Sergei V. PETROV, \"The metric basis for assessing corporate sustainability,\" Economic Analysis: Theory and Practice, 2025.' mla='PETROV, S. V.. \"The metric basis for assessing corporate sustainability.\" Economic Analysis: Theory and Practice, 2025.'",
  "paper_id='10_1109_access_2022_3158982' bibtex='@article{10_1109_access_2022_3158982,\\n  title={Edge Metric Dimension and Edge Basis of One-Heptagonal Carbon Nanocone Networks},\\n  author={Karnika Sharma and Vijay Kumar Bhat and Sunny Kumar Sharma},\\n  journal={IEEE Access},\\n  year={2022},\\n  doi={10.1109/access.2022.3158982},\\n  url={https://doi.org/10.1109/access.2022.3158982}\\n}' apa='Sharma, K., Bhat, V. K., & Sharma, S. K. (2022). Edge Metric Dimension and Edge Basis of One-Heptagonal Carbon Nanocone Networks. IEEE Access.' ieee='Karnika Sharma, Vijay Kumar Bhat, Sunny Kumar Sharma, \"Edge Metric Dimension and Edge Basis of One-Heptagonal Carbon Nanocone Networks,\" IEEE Access, 2022.' mla='Sharma, K., et al.. \"Edge Metric Dimension and Edge Basis of One-Heptagonal Carbon Nanocone Networks.\" IEEE Access, 2022.'",
  "paper_id='10_3390_math9121405' bibtex='@article{10_3390_math9121405,\\n  title={Edge Metric and Fault-Tolerant Edge Metric Dimension of Hollow Coronoid},\\n  author={Ali N. A. Koam and Ali Ahmad and Muhammad Ibrahim and Muhammad Azeem},\\n  journal={Mathematics},\\n  year={2021},\\n  doi={10.3390/math9121405},\\n  url={https://doi.org/10.3390/math9121405}\\n}' apa='Koam, A. N. A., Ahmad, A., Ibrahim, M., & Azeem, M. (2021). Edge Metric and Fault-Tolerant Edge Metric Dimension of Hollow Coronoid. Mathematics.' ieee='Ali N. A. Koam et al., \"Edge Metric and Fault-Tolerant Edge Metric Dimension of Hollow Coronoid,\" Mathematics, 2021.' mla='Koam, A. N. A., et al.. \"Edge Metric and Fault-Tolerant Edge Metric Dimension of Hollow Coronoid.\" Mathematics, 2021.'",
  "paper_id='10_21203_rs_3_rs_3800695_v1' bibtex='@article{10_21203_rs_3_rs_3800695_v1,\\n  title={Investigating The Metric Basis And Metric Dimension Of Graphene},\\n  author={Wasim Abbas and Faryal Chaudhry and Deeba Afzal and Umar Farooq},\\n  journal={},\\n  year={2023},\\n  doi={10.21203/rs.3.rs-3800695/v1},\\n  url={https://doi.org/10.21203/rs.3.rs-3800695/v1}\\n}' apa='Abbas, W., Chaudhry, F., Afzal, D., & Farooq, U. (2023). Investigating The Metric Basis And Metric Dimension Of Graphene. .' ieee='Wasim Abbas et al., \"Investigating The Metric Basis And Metric Dimension Of Graphene,\" , 2023.' mla='Abbas, W., et al.. \"Investigating The Metric Basis And Metric Dimension Of Graphene.\" , 2023.'",
  "paper_id='10_31219_osf_io_m6rdh' bibtex='@article{10_31219_osf_io_m6rdh,\\n  title={A Physical Basis for the Symmetries in the Friedmann-Robertson-Walker Metric},\\n  author={Fulvio Melia},\\n  journal={},\\n  year={2023},\\n  doi={10.31219/osf.io/m6rdh},\\n  url={https://doi.org/10.31219/osf.io/m6rdh}\\n}' apa='Melia, F. (2023). A Physical Basis for the Symmetries in the Friedmann-Robertson-Walker Metric. .' ieee='Fulvio Melia, \"A Physical Basis for the Symmetries in the Friedmann-Robertson-Walker Metric,\" , 2023.' mla='Melia, F.. \"A Physical Basis for the Symmetries in the Friedmann-Robertson-Walker Metric.\" , 2023.'",
  "paper_id='10_13189_ms_2025_130302' bibtex='@article{10_13189_ms_2025_130302,\\n  title={Edge Metric and Edge Metric Topology on Graph},\\n  author={Roy John and Athira Chandran and G. Suresh Singh},\\n  journal={Mathematics and Statistics},\\n  year={2025},\\n  doi={10.13189/ms.2025.130302},\\n  url={https://doi.org/10.13189/ms.2025.130302}\\n}' apa='John, R., Chandran, A., & Singh, G. S. (2025). Edge Metric and Edge Metric Topology on Graph. Mathematics and Statistics.' ieee='Roy John, Athira Chandran, G. Suresh Singh, \"Edge Metric and Edge Metric Topology on Graph,\" Mathematics and Statistics, 2025.' mla='John, R., et al.. \"Edge Metric and Edge Metric Topology on Graph.\" Mathematics and Statistics, 2025.'",
  "paper_id='10_1038_s41598_025_24939_z' bibtex='@article{10_1038_s41598_025_24939_z,\\n  title={Metric, edge-metric, mixed-metric, and fault-tolerant metric dimensions of geometric networks with potential applications},\\n  author={Sakander Hayat and Rishi Naeem and Hafiz Muhammad Afzal Siddiqui and Amina Riaz and Muhammad Imran and Melaku Berhe Belay and Zeineb Klai},\\n  journal={Scientific Reports},\\n  year={2025},\\n  doi={10.1038/s41598-025-24939-z},\\n  url={https://doi.org/10.1038/s41598-025-24939-z}\\n}' apa='Hayat, S., Naeem, R., Siddiqui, H. M. A., Riaz, A., Imran, M., Belay, M. B., & Klai, Z. (2025). Metric, edge-metric, mixed-metric, and fault-tolerant metric dimensions of geometric networks with potential applications. Scientific Reports.' ieee='Sakander Hayat et al., \"Metric, edge-metric, mixed-metric, and fault-tolerant metric dimensions of geometric networks with potential applications,\" Scientific Reports, 2025.' mla='Hayat, S., et al.. \"Metric, edge-metric, mixed-metric, and fault-tolerant metric dimensions of geometric networks with potential applications.\" Scientific Reports, 2025.'",
  "paper_id='10_3390_sym10080300' bibtex='@article{10_3390_sym10080300,\\n  title={Computing Metric Dimension and Metric Basis of 2D Lattice of Alpha-Boron Nanotubes},\\n  author={Zafar Hussain and Mobeen Munir and Maqbool Chaudhary and Shin Min Kang},\\n  journal={Symmetry},\\n  year={2018},\\n  doi={10.3390/sym10080300},\\n  url={https://doi.org/10.3390/sym10080300}\\n}' apa='Hussain, Z., Munir, M., Chaudhary, M., & Kang, S. M. (2018). Computing Metric Dimension and Metric Basis of 2D Lattice of Alpha-Boron Nanotubes. Symmetry.' ieee='Zafar Hussain et al., \"Computing Metric Dimension and Metric Basis of 2D Lattice of Alpha-Boron Nanotubes,\" Symmetry, 2018.' mla='Hussain, Z., et al.. \"Computing Metric Dimension and Metric Basis of 2D Lattice of Alpha-Boron Nanotubes.\" Symmetry, 2018.'",
  "paper_id='10_1038_s41598_020_76516_1' bibtex='@article{10_1038_s41598_020_76516_1,\\n  title={Metric basis and metric dimension of 1-pentagonal carbon nanocone networks},\\n  author={Zafar Hussain and Mobeen Munir and Ashfaq Ahmad and Maqbool Chaudhary and Junaid Alam Khan and Imtiaz Ahmed},\\n  journal={Scientific Reports},\\n  year={2020},\\n  doi={10.1038/s41598-020-76516-1},\\n  url={https://doi.org/10.1038/s41598-020-76516-1}\\n}' apa='Hussain, Z., Munir, M., Ahmad, A., Chaudhary, M., Khan, J. A., & Ahmed, I. (2020). Metric basis and metric dimension of 1-pentagonal carbon nanocone networks. Scientific Reports.' ieee='Zafar Hussain et al., \"Metric basis and metric dimension of 1-pentagonal carbon nanocone networks,\" Scientific Reports, 2020.' mla='Hussain, Z., et al.. \"Metric basis and metric dimension of 1-pentagonal carbon nanocone networks.\" Scientific Reports, 2020.'",
  "paper_id='10_1142_s1793830920500706' bibtex='@article{10_1142_s1793830920500706,\\n  title={Computing edge version of metric and double metric dimensions of Kayak paddle graphs},\\n  author={Muhammad Ahmad and Naeem Ameen and Zohaib Zahid and Sohail Zafar},\\n  journal={Discrete Mathematics, Algorithms and Applications},\\n  year={2020},\\n  doi={10.1142/s1793830920500706},\\n  url={https://doi.org/10.1142/s1793830920500706}\\n}' apa='Ahmad, M., Ameen, N., Zahid, Z., & Zafar, S. (2020). Computing edge version of metric and double metric dimensions of Kayak paddle graphs. Discrete Mathematics, Algorithms and Applications.' ieee='Muhammad Ahmad et al., \"Computing edge version of metric and double metric dimensions of Kayak paddle graphs,\" Discrete Mathematics, Algorithms and Applications, 2020.' mla='Ahmad, M., et al.. \"Computing edge version of metric and double metric dimensions of Kayak paddle graphs.\" Discrete Mathematics, Algorithms and Applications, 2020.'",
  "paper_id='10_14311_cej_2018_01_0005' bibtex='@article{10_14311_cej_2018_01_0005,\\n  title={METRIC SURVEY DOCUMENTATION AS A BASIS FOR UNDERSTANDING THE DEVELOPMENT OF RURAL ARCHITECTURE},\\n  author={Zdeněk Poloprutský},\\n  journal={Stavební obzor - Civil Engineering Journal},\\n  year={2018},\\n  doi={10.14311/cej.2018.01.0005},\\n  url={https://doi.org/10.14311/cej.2018.01.0005}\\n}' apa='Poloprutský, Z. (2018). METRIC SURVEY DOCUMENTATION AS A BASIS FOR UNDERSTANDING THE DEVELOPMENT OF RURAL ARCHITECTURE. Stavební obzor - Civil Engineering Journal.' ieee='Zdeněk Poloprutský, \"METRIC SURVEY DOCUMENTATION AS A BASIS FOR UNDERSTANDING THE DEVELOPMENT OF RURAL ARCHITECTURE,\" Stavební obzor - Civil Engineering Journal, 2018.' mla='Poloprutský, Z.. \"METRIC SURVEY DOCUMENTATION AS A BASIS FOR UNDERSTANDING THE DEVELOPMENT OF RURAL ARCHITECTURE.\" Stavební obzor - Civil Engineering Journal, 2018.'",
  "paper_id='10_2139_ssrn_4769772' bibtex='@article{10_2139_ssrn_4769772,\\n  title={Strong Edge Metric Dimension of Graphs},\\n  author={Mojgan Afkhami},\\n  journal={},\\n  year={2023},\\n  doi={10.2139/ssrn.4769772},\\n  url={https://doi.org/10.2139/ssrn.4769772}\\n}' apa='Afkhami, M. (2023). Strong Edge Metric Dimension of Graphs. .' ieee='Mojgan Afkhami, \"Strong Edge Metric Dimension of Graphs,\" , 2023.' mla='Afkhami, M.. \"Strong Edge Metric Dimension of Graphs.\" , 2023.'",
  "paper_id='10_2139_ssrn_4953611' bibtex='@article{10_2139_ssrn_4953611,\\n  title={\\u200eFractional $K$-Clique Metric Dimension of (Edge) Corona Products of Graphs},\\n  author={Zeinab Shahmiri and Darko Dimitrov and Mostafa Tavakoli},\\n  journal={},\\n  year={2023},\\n  doi={10.2139/ssrn.4953611},\\n  url={https://doi.org/10.2139/ssrn.4953611}\\n}' apa='Shahmiri, Z., Dimitrov, D., & Tavakoli, M. (2023). \\u200eFractional $K$-Clique Metric Dimension of (Edge) Corona Products of Graphs. .' ieee='Zeinab Shahmiri, Darko Dimitrov, Mostafa Tavakoli, \"\\u200eFractional $K$-Clique Metric Dimension of (Edge) Corona Products of Graphs,\" , 2023.' mla='Shahmiri, Z., et al.. \"\\u200eFractional $K$-Clique Metric Dimension of (Edge) Corona Products of Graphs.\" , 2023.'",
  "paper_id='10_1109_icip_2002_1038901' bibtex='@inproceedings{10_1109_icip_2002_1038901,\\n  title={No-reference sharpness metric based on local edge kurtosis},\\n  author={J. Caviedes and S. Gurbuz},\\n  booktitle={Proceedings. International Conference on Image Processing},\\n  year={2023},\\n  doi={10.1109/icip.2002.1038901},\\n  url={https://doi.org/10.1109/icip.2002.1038901}\\n}' apa='Caviedes, J. & Gurbuz, S. (2023). No-reference sharpness metric based on local edge kurtosis. In Proceedings. International Conference on Image Processing.' ieee='J. Caviedes, S. Gurbuz, \"No-reference sharpness metric based on local edge kurtosis,\" in Proceedings. International Conference on Image Processing, 2023.' mla='Caviedes, J., and S. Gurbuz. \"No-reference sharpness metric based on local edge kurtosis.\" Proceedings. International Conference on Image Processing, 2023.'",
  "paper_id='10_2172_1995426' bibtex='@article{10_2172_1995426,\\n  title={Physics Basis, Optimization, and Control for Integrated 3D Edge Long-pulse Tokamak Scenarios},\\n  author={Zhihong Lin},\\n  journal={},\\n  year={2023},\\n  doi={10.2172/1995426},\\n  url={https://doi.org/10.2172/1995426}\\n}' apa='Lin, Z. (2023). Physics Basis, Optimization, and Control for Integrated 3D Edge Long-pulse Tokamak Scenarios. .' ieee='Zhihong Lin, \"Physics Basis, Optimization, and Control for Integrated 3D Edge Long-pulse Tokamak Scenarios,\" , 2023.' mla='Lin, Z.. \"Physics Basis, Optimization, and Control for Integrated 3D Edge Long-pulse Tokamak Scenarios.\" , 2023.'",
  "paper_id='10_1007_s10878_021_00838_7' bibtex='@article{10_1007_s10878_021_00838_7,\\n  title={The effect of vertex and edge deletion on the edge metric dimension of graphs},\\n  author={Meiqin Wei and Jun Yue and Lily Chen},\\n  journal={Journal of Combinatorial Optimization},\\n  year={2022},\\n  doi={10.1007/s10878-021-00838-7},\\n  url={https://doi.org/10.1007/s10878-021-00838-7}\\n}' apa='Wei, M., Yue, J., & Chen, L. (2022). The effect of vertex and edge deletion on the edge metric dimension of graphs. Journal of Combinatorial Optimization.' ieee='Meiqin Wei, Jun Yue, Lily Chen, \"The effect of vertex and edge deletion on the edge metric dimension of graphs,\" Journal of Combinatorial Optimization, 2022.' mla='Wei, M., et al.. \"The effect of vertex and edge deletion on the edge metric dimension of graphs.\" Journal of Combinatorial Optimization, 2022.'",
  "paper_id='10_3934_math_2021531' bibtex='@article{10_3934_math_2021531,\\n  title={Metric dimension and edge metric dimension of windmill graphs},\\n  author={Pradeep Singh and Sahil Sharma and Sunny Kumar Sharma and Vijay Kumar Bhat},\\n  journal={AIMS Mathematics},\\n  year={2021},\\n  doi={10.3934/math.2021531},\\n  url={https://doi.org/10.3934/math.2021531}\\n}' apa='Singh, P., Sharma, S., Sharma, S. K., & Bhat, V. K. (2021). Metric dimension and edge metric dimension of windmill graphs. AIMS Mathematics.' ieee='Pradeep Singh et al., \"Metric dimension and edge metric dimension of windmill graphs,\" AIMS Mathematics, 2021.' mla='Singh, P., et al.. \"Metric dimension and edge metric dimension of windmill graphs.\" AIMS Mathematics, 2021.'",
  "paper_id='10_1007_978_0_387_69200_5_4' bibtex=\"@article{10_1007_978_0_387_69200_5_4,\\n  title={Basis Vector Fields and the Metric Tensor},\\n  author={},\\n  journal={Einstein's General Theory of Relativity},\\n  year={2007},\\n  doi={10.1007/978-0-387-69200-5_4},\\n  url={https://doi.org/10.1007/978-0-387-69200-5_4}\\n}\" apa=\"Unknown Author (2007). Basis Vector Fields and the Metric Tensor. Einstein's General Theory of Relativity.\" ieee='Unknown Author, \"Basis Vector Fields and the Metric Tensor,\" Einstein\\'s General Theory of Relativity, 2007.' mla='Unknown Author. \"Basis Vector Fields and the Metric Tensor.\" Einstein\\'s General Theory of Relativity, 2007.'",
  "paper_id='10_1117_12_130263' bibtex='@article{10_1117_12_130263,\\n  title={Adaptable edge quality metric},\\n  author={Robin N. Strickland},\\n  journal={Optical Engineering},\\n  year={1993},\\n  doi={10.1117/12.130263},\\n  url={https://doi.org/10.1117/12.130263}\\n}' apa='Strickland, R. N. (1993). Adaptable edge quality metric. Optical Engineering.' ieee='Robin N. Strickland, \"Adaptable edge quality metric,\" Optical Engineering, 1993.' mla='Strickland, R. N.. \"Adaptable edge quality metric.\" Optical Engineering, 1993.'",
  "paper_id='10_1117_2_1200910_1829' bibtex='@article{10_1117_2_1200910_1829,\\n  title={New metric describes edge noise in bilevel images},\\n  author={Elisa Barney Smith},\\n  journal={SPIE Newsroom},\\n  year={2009},\\n  doi={10.1117/2.1200910.1829},\\n  url={https://doi.org/10.1117/2.1200910.1829}\\n}' apa='Smith, E. B. (2009). New metric describes edge noise in bilevel images. SPIE Newsroom.' ieee='Elisa Barney Smith, \"New metric describes edge noise in bilevel images,\" SPIE Newsroom, 2009.' mla='Smith, E. B.. \"New metric describes edge noise in bilevel images.\" SPIE Newsroom, 2009.'",
  "paper_id='10_9790_03752431' bibtex='@article{10_9790_03752431,\\n  title={Improvised Canny Edge Detector &amp; Performance Metric of Edge Detector Using WPR (White Pixel Ratio)},\\n  author={Naveen Singh Dagar},\\n  journal={IOSR Journal of Engineering},\\n  year={2013},\\n  doi={10.9790/03752431},\\n  url={https://doi.org/10.9790/03752431}\\n}' apa='Dagar, N. S. (2013). Improvised Canny Edge Detector &amp; Performance Metric of Edge Detector Using WPR (White Pixel Ratio). IOSR Journal of Engineering.' ieee='Naveen Singh Dagar, \"Improvised Canny Edge Detector &amp; Performance Metric of Edge Detector Using WPR (White Pixel Ratio),\" IOSR Journal of Engineering, 2013.' mla='Dagar, N. S.. \"Improvised Canny Edge Detector &amp; Performance Metric of Edge Detector Using WPR (White Pixel Ratio).\" IOSR Journal of Engineering, 2013.'",
  "paper_id='10_1117_1_601060' bibtex='@article{10_1117_1_601060,\\n  title={Edge\\u2009quality\\u2009metric\\u2009for\\u2009arbitrary\\u2009two‐dimensional\\u2009edges},\\n  author={Paul V. Khvorostov},\\n  journal={Optical Engineering},\\n  year={1996},\\n  doi={10.1117/1.601060},\\n  url={https://doi.org/10.1117/1.601060}\\n}' apa='Khvorostov, P. V. (1996). Edge\\u2009quality\\u2009metric\\u2009for\\u2009arbitrary\\u2009two‐dimensional\\u2009edges. Optical Engineering.' ieee='Paul V. Khvorostov, \"Edge\\u2009quality\\u2009metric\\u2009for\\u2009arbitrary\\u2009two‐dimensional\\u2009edges,\" Optical Engineering, 1996.' mla='Khvorostov, P. V.. \"Edge\\u2009quality\\u2009metric\\u2009for\\u2009arbitrary\\u2009two‐dimensional\\u2009edges.\" Optical Engineering, 1996.'",
  "paper_id='10_1017_cbo9780511571770_009' bibtex='@article{10_1017_cbo9780511571770_009,\\n  title={The money-metric as a basis for calculation of social welfare functions},\\n  author={},\\n  journal={Measuring Economic Welfare},\\n  year={1983},\\n  doi={10.1017/cbo9780511571770.009},\\n  url={https://doi.org/10.1017/cbo9780511571770.009}\\n}' apa='Unknown Author (1983). The money-metric as a basis for calculation of social welfare functions. Measuring Economic Welfare.' ieee='Unknown Author, \"The money-metric as a basis for calculation of social welfare functions,\" Measuring Economic Welfare, 1983.' mla='Unknown Author. \"The money-metric as a basis for calculation of social welfare functions.\" Measuring Economic Welfare, 1983.'",
  "paper_id='10_5220_0002821700910097' bibtex='@inproceedings{10_5220_0002821700910097,\\n  title={A NOVEL PERFORMANCE METRIC FOR GREY-SCALE EDGE DETECTION},\\n  author={},\\n  booktitle={Proceedings of the International Conference on Computer Vision Theory and Applications},\\n  year={2010},\\n  doi={10.5220/0002821700910097},\\n  url={https://doi.org/10.5220/0002821700910097}\\n}' apa='Unknown Author (2010). A NOVEL PERFORMANCE METRIC FOR GREY-SCALE EDGE DETECTION. In Proceedings of the International Conference on Computer Vision Theory and Applications.' ieee='Unknown Author, \"A NOVEL PERFORMANCE METRIC FOR GREY-SCALE EDGE DETECTION,\" in Proceedings of the International Conference on Computer Vision Theory and Applications, 2010.' mla='Unknown Author. \"A NOVEL PERFORMANCE METRIC FOR GREY-SCALE EDGE DETECTION.\" Proceedings of the International Conference on Computer Vision Theory and Applications, 2010.'",
  "paper_id='10_1109_icip_2011_6116379' bibtex='@inproceedings{10_1109_icip_2011_6116379,\\n  title={An image quality assessment metric based on Non-shift Edge},\\n  author={Wufeng Xue and Xuanqin Mou},\\n  booktitle={2011 18th IEEE International Conference on Image Processing},\\n  year={2011},\\n  doi={10.1109/icip.2011.6116379},\\n  url={https://doi.org/10.1109/icip.2011.6116379}\\n}' apa='Xue, W. & Mou, X. (2011). An image quality assessment metric based on Non-shift Edge. In 2011 18th IEEE International Conference on Image Processing.' ieee='Wufeng Xue, Xuanqin Mou, \"An image quality assessment metric based on Non-shift Edge,\" in 2011 18th IEEE International Conference on Image Processing, 2011.' mla='Xue, W., and Xuanqin Mou. \"An image quality assessment metric based on Non-shift Edge.\" 2011 18th IEEE International Conference on Image Processing, 2011.'",
  "paper_id='10_1109_icip_2010_5653763' bibtex='@inproceedings{10_1109_icip_2010_5653763,\\n  title={Metric tensor for multicomponent edge detection},\\n  author={Sylvain Rousseau and David Helbert and Philippe Carre and Jacques Blanc-Talon},\\n  booktitle={2010 IEEE International Conference on Image Processing},\\n  year={2010},\\n  doi={10.1109/icip.2010.5653763},\\n  url={https://doi.org/10.1109/icip.2010.5653763}\\n}' apa='Rousseau, S., Helbert, D., Carre, P., & Blanc-Talon, J. (2010). Metric tensor for multicomponent edge detection. In 2010 IEEE International Conference on Image Processing.' ieee='Sylvain Rousseau et al., \"Metric tensor for multicomponent edge detection,\" in 2010 IEEE International Conference on Image Processing, 2010.' mla='Rousseau, S., et al.. \"Metric tensor for multicomponent edge detection.\" 2010 IEEE International Conference on Image Processing, 2010.'",
  "paper_id='10_1007_s00357_007_0011_0' bibtex='@article{10_1007_s00357_007_0011_0,\\n  title={The Metric Bridge Partition Problem: Partitioning of a Metric Space into Two Subspaces Linked by an Edge in Any Optimal Realization},\\n  author={Alain Hertz and Sacha Varone},\\n  journal={Journal of Classification},\\n  year={2007},\\n  doi={10.1007/s00357-007-0011-0},\\n  url={https://doi.org/10.1007/s00357-007-0011-0}\\n}' apa='Hertz, A. & Varone, S. (2007). The Metric Bridge Partition Problem: Partitioning of a Metric Space into Two Subspaces Linked by an Edge in Any Optimal Realization. Journal of Classification.' ieee='Alain Hertz, Sacha Varone, \"The Metric Bridge Partition Problem: Partitioning of a Metric Space into Two Subspaces Linked by an Edge in Any Optimal Realization,\" Journal of Classification, 2007.' mla='Hertz, A., and Sacha Varone. \"The Metric Bridge Partition Problem: Partitioning of a Metric Space into Two Subspaces Linked by an Edge in Any Optimal Realization.\" Journal of Classification, 2007.'",
  "paper_id='10_12988_imf_2016_67102' bibtex='@article{10_12988_imf_2016_67102,\\n  title={General results of local metric dimensions of edge-corona of graphs},\\n  author={Rinurwati and Slamin and Herry Suprajitno},\\n  journal={International Mathematical Forum},\\n  year={2016},\\n  doi={10.12988/imf.2016.67102},\\n  url={https://doi.org/10.12988/imf.2016.67102}\\n}' apa='Rinurwati, Slamin, & Suprajitno, H. (2016). General results of local metric dimensions of edge-corona of graphs. International Mathematical Forum.' ieee='Rinurwati, Slamin, Herry Suprajitno, \"General results of local metric dimensions of edge-corona of graphs,\" International Mathematical Forum, 2016.' mla='Rinurwati, et al.. \"General results of local metric dimensions of edge-corona of graphs.\" International Mathematical Forum, 2016.'",
  "paper_id='10_54729_2789_8547_1036' bibtex='@article{10_54729_2789_8547_1036,\\n  title={PARA(NOIA)METRIC: ARCHITECTURE BEYOND THE EDGE OF RATIONALITY},\\n  author={Marwan Halabi},\\n  journal={Architecture and Planning Journal (APJ)},\\n  year={2020},\\n  doi={10.54729/2789-8547.1036},\\n  url={https://doi.org/10.54729/2789-8547.1036}\\n}' apa='Halabi, M. (2020). PARA(NOIA)METRIC: ARCHITECTURE BEYOND THE EDGE OF RATIONALITY. Architecture and Planning Journal (APJ).' ieee='Marwan Halabi, \"PARA(NOIA)METRIC: ARCHITECTURE BEYOND THE EDGE OF RATIONALITY,\" Architecture and Planning Journal (APJ), 2020.' mla='Halabi, M.. \"PARA(NOIA)METRIC: ARCHITECTURE BEYOND THE EDGE OF RATIONALITY.\" Architecture and Planning Journal (APJ), 2020.'",
  "paper_id='10_1016_j_comgeo_2009_03_008' bibtex='@article{10_1016_j_comgeo_2009_03_008,\\n  title={Computing the dilation of edge-augmented graphs in metric spaces},\\n  author={Christian Wulff-Nilsen},\\n  journal={Computational Geometry},\\n  year={2010},\\n  doi={10.1016/j.comgeo.2009.03.008},\\n  url={https://doi.org/10.1016/j.comgeo.2009.03.008}\\n}' apa='Wulff-Nilsen, C. (2010). Computing the dilation of edge-augmented graphs in metric spaces. Computational Geometry.' ieee='Christian Wulff-Nilsen, \"Computing the dilation of edge-augmented graphs in metric spaces,\" Computational Geometry, 2010.' mla='Wulff-Nilsen, C.. \"Computing the dilation of edge-augmented graphs in metric spaces.\" Computational Geometry, 2010.'",
  "paper_id='10_2140_pjm_1975_60_159' bibtex='@article{10_2140_pjm_1975_60_159,\\n  title={A metric basis characterization of Euclidean space},\\n  author={Grattan Murphy},\\n  journal={Pacific Journal of Mathematics},\\n  year={1975},\\n  doi={10.2140/pjm.1975.60.159},\\n  url={https://doi.org/10.2140/pjm.1975.60.159}\\n}' apa='Murphy, G. (1975). A metric basis characterization of Euclidean space. Pacific Journal of Mathematics.' ieee='Grattan Murphy, \"A metric basis characterization of Euclidean space,\" Pacific Journal of Mathematics, 1975.' mla='Murphy, G.. \"A metric basis characterization of Euclidean space.\" Pacific Journal of Mathematics, 1975.'",
  "paper_id='10_1109_access_2020_2990109' bibtex='@article{10_1109_access_2020_2990109,\\n  title={Barycentric Subdivision of Cayley Graphs With Constant Edge Metric Dimension},\\n  author={Ali N. A. Koam and Ali Ahmad},\\n  journal={IEEE Access},\\n  year={2020},\\n  doi={10.1109/access.2020.2990109},\\n  url={https://doi.org/10.1109/access.2020.2990109}\\n}' apa='Koam, A. N. A. & Ahmad, A. (2020). Barycentric Subdivision of Cayley Graphs With Constant Edge Metric Dimension. IEEE Access.' ieee='Ali N. A. Koam, Ali Ahmad, \"Barycentric Subdivision of Cayley Graphs With Constant Edge Metric Dimension,\" IEEE Access, 2020.' mla='Koam, A. N. A., and Ali Ahmad. \"Barycentric Subdivision of Cayley Graphs With Constant Edge Metric Dimension.\" IEEE Access, 2020.'",
  "paper_id='10_1016_s0042_6989_97_00010_2' bibtex='@article{10_1016_s0042_6989_97_00010_2,\\n  title={Gender discrimination and prediction on the basis of facial metric information},\\n  author={Jean-Marc Fellous},\\n  journal={Vision Research},\\n  year={1997},\\n  doi={10.1016/s0042-6989(97)00010-2},\\n  url={https://doi.org/10.1016/s0042-6989(97)00010-2}\\n}' apa='Fellous, J. (1997). Gender discrimination and prediction on the basis of facial metric information. Vision Research.' ieee='Jean-Marc Fellous, \"Gender discrimination and prediction on the basis of facial metric information,\" Vision Research, 1997.' mla='Fellous, J.. \"Gender discrimination and prediction on the basis of facial metric information.\" Vision Research, 1997.'",
  "paper_id='10_1201_b10166_14' bibtex='@article{10_1201_b10166_14,\\n  title={6Chapter Energy Medicine: Cutting Edge Modalities},\\n  author={},\\n  journal={The Scientific Basis of Integrative Medicine},\\n  year={2009},\\n  doi={10.1201/b10166-14},\\n  url={https://doi.org/10.1201/b10166-14}\\n}' apa='Unknown Author (2009). 6Chapter Energy Medicine: Cutting Edge Modalities. The Scientific Basis of Integrative Medicine.' ieee='Unknown Author, \"6Chapter Energy Medicine: Cutting Edge Modalities,\" The Scientific Basis of Integrative Medicine, 2009.' mla='Unknown Author. \"6Chapter Energy Medicine: Cutting Edge Modalities.\" The Scientific Basis of Integrative Medicine, 2009.'",
  "paper_id='10_1117_12_2304701_5783316325001' bibtex='@article{10_1117_12_2304701_5783316325001,\\n  title={},\\n  author={},\\n  journal={},\\n  year={2023},\\n  doi={10.1117/12.2304701.5783316325001},\\n  url={https://doi.org/10.1117/12.2304701.5783316325001}\\n}' apa='Unknown Author (2023). . .' ieee='Unknown Author, \",\" , 2023.' mla='Unknown Author. \".\" , 2023.'"
]