[
  "paper_id='10_1088_1361_6501_acffe7' bibtex='@article{10_1088_1361_6501_acffe7,\\n  title={A comparison between certain graph parameters of biswapped networks and their maximal twin-preserving subgraphs with applications in determining complexity},\\n  author={A. Rani and Asfand Fahad and I. F. Hussain and Usman Ali and Muhammad Ashraf},\\n  journal={Measurement science and technology},\\n  year={2023},\\n  doi={10.1088/1361-6501/acffe7},\\n  url={https://www.semanticscholar.org/paper/59b31c36ff9cd3d4e3fcd871ede7a41f5a15f010}\\n}' apa='Rani, A., Fahad, A., Hussain, I. F., Ali, U., & Ashraf, M. (2023). A comparison between certain graph parameters of biswapped networks and their maximal twin-preserving subgraphs with applications in determining complexity. Measurement science and technology.' ieee='A. Rani et al., \"A comparison between certain graph parameters of biswapped networks and their maximal twin-preserving subgraphs with applications in determining complexity,\" Measurement science and technology, 2023.' mla='Rani, A., et al.. \"A comparison between certain graph parameters of biswapped networks and their maximal twin-preserving subgraphs with applications in determining complexity.\" Measurement science and technology, 2023.'",
  "paper_id='10_1142_s0129054122420096' bibtex='@article{10_1142_s0129054122420096,\\n  title={Locating Number of Biswapped Networks},\\n  author={M. Nadeem and Waqar Ali and H. M. A. Siddiqui},\\n  journal={International Journal of Foundations of Computer Science},\\n  year={2022},\\n  doi={10.1142/s0129054122420096},\\n  url={https://www.semanticscholar.org/paper/e25c88cb9ee5f729b4667c341f1ba2434a75485c}\\n}' apa='Nadeem, M., Ali, W., & Siddiqui, H. M. A. (2022). Locating Number of Biswapped Networks. International Journal of Foundations of Computer Science.' ieee='M. Nadeem, Waqar Ali, H. M. A. Siddiqui, \"Locating Number of Biswapped Networks,\" International Journal of Foundations of Computer Science, 2022.' mla='Nadeem, M., et al.. \"Locating Number of Biswapped Networks.\" International Journal of Foundations of Computer Science, 2022.'",
  "paper_id='10_1038_s41598_025_29965_5' bibtex='@article{10_1038_s41598_025_29965_5,\\n  title={Average distance between the processors of biswapped networks},\\n  author={S. Prabhu and M. Anitha and N. H. Vidyarth and Paul Manuel},\\n  journal={Scientific Reports},\\n  year={2025},\\n  doi={10.1038/s41598-025-29965-5},\\n  url={https://www.semanticscholar.org/paper/afb294bb244996564b9a11bc3c46ea6b51315e24}\\n}' apa='Prabhu, S., Anitha, M., Vidyarth, N. H., & Manuel, P. (2025). Average distance between the processors of biswapped networks. Scientific Reports.' ieee='S. Prabhu et al., \"Average distance between the processors of biswapped networks,\" Scientific Reports, 2025.' mla='Prabhu, S., et al.. \"Average distance between the processors of biswapped networks.\" Scientific Reports, 2025.'",
  "paper_id='10_1093_comjnl_bxq083' bibtex='@article{10_1093_comjnl_bxq083,\\n  title={A Multipath Analysis of Biswapped Networks},\\n  author={Y. Xiang and I. A. Stewart},\\n  journal={Computer/law journal},\\n  year={2011},\\n  doi={10.1093/comjnl/bxq083},\\n  url={https://www.semanticscholar.org/paper/bef8dfb0989f8b9d5b21bb4ecf4c7e96bee9e727}\\n}' apa='Xiang, Y. & Stewart, I. A. (2011). A Multipath Analysis of Biswapped Networks. Computer/law journal.' ieee='Y. Xiang, I. A. Stewart, \"A Multipath Analysis of Biswapped Networks,\" Computer/law journal, 2011.' mla='Xiang, Y., and I. A. Stewart. \"A Multipath Analysis of Biswapped Networks.\" Computer/law journal, 2011.'",
  "paper_id='10_37418_amsj_10_6_15' bibtex='@article{10_37418_amsj_10_6_15,\\n  title={ON VE-DEGREE AND EV-DEGREE BASED TOPOLOGICAL INDICES OF CERTAIN OTIS BISWAPPED NETWORK},\\n  author={N. Zahra and M. Ibrahim},\\n  journal={Advances in Mathematics: Scientific Journal},\\n  year={2021},\\n  doi={10.37418/amsj.10.6.15},\\n  url={https://www.semanticscholar.org/paper/0417a2a8bd077e2cdb447fa2b3db9aa0a62b88f9}\\n}' apa='Zahra, N. & Ibrahim, M. (2021). ON VE-DEGREE AND EV-DEGREE BASED TOPOLOGICAL INDICES OF CERTAIN OTIS BISWAPPED NETWORK. Advances in Mathematics: Scientific Journal.' ieee='N. Zahra, M. Ibrahim, \"ON VE-DEGREE AND EV-DEGREE BASED TOPOLOGICAL INDICES OF CERTAIN OTIS BISWAPPED NETWORK,\" Advances in Mathematics: Scientific Journal, 2021.' mla='Zahra, N., and M. Ibrahim. \"ON VE-DEGREE AND EV-DEGREE BASED TOPOLOGICAL INDICES OF CERTAIN OTIS BISWAPPED NETWORK.\" Advances in Mathematics: Scientific Journal, 2021.'",
  "paper_id='10_5815_IJCNIS_2018_08_03' bibtex='@article{10_5815_IJCNIS_2018_08_03,\\n  title={Parallel Prefix Sum Algorithm on Optoelectronic Biswapped Network Hyper Hexa-cell},\\n  author={Ashish Gupta and B. K. Sarkar},\\n  journal={International Journal of Computer Network and Information Security},\\n  year={2018},\\n  doi={10.5815/IJCNIS.2018.08.03},\\n  url={https://www.semanticscholar.org/paper/cd7c4d44cf23d2df71f28b53fffe3bc15b1df11a}\\n}' apa='Gupta, A. & Sarkar, B. K. (2018). Parallel Prefix Sum Algorithm on Optoelectronic Biswapped Network Hyper Hexa-cell. International Journal of Computer Network and Information Security.' ieee='Ashish Gupta, B. K. Sarkar, \"Parallel Prefix Sum Algorithm on Optoelectronic Biswapped Network Hyper Hexa-cell,\" International Journal of Computer Network and Information Security, 2018.' mla='Gupta, A., and B. K. Sarkar. \"Parallel Prefix Sum Algorithm on Optoelectronic Biswapped Network Hyper Hexa-cell.\" International Journal of Computer Network and Information Security, 2018.'",
  "paper_id='10_1007_s13369_018_3135_0' bibtex='@article{10_1007_s13369_018_3135_0,\\n  title={The Recursive and Symmetrical Optoelectronic Network Architecture: Biswapped Network Hyper Hexa-Cell},\\n  author={Ashish Gupta and B. K. Sarkar},\\n  journal={The Arabian journal for science and engineering},\\n  year={2018},\\n  doi={10.1007/s13369-018-3135-0},\\n  url={https://www.semanticscholar.org/paper/99751838fc6be2e6b21da7cb36c71ff450c29ee4}\\n}' apa='Gupta, A. & Sarkar, B. K. (2018). The Recursive and Symmetrical Optoelectronic Network Architecture: Biswapped Network Hyper Hexa-Cell. The Arabian journal for science and engineering.' ieee='Ashish Gupta, B. K. Sarkar, \"The Recursive and Symmetrical Optoelectronic Network Architecture: Biswapped Network Hyper Hexa-Cell,\" The Arabian journal for science and engineering, 2018.' mla='Gupta, A., and B. K. Sarkar. \"The Recursive and Symmetrical Optoelectronic Network Architecture: Biswapped Network Hyper Hexa-Cell.\" The Arabian journal for science and engineering, 2018.'",
  "paper_id='10_1109_ICIS_2008_62' bibtex='@inproceedings{10_1109_ICIS_2008_62,\\n  title={Parallel Sorting on the Biswapped Network},\\n  author={Wenhong Wei and W. Xiao and Zhen Zhang},\\n  booktitle={International Conference on Interaction Sciences},\\n  year={2008},\\n  doi={10.1109/ICIS.2008.62},\\n  url={https://www.semanticscholar.org/paper/878b68da3696cf1192f18cdeccf2a9e7e0fb024b}\\n}' apa='Wei, W., Xiao, W., & Zhang, Z. (2008). Parallel Sorting on the Biswapped Network. In International Conference on Interaction Sciences.' ieee='Wenhong Wei, W. Xiao, Zhen Zhang, \"Parallel Sorting on the Biswapped Network,\" in International Conference on Interaction Sciences, 2008.' mla='Wei, W., et al.. \"Parallel Sorting on the Biswapped Network.\" International Conference on Interaction Sciences, 2008.'",
  "paper_id='10_1109_SNPD_2007_217' bibtex='@article{10_1109_SNPD_2007_217,\\n  title={Biswapped Networks and Their Topological Properties},\\n  author={W. Xiao and Weidong Chen and Mingxin He and Wenhong Wei and B. Parhami},\\n  journal={Software Engineering, Artificial Intelligence, Networking and Parallel/Distributed Computing},\\n  year={2007},\\n  doi={10.1109/SNPD.2007.217},\\n  url={https://www.semanticscholar.org/paper/237a8105baebb5bf1f12e77779c5f4ec36af0cc7}\\n}' apa='Xiao, W., Chen, W., He, M., Wei, W., & Parhami, B. (2007). Biswapped Networks and Their Topological Properties. Software Engineering, Artificial Intelligence, Networking and Parallel/Distributed Computing.' ieee='W. Xiao et al., \"Biswapped Networks and Their Topological Properties,\" Software Engineering, Artificial Intelligence, Networking and Parallel/Distributed Computing, 2007.' mla='Xiao, W., et al.. \"Biswapped Networks and Their Topological Properties.\" Software Engineering, Artificial Intelligence, Networking and Parallel/Distributed Computing, 2007.'",
  "paper_id='10_1016_j_tcs_2013_06_002' bibtex='@article{10_1016_j_tcs_2013_06_002,\\n  title={Fault isolation and identification in general biswapped networks under the PMC diagnostic model},\\n  author={Chang-Hsiung Tsai and Jheng-Cheng Chen},\\n  journal={Theoretical Computer Science},\\n  year={2013},\\n  doi={10.1016/j.tcs.2013.06.002},\\n  url={https://doi.org/10.1016/j.tcs.2013.06.002}\\n}' apa='Tsai, C. & Chen, J. (2013). Fault isolation and identification in general biswapped networks under the PMC diagnostic model. Theoretical Computer Science.' ieee='Chang-Hsiung Tsai, Jheng-Cheng Chen, \"Fault isolation and identification in general biswapped networks under the PMC diagnostic model,\" Theoretical Computer Science, 2013.' mla='Tsai, C., and Jheng-Cheng Chen. \"Fault isolation and identification in general biswapped networks under the PMC diagnostic model.\" Theoretical Computer Science, 2013.'",
  "paper_id='10_1080_00207160_2011_562893' bibtex='@article{10_1080_00207160_2011_562893,\\n  title={Biswapped networks: a family of interconnection architectures with advantages over swapped or OTIS networks},\\n  author={W. Xiao and B. Parhami and Weidong Chen and Mingxin He and Wenhong Wei},\\n  journal={International Journal of Computational Mathematics},\\n  year={2011},\\n  doi={10.1080/00207160.2011.562893},\\n  url={https://www.semanticscholar.org/paper/e8bcec2c489ac9fafbf2ee921a9084884938d587}\\n}' apa='Xiao, W., Parhami, B., Chen, W., He, M., & Wei, W. (2011). Biswapped networks: a family of interconnection architectures with advantages over swapped or OTIS networks. International Journal of Computational Mathematics.' ieee='W. Xiao et al., \"Biswapped networks: a family of interconnection architectures with advantages over swapped or OTIS networks,\" International Journal of Computational Mathematics, 2011.' mla='Xiao, W., et al.. \"Biswapped networks: a family of interconnection architectures with advantages over swapped or OTIS networks.\" International Journal of Computational Mathematics, 2011.'",
  "paper_id='10_1109_ACCESS_2024_3409420' bibtex='@article{10_1109_ACCESS_2024_3409420,\\n  title={Biswapped Networks and Their Maximal Twin-Preserving Subgraphs With a Motivation on Connection Number in Network-Based Approaches},\\n  author={K. Alhulwah and Ali N. A. Koam and Nasreen Almohanna and Ali Ahmad and M. Azeem},\\n  journal={IEEE Access},\\n  year={2024},\\n  doi={10.1109/ACCESS.2024.3409420},\\n  url={https://www.semanticscholar.org/paper/f294d940156dc6d88d24a30fd32a016190c2ae87}\\n}' apa='Alhulwah, K., Koam, A. N. A., Almohanna, N., Ahmad, A., & Azeem, M. (2024). Biswapped Networks and Their Maximal Twin-Preserving Subgraphs With a Motivation on Connection Number in Network-Based Approaches. IEEE Access.' ieee='K. Alhulwah et al., \"Biswapped Networks and Their Maximal Twin-Preserving Subgraphs With a Motivation on Connection Number in Network-Based Approaches,\" IEEE Access, 2024.' mla='Alhulwah, K., et al.. \"Biswapped Networks and Their Maximal Twin-Preserving Subgraphs With a Motivation on Connection Number in Network-Based Approaches.\" IEEE Access, 2024.'",
  "paper_id='10_48550_arXiv_2307_14984' bibtex='@article{10_48550_arXiv_2307_14984,\\n  title={S3: Social-network Simulation System with Large Language Model-Empowered Agents},\\n  author={Chen Gao and Xiaochong Lan and Zhi-jie Lu and Jinzhu Mao and J. Piao and Huandong Wang and Depeng Jin and Yong Li},\\n  journal={Social Science Research Network},\\n  year={2023},\\n  doi={10.48550/arXiv.2307.14984},\\n  url={https://www.semanticscholar.org/paper/221a72a3631ebf8b555c27bc864338390611feb1}\\n}' apa='Gao, C., Lan, X., Lu, Z., Mao, J., Piao, J., Wang, H., Jin, D., & Li, Y. (2023). S3: Social-network Simulation System with Large Language Model-Empowered Agents. Social Science Research Network.' ieee='Chen Gao et al., \"S3: Social-network Simulation System with Large Language Model-Empowered Agents,\" Social Science Research Network, 2023.' mla='Gao, C., et al.. \"S3: Social-network Simulation System with Large Language Model-Empowered Agents.\" Social Science Research Network, 2023.'",
  "paper_id='10_1162_netn_a_00323' bibtex='@article{10_1162_netn_a_00323,\\n  title={Controversies and progress on standardization of large-scale brain network nomenclature},\\n  author={L. Uddin and Richard F. Betzel and Jessica R. Cohen and J. Damoiseaux and F. Brigard and S. Eickhoff and A. Fornito and C. Gratton and Evan M. Gordon and A. Laird and L. Larson-Prior and A. Mcintosh and L. Nickerson and L. Pessoa and Ana Luísa Pinho and R. Poldrack and Adeel Razi and Sepideh Sadaghiani and J. Shine and A. Yendiki and B. T. T. Yeo and R. N. Spreng and Network Neuroscience},\\n  journal={Network Neuroscience},\\n  year={2023},\\n  doi={10.1162/netn_a_00323},\\n  url={https://www.semanticscholar.org/paper/4643b85499f94b4e6e21f145f1965d66729ab6df}\\n}' apa='Uddin, L., Betzel, R. F., Cohen, J. R., Damoiseaux, J., Brigard, F., Eickhoff, S., Fornito, A., Gratton, C., Gordon, E. M., Laird, A., Larson-Prior, L., Mcintosh, A., Nickerson, L., Pessoa, L., Pinho, A. L., Poldrack, R., Razi, A., Sadaghiani, S., Shine, J., ... Neuroscience, N. (2023). Controversies and progress on standardization of large-scale brain network nomenclature. Network Neuroscience.' ieee='L. Uddin et al., \"Controversies and progress on standardization of large-scale brain network nomenclature,\" Network Neuroscience, 2023.' mla='Uddin, L., et al.. \"Controversies and progress on standardization of large-scale brain network nomenclature.\" Network Neuroscience, 2023.'",
  "paper_id='10_1007_978_3_540_69384_0_40' bibtex='@inproceedings{10_1007_978_3_540_69384_0_40,\\n  title={Algorithms of Basic Communication Operation on the Biswapped Network},\\n  author={Wenhong Wei and W. Xiao},\\n  booktitle={International Conference on Conceptual Structures},\\n  year={2008},\\n  doi={10.1007/978-3-540-69384-0_40},\\n  url={https://www.semanticscholar.org/paper/08803e3c1df4e66d075ef7c6fb6ff7a9b21c12ef}\\n}' apa='Wei, W. & Xiao, W. (2008). Algorithms of Basic Communication Operation on the Biswapped Network. In International Conference on Conceptual Structures.' ieee='Wenhong Wei, W. Xiao, \"Algorithms of Basic Communication Operation on the Biswapped Network,\" in International Conference on Conceptual Structures, 2008.' mla='Wei, W., and W. Xiao. \"Algorithms of Basic Communication Operation on the Biswapped Network.\" International Conference on Conceptual Structures, 2008.'",
  "paper_id='10_1162_netn_a_00385' bibtex='@article{10_1162_netn_a_00385,\\n  title={The “limbic network,” comprising orbitofrontal and anterior temporal cortex, is part of an extended default network: Evidence from multi-echo fMRI},\\n  author={M. Girn and Roni Setton and G. R. Turner and R. N. Spreng and Network Neuroscience},\\n  journal={Network Neuroscience},\\n  year={2024},\\n  doi={10.1162/netn_a_00385},\\n  url={https://www.semanticscholar.org/paper/6c1cd3c25fc9cf0e83dbf37f4e6ff35a86b20891}\\n}' apa='Girn, M., Setton, R., Turner, G. R., Spreng, R. N., & Neuroscience, N. (2024). The “limbic network,” comprising orbitofrontal and anterior temporal cortex, is part of an extended default network: Evidence from multi-echo fMRI. Network Neuroscience.' ieee='M. Girn et al., \"The “limbic network,” comprising orbitofrontal and anterior temporal cortex, is part of an extended default network: Evidence from multi-echo fMRI,\" Network Neuroscience, 2024.' mla='Girn, M., et al.. \"The “limbic network,” comprising orbitofrontal and anterior temporal cortex, is part of an extended default network: Evidence from multi-echo fMRI.\" Network Neuroscience, 2024.'",
  "paper_id='10_1515_chem_2019_0029' bibtex='@article{10_1515_chem_2019_0029,\\n  title={Calculating topological indices of certain OTIS interconnection networks},\\n  author={A. Aslam and Safyan Ahmad and M. Binyamin and Wei Gao},\\n  journal={Open Chemistry},\\n  year={2019},\\n  doi={10.1515/chem-2019-0029},\\n  url={https://www.semanticscholar.org/paper/0a1da03ca0376e696d0c2ec40baa49a5d37e8e73}\\n}' apa='Aslam, A., Ahmad, S., Binyamin, M., & Gao, W. (2019). Calculating topological indices of certain OTIS interconnection networks. Open Chemistry.' ieee='A. Aslam et al., \"Calculating topological indices of certain OTIS interconnection networks,\" Open Chemistry, 2019.' mla='Aslam, A., et al.. \"Calculating topological indices of certain OTIS interconnection networks.\" Open Chemistry, 2019.'",
  "paper_id='10_1007_978_3_540_69501_1_10' bibtex='@inproceedings{10_1007_978_3_540_69501_1_10,\\n  title={Fault Tolerance in the Biswapped Network},\\n  author={Wenhong Wei and W. Xiao},\\n  booktitle={International Conference on Algorithms and Architectures for Parallel Processing},\\n  year={2008},\\n  doi={10.1007/978-3-540-69501-1_10},\\n  url={https://www.semanticscholar.org/paper/cff23d4b3e48483755ffab098f7f1dfbbc42f2c1}\\n}' apa='Wei, W. & Xiao, W. (2008). Fault Tolerance in the Biswapped Network. In International Conference on Algorithms and Architectures for Parallel Processing.' ieee='Wenhong Wei, W. Xiao, \"Fault Tolerance in the Biswapped Network,\" in International Conference on Algorithms and Architectures for Parallel Processing, 2008.' mla='Wei, W., and W. Xiao. \"Fault Tolerance in the Biswapped Network.\" International Conference on Algorithms and Architectures for Parallel Processing, 2008.'",
  "paper_id='10_1109_ISECS_2010_62' bibtex='@inproceedings{10_1109_ISECS_2010_62,\\n  title={Load Balancing on Heterogeneous Biswapped Network},\\n  author={Wenhong Wei and Yong Li},\\n  booktitle={2010 Third International Symposium on Electronic Commerce and Security},\\n  year={2010},\\n  doi={10.1109/ISECS.2010.62},\\n  url={https://www.semanticscholar.org/paper/10f006518226e3af8869695a0571381e6672e538}\\n}' apa='Wei, W. & Li, Y. (2010). Load Balancing on Heterogeneous Biswapped Network. In 2010 Third International Symposium on Electronic Commerce and Security.' ieee='Wenhong Wei, Yong Li, \"Load Balancing on Heterogeneous Biswapped Network,\" in 2010 Third International Symposium on Electronic Commerce and Security, 2010.' mla='Wei, W., and Yong Li. \"Load Balancing on Heterogeneous Biswapped Network.\" 2010 Third International Symposium on Electronic Commerce and Security, 2010.'",
  "paper_id='10_1109_ICINIS_2009_46' bibtex='@inproceedings{10_1109_ICINIS_2009_46,\\n  title={Load Balancing on the Biswapped Network},\\n  author={Yulian Yu and Wenhong Wei},\\n  booktitle={2009 Second International Conference on Intelligent Networks and Intelligent Systems},\\n  year={2009},\\n  doi={10.1109/ICINIS.2009.46},\\n  url={https://www.semanticscholar.org/paper/9840dcb5ff5296619f42c67fa4d8427f8f44205c}\\n}' apa='Yu, Y. & Wei, W. (2009). Load Balancing on the Biswapped Network. In 2009 Second International Conference on Intelligent Networks and Intelligent Systems.' ieee='Yulian Yu, Wenhong Wei, \"Load Balancing on the Biswapped Network,\" in 2009 Second International Conference on Intelligent Networks and Intelligent Systems, 2009.' mla='Yu, Y., and Wenhong Wei. \"Load Balancing on the Biswapped Network.\" 2009 Second International Conference on Intelligent Networks and Intelligent Systems, 2009.'",
  "paper_id='10_1007_s10586_012_0241_8' bibtex='@article{10_1007_s10586_012_0241_8,\\n  title={Efficient load balancing on biswapped networks},\\n  author={Chenggui Zhao},\\n  journal={Cluster Computing},\\n  year={2014},\\n  doi={10.1007/s10586-012-0241-8},\\n  url={https://www.semanticscholar.org/paper/0862a676933b41ed38d02b1560049e932582a821}\\n}' apa='Zhao, C. (2014). Efficient load balancing on biswapped networks. Cluster Computing.' ieee='Chenggui Zhao, \"Efficient load balancing on biswapped networks,\" Cluster Computing, 2014.' mla='Zhao, C.. \"Efficient load balancing on biswapped networks.\" Cluster Computing, 2014.'",
  "paper_id='10_1109_TNSE_2021_3059881' bibtex='@article{10_1109_TNSE_2021_3059881,\\n  title={CANintelliIDS: Detecting In-Vehicle Intrusion Attacks on a Controller Area Network Using CNN and Attention-Based GRU},\\n  author={Aziz Ur Rehman and S. Rehman and M. Khan and M. Alazab and G. ThippaReddy},\\n  journal={IEEE Transactions on Network Science and Engineering},\\n  year={2021},\\n  doi={10.1109/TNSE.2021.3059881},\\n  url={https://www.semanticscholar.org/paper/9a5d5a1b827276f73dbd7209c4022e694a8be1ea}\\n}' apa='Rehman, A. U., Rehman, S., Khan, M., Alazab, M., & ThippaReddy, G. (2021). CANintelliIDS: Detecting In-Vehicle Intrusion Attacks on a Controller Area Network Using CNN and Attention-Based GRU. IEEE Transactions on Network Science and Engineering.' ieee='Aziz Ur Rehman et al., \"CANintelliIDS: Detecting In-Vehicle Intrusion Attacks on a Controller Area Network Using CNN and Attention-Based GRU,\" IEEE Transactions on Network Science and Engineering, 2021.' mla='Rehman, A. U., et al.. \"CANintelliIDS: Detecting In-Vehicle Intrusion Attacks on a Controller Area Network Using CNN and Attention-Based GRU.\" IEEE Transactions on Network Science and Engineering, 2021.'",
  "paper_id='10_1007_978_3_540_76837_1_45' bibtex='@article{10_1007_978_3_540_76837_1_45,\\n  title={General Biswapped Networks and Their Topological Properties},\\n  author={Mingxin He and W. Xiao and Weidong Chen and Wenhong Wei and Zhen Zhang},\\n  journal={Advanced Parallel Programming Technologies},\\n  year={2007},\\n  doi={10.1007/978-3-540-76837-1_45},\\n  url={https://www.semanticscholar.org/paper/2e60c9f5840aca3941c71c8deaea39f984fae6cb}\\n}' apa='He, M., Xiao, W., Chen, W., Wei, W., & Zhang, Z. (2007). General Biswapped Networks and Their Topological Properties. Advanced Parallel Programming Technologies.' ieee='Mingxin He et al., \"General Biswapped Networks and Their Topological Properties,\" Advanced Parallel Programming Technologies, 2007.' mla='He, M., et al.. \"General Biswapped Networks and Their Topological Properties.\" Advanced Parallel Programming Technologies, 2007.'",
  "paper_id='10_61091_jcmcc117_01' bibtex='@article{10_61091_jcmcc117_01,\\n  title={Study of Topological Behavior of Some Computer Related Graphs},\\n  author={Xiaohui Ren and I. Ahmed and Rui Liu},\\n  journal={Journal of Combinatorial Mathematics and Combinatorial Computing},\\n  year={2023},\\n  doi={10.61091/jcmcc117-01},\\n  url={https://www.semanticscholar.org/paper/2e882cc1f010b35e0c234c56583677cd2c80e2ca}\\n}' apa='Ren, X., Ahmed, I., & Liu, R. (2023). Study of Topological Behavior of Some Computer Related Graphs. Journal of Combinatorial Mathematics and Combinatorial Computing.' ieee='Xiaohui Ren, I. Ahmed, Rui Liu, \"Study of Topological Behavior of Some Computer Related Graphs,\" Journal of Combinatorial Mathematics and Combinatorial Computing, 2023.' mla='Ren, X., et al.. \"Study of Topological Behavior of Some Computer Related Graphs.\" Journal of Combinatorial Mathematics and Combinatorial Computing, 2023.'",
  "paper_id='10_2139_ssrn_5383138' bibtex='@article{10_2139_ssrn_5383138,\\n  title={Reliability Assessment of Data Center Network Based on Expanded Biswapped Network},\\n  author={Qing Xiong and Weibei Fan and Mengjie Lv and Xueli Sun and Guijuan Wang},\\n  journal={},\\n  year={2023},\\n  doi={10.2139/ssrn.5383138},\\n  url={https://doi.org/10.2139/ssrn.5383138}\\n}' apa='Xiong, Q., Fan, W., Lv, M., Sun, X., & Wang, G. (2023). Reliability Assessment of Data Center Network Based on Expanded Biswapped Network. .' ieee='Qing Xiong et al., \"Reliability Assessment of Data Center Network Based on Expanded Biswapped Network,\" , 2023.' mla='Xiong, Q., et al.. \"Reliability Assessment of Data Center Network Based on Expanded Biswapped Network.\" , 2023.'",
  "paper_id='10_3724_sp_j_1016_2010_00822' bibtex='@article{10_3724_sp_j_1016_2010_00822,\\n  title={Topological Properties of Biswapped Networks(BSNs):Node Symmetry and Maximal Fault Tolerance},\\n  author={Chen Wei},\\n  journal={},\\n  year={2010},\\n  doi={10.3724/sp.j.1016.2010.00822},\\n  url={https://www.semanticscholar.org/paper/289e0e6ad1abd1e59d8b7fc2ca3dd27d5b4fa6cc}\\n}' apa='Wei, C. (2010). Topological Properties of Biswapped Networks(BSNs):Node Symmetry and Maximal Fault Tolerance. .' ieee='Chen Wei, \"Topological Properties of Biswapped Networks(BSNs):Node Symmetry and Maximal Fault Tolerance,\" , 2010.' mla='Wei, C.. \"Topological Properties of Biswapped Networks(BSNs):Node Symmetry and Maximal Fault Tolerance.\" , 2010.'",
  "paper_id='10_1109_CICommS_2013_6582849' bibtex='@inproceedings{10_1109_CICommS_2013_6582849,\\n  title={Efficient scheme for load balancing on heterogeneous Biswapped Networks},\\n  author={Liting Sun and Chao-nan Tong},\\n  booktitle={IEEE Symposium on Computational Intelligence for Communication Systems and Networks},\\n  year={2013},\\n  doi={10.1109/CICommS.2013.6582849},\\n  url={https://www.semanticscholar.org/paper/c8cdec856208653315e02fce592a318024d67adc}\\n}' apa='Sun, L. & Tong, C. (2013). Efficient scheme for load balancing on heterogeneous Biswapped Networks. In IEEE Symposium on Computational Intelligence for Communication Systems and Networks.' ieee='Liting Sun, Chao-nan Tong, \"Efficient scheme for load balancing on heterogeneous Biswapped Networks,\" in IEEE Symposium on Computational Intelligence for Communication Systems and Networks, 2013.' mla='Sun, L., and Chao-nan Tong. \"Efficient scheme for load balancing on heterogeneous Biswapped Networks.\" IEEE Symposium on Computational Intelligence for Communication Systems and Networks, 2013.'",
  "paper_id='10_1109_GPC_WORKSHOPS_2008_69' bibtex='@inproceedings{10_1109_GPC_WORKSHOPS_2008_69,\\n  title={Constructing Node-Disjoint Paths in Biswapped Networks (BSNs)},\\n  author={Weidong Chen and W. Xiao},\\n  booktitle={2008 The 3rd International Conference on Grid and Pervasive Computing - Workshops},\\n  year={2008},\\n  doi={10.1109/GPC.WORKSHOPS.2008.69},\\n  url={https://www.semanticscholar.org/paper/3d05a23699dd0da360f75a51fbace5f78f122c39}\\n}' apa='Chen, W. & Xiao, W. (2008). Constructing Node-Disjoint Paths in Biswapped Networks (BSNs). In 2008 The 3rd International Conference on Grid and Pervasive Computing - Workshops.' ieee='Weidong Chen, W. Xiao, \"Constructing Node-Disjoint Paths in Biswapped Networks (BSNs),\" in 2008 The 3rd International Conference on Grid and Pervasive Computing - Workshops, 2008.' mla='Chen, W., and W. Xiao. \"Constructing Node-Disjoint Paths in Biswapped Networks (BSNs).\" 2008 The 3rd International Conference on Grid and Pervasive Computing - Workshops, 2008.'",
  "paper_id='liting_a_hybrid_efficient_2013' bibtex='@article{liting_a_hybrid_efficient_2013,\\n  title={A Hybrid Efficient Load Balancing Algorithm on Biswapped Network},\\n  author={SU Li-ting},\\n  journal={},\\n  year={2013},\\n  url={https://www.semanticscholar.org/paper/c6f5adba2c4f2f7c1d3c73b15b21a9960bfe3635}\\n}' apa='Li-ting, S. (2013). A Hybrid Efficient Load Balancing Algorithm on Biswapped Network. .' ieee='SU Li-ting, \"A Hybrid Efficient Load Balancing Algorithm on Biswapped Network,\" , 2013.' mla='Li-ting, S.. \"A Hybrid Efficient Load Balancing Algorithm on Biswapped Network.\" , 2013.'",
  "paper_id='10_3724_sp_j_1087_2009_03218' bibtex='@article{10_3724_sp_j_1087_2009_03218,\\n  title={Parallel algorithm of matrix multiplication based on Biswapped network},\\n  author={Wei Wen-hong},\\n  journal={},\\n  year={2009},\\n  doi={10.3724/sp.j.1087.2009.03218},\\n  url={https://www.semanticscholar.org/paper/ea38c5194dccc2a37455d33b3d880059926a467d}\\n}' apa='Wen-hong, W. (2009). Parallel algorithm of matrix multiplication based on Biswapped network. .' ieee='Wei Wen-hong, \"Parallel algorithm of matrix multiplication based on Biswapped network,\" , 2009.' mla='Wen-hong, W.. \"Parallel algorithm of matrix multiplication based on Biswapped network.\" , 2009.'",
  "paper_id='10_3724_SP_J_1087_2009_03218' bibtex='@article{10_3724_SP_J_1087_2009_03218,\\n  title={Parallel algorithm of matrix multiplication based on Biswapped network: Parallel algorithm of matrix multiplication based on Biswapped network},\\n  author={Wenhong Wei and Qing-xia Li and Wen-feng Wang},\\n  journal={},\\n  year={2010},\\n  doi={10.3724/SP.J.1087.2009.03218},\\n  url={https://www.semanticscholar.org/paper/2c671a56b8289ea415c8e684d10db45f111663b9}\\n}' apa='Wei, W., Li, Q., & Wang, W. (2010). Parallel algorithm of matrix multiplication based on Biswapped network: Parallel algorithm of matrix multiplication based on Biswapped network. .' ieee='Wenhong Wei, Qing-xia Li, Wen-feng Wang, \"Parallel algorithm of matrix multiplication based on Biswapped network: Parallel algorithm of matrix multiplication based on Biswapped network,\" , 2010.' mla='Wei, W., et al.. \"Parallel algorithm of matrix multiplication based on Biswapped network: Parallel algorithm of matrix multiplication based on Biswapped network.\" , 2010.'",
  "paper_id='10_1017_nws_2013_2' bibtex='@article{10_1017_nws_2013_2,\\n  title={What is network science?},\\n  author={U. Brandes and G. Robins and Ann McCranie and S. Wasserman},\\n  journal={Network Science},\\n  year={2013},\\n  doi={10.1017/nws.2013.2},\\n  url={https://www.semanticscholar.org/paper/fbc980c37cb34a8275621a496ac49a39f5a333b6}\\n}' apa='Brandes, U., Robins, G., McCranie, A., & Wasserman, S. (2013). What is network science?. Network Science.' ieee='U. Brandes et al., \"What is network science?,\" Network Science, 2013.' mla='Brandes, U., et al.. \"What is network science?.\" Network Science, 2013.'",
  "paper_id='10_1093_comjnl_bxt034' bibtex='@article{10_1093_comjnl_bxt034,\\n  title={Node-to-Set Disjoint Paths in Biswapped Networks},\\n  author={S. Ling and W. Chen},\\n  journal={The Computer Journal},\\n  year={2014},\\n  doi={10.1093/comjnl/bxt034},\\n  url={https://doi.org/10.1093/comjnl/bxt034}\\n}' apa='Ling, S. & Chen, W. (2014). Node-to-Set Disjoint Paths in Biswapped Networks. The Computer Journal.' ieee='S. Ling, W. Chen, \"Node-to-Set Disjoint Paths in Biswapped Networks,\" The Computer Journal, 2014.' mla='Ling, S., and W. Chen. \"Node-to-Set Disjoint Paths in Biswapped Networks.\" The Computer Journal, 2014.'",
  "paper_id='10_1093_comjnl_bxw050' bibtex='@article{10_1093_comjnl_bxw050,\\n  title={Node-Pancyclic Properties of Biswapped Networks Based on Cycles in Their Factor Networks},\\n  author={Weidong Chen and Shan Ling},\\n  journal={The Computer Journal},\\n  year={2017},\\n  doi={10.1093/comjnl/bxw050},\\n  url={https://doi.org/10.1093/comjnl/bxw050}\\n}' apa='Chen, W. & Ling, S. (2017). Node-Pancyclic Properties of Biswapped Networks Based on Cycles in Their Factor Networks. The Computer Journal.' ieee='Weidong Chen, Shan Ling, \"Node-Pancyclic Properties of Biswapped Networks Based on Cycles in Their Factor Networks,\" The Computer Journal, 2017.' mla='Chen, W., and Shan Ling. \"Node-Pancyclic Properties of Biswapped Networks Based on Cycles in Their Factor Networks.\" The Computer Journal, 2017.'",
  "paper_id='10_1007_s40009_020_00942_y' bibtex='@article{10_1007_s40009_020_00942_y,\\n  title={Biswapped–Torus Network: A New Efficient Node-Symmetrical Optoelectronic Network},\\n  author={Ashish Gupta and B. K. Sarkar},\\n  journal={National academy science letters},\\n  year={2020},\\n  doi={10.1007/s40009-020-00942-y},\\n  url={https://www.semanticscholar.org/paper/ed114428bf3afa2a16c2ddff4fb99baaef07d0c5}\\n}' apa='Gupta, A. & Sarkar, B. K. (2020). Biswapped–Torus Network: A New Efficient Node-Symmetrical Optoelectronic Network. National academy science letters.' ieee='Ashish Gupta, B. K. Sarkar, \"Biswapped–Torus Network: A New Efficient Node-Symmetrical Optoelectronic Network,\" National academy science letters, 2020.' mla='Gupta, A., and B. K. Sarkar. \"Biswapped–Torus Network: A New Efficient Node-Symmetrical Optoelectronic Network.\" National academy science letters, 2020.'",
  "paper_id='10_1109_MNET_2024_3376419' bibtex='@article{10_1109_MNET_2024_3376419,\\n  title={NetGPT: An AI-Native Network Architecture for Provisioning Beyond Personalized Generative Services},\\n  author={Yuxuan Chen and Rongpeng Li and Zhifeng Zhao and Chenghui Peng and Jianjun Wu and E. Hossain and Honggang Zhang},\\n  journal={IEEE Network},\\n  year={2024},\\n  doi={10.1109/MNET.2024.3376419},\\n  url={https://www.semanticscholar.org/paper/631a96188809597a98cae246b679c45d60f3fb26}\\n}' apa='Chen, Y., Li, R., Zhao, Z., Peng, C., Wu, J., Hossain, E., & Zhang, H. (2024). NetGPT: An AI-Native Network Architecture for Provisioning Beyond Personalized Generative Services. IEEE Network.' ieee='Yuxuan Chen et al., \"NetGPT: An AI-Native Network Architecture for Provisioning Beyond Personalized Generative Services,\" IEEE Network, 2024.' mla='Chen, Y., et al.. \"NetGPT: An AI-Native Network Architecture for Provisioning Beyond Personalized Generative Services.\" IEEE Network, 2024.'",
  "paper_id='10_22199_issn_0717_6279_2020_04_0048' bibtex='@article{10_22199_issn_0717_6279_2020_04_0048,\\n  title={Molecular descriptors of certain OTIS interconnection networks},\\n  author={M. Cancan and Iftikhar Ahmad and Sarfarz Ahmad},\\n  journal={},\\n  year={2020},\\n  doi={10.22199/issn.0717-6279-2020-04-0048},\\n  url={https://www.semanticscholar.org/paper/f9dd1bbb0a67007ecc204783c3746ab658a67ee7}\\n}' apa='Cancan, M., Ahmad, I., & Ahmad, S. (2020). Molecular descriptors of certain OTIS interconnection networks. .' ieee='M. Cancan, Iftikhar Ahmad, Sarfarz Ahmad, \"Molecular descriptors of certain OTIS interconnection networks,\" , 2020.' mla='Cancan, M., et al.. \"Molecular descriptors of certain OTIS interconnection networks.\" , 2020.'",
  "paper_id='10_1142_s2196888821500159' bibtex='@article{10_1142_s2196888821500159,\\n  title={Optimized Parallel Prefix Sum Algorithm on Optoelectronic Biswapped-Torus Architecture},\\n  author={Ashish Gupta},\\n  journal={Vietnam Journal of Computer Science},\\n  year={2020},\\n  doi={10.1142/s2196888821500159},\\n  url={https://www.semanticscholar.org/paper/eaa23c840225534f59f85245e7ce15d5b3af7200}\\n}' apa='Gupta, A. (2020). Optimized Parallel Prefix Sum Algorithm on Optoelectronic Biswapped-Torus Architecture. Vietnam Journal of Computer Science.' ieee='Ashish Gupta, \"Optimized Parallel Prefix Sum Algorithm on Optoelectronic Biswapped-Torus Architecture,\" Vietnam Journal of Computer Science, 2020.' mla='Gupta, A.. \"Optimized Parallel Prefix Sum Algorithm on Optoelectronic Biswapped-Torus Architecture.\" Vietnam Journal of Computer Science, 2020.'",
  "paper_id='10_1109_TNSM_2022_3213370' bibtex='@article{10_1109_TNSM_2022_3213370,\\n  title={Swarm of UAVs for Network Management in 6G: A Technical Review},\\n  author={Muhammad Asghar Khan and Neeraj Kumar and S. Mohsan and Wali Ullah Khan and Moustafa M. Nasralla and Mohammed H. Alsharif and Justyna ywioek and Insaf Ullah},\\n  journal={IEEE Transactions on Network and Service Management},\\n  year={2022},\\n  doi={10.1109/TNSM.2022.3213370},\\n  url={https://www.semanticscholar.org/paper/bcd75bc37f2f742ac32e3ff1876e91c1b0a1f62e}\\n}' apa='Khan, M. A., Kumar, N., Mohsan, S., Khan, W. U., Nasralla, M. M., Alsharif, M. H., ywioek, J., & Ullah, I. (2022). Swarm of UAVs for Network Management in 6G: A Technical Review. IEEE Transactions on Network and Service Management.' ieee='Muhammad Asghar Khan et al., \"Swarm of UAVs for Network Management in 6G: A Technical Review,\" IEEE Transactions on Network and Service Management, 2022.' mla='Khan, M. A., et al.. \"Swarm of UAVs for Network Management in 6G: A Technical Review.\" IEEE Transactions on Network and Service Management, 2022.'",
  "paper_id='10_1109_NOMS54207_2022_9789878' bibtex='@inproceedings{10_1109_NOMS54207_2022_9789878,\\n  title={E-GraphSAGE: A Graph Neural Network based Intrusion Detection System for IoT},\\n  author={Wai Weng Lo and Siamak Layeghy and Mohanad Sarhan and M. Gallagher and M. Portmann},\\n  booktitle={IEEE/IFIP Network Operations and Management Symposium},\\n  year={2021},\\n  doi={10.1109/NOMS54207.2022.9789878},\\n  url={https://www.semanticscholar.org/paper/49f202fb16bb2897d4866844d4d8624a4dfa506d}\\n}' apa='Lo, W. W., Layeghy, S., Sarhan, M., Gallagher, M., & Portmann, M. (2021). E-GraphSAGE: A Graph Neural Network based Intrusion Detection System for IoT. In IEEE/IFIP Network Operations and Management Symposium.' ieee='Wai Weng Lo et al., \"E-GraphSAGE: A Graph Neural Network based Intrusion Detection System for IoT,\" in IEEE/IFIP Network Operations and Management Symposium, 2021.' mla='Lo, W. W., et al.. \"E-GraphSAGE: A Graph Neural Network based Intrusion Detection System for IoT.\" IEEE/IFIP Network Operations and Management Symposium, 2021.'",
  "paper_id='10_1109_tnsm_2021_3096673' bibtex='@article{10_1109_tnsm_2021_3096673,\\n  title={Multi-Agent DRL for Task Offloading and Resource Allocation in Multi-UAV Enabled IoT Edge Network},\\n  author={A. M. Seid and Gordon Owusu Boateng and B. Mareri and Guolin Sun and W. Jiang},\\n  journal={IEEE Transactions on Network and Service Management},\\n  year={2021},\\n  doi={10.1109/tnsm.2021.3096673},\\n  url={https://www.semanticscholar.org/paper/fefd92e8a1ace7192e5a10b25c36f23b5d6a9ab4}\\n}' apa='Seid, A. M., Boateng, G. O., Mareri, B., Sun, G., & Jiang, W. (2021). Multi-Agent DRL for Task Offloading and Resource Allocation in Multi-UAV Enabled IoT Edge Network. IEEE Transactions on Network and Service Management.' ieee='A. M. Seid et al., \"Multi-Agent DRL for Task Offloading and Resource Allocation in Multi-UAV Enabled IoT Edge Network,\" IEEE Transactions on Network and Service Management, 2021.' mla='Seid, A. M., et al.. \"Multi-Agent DRL for Task Offloading and Resource Allocation in Multi-UAV Enabled IoT Edge Network.\" IEEE Transactions on Network and Service Management, 2021.'",
  "paper_id='10_1016_j_jpdc_2024_105009' bibtex='@article{10_1016_j_jpdc_2024_105009,\\n  title={Fault-tolerance in biswapped multiprocessor interconnection networks},\\n  author={Basem Assiri and Muhammad Faisal Nadeem and Waqar Ali and Ali Ahmad},\\n  journal={J. Parallel Distributed Comput.},\\n  year={2025},\\n  doi={10.1016/j.jpdc.2024.105009},\\n  url={https://www.semanticscholar.org/paper/a2ac6f0b3b2f12d526b92dfa39ed2e03320cf477}\\n}' apa='Assiri, B., Nadeem, M. F., Ali, W., & Ahmad, A. (2025). Fault-tolerance in biswapped multiprocessor interconnection networks. J. Parallel Distributed Comput..' ieee='Basem Assiri et al., \"Fault-tolerance in biswapped multiprocessor interconnection networks,\" J. Parallel Distributed Comput., 2025.' mla='Assiri, B., et al.. \"Fault-tolerance in biswapped multiprocessor interconnection networks.\" J. Parallel Distributed Comput., 2025.'",
  "paper_id='10_14722_ndss_2018_23211' bibtex='@inproceedings{10_14722_ndss_2018_23211,\\n  title={Kitsune: An Ensemble of Autoencoders for Online Network Intrusion Detection},\\n  author={Yisroel Mirsky and Tomer Doitshman and Y. Elovici and A. Shabtai},\\n  booktitle={Network and Distributed System Security Symposium},\\n  year={2018},\\n  doi={10.14722/ndss.2018.23211},\\n  url={https://www.semanticscholar.org/paper/fa11df1157486731afe86af7d6d9254a82d4dbd6}\\n}' apa='Mirsky, Y., Doitshman, T., Elovici, Y., & Shabtai, A. (2018). Kitsune: An Ensemble of Autoencoders for Online Network Intrusion Detection. In Network and Distributed System Security Symposium.' ieee='Yisroel Mirsky et al., \"Kitsune: An Ensemble of Autoencoders for Online Network Intrusion Detection,\" in Network and Distributed System Security Symposium, 2018.' mla='Mirsky, Y., et al.. \"Kitsune: An Ensemble of Autoencoders for Online Network Intrusion Detection.\" Network and Distributed System Security Symposium, 2018.'",
  "paper_id='10_1109_SNPD_2007_51' bibtex='@article{10_1109_SNPD_2007_51,\\n  title={Matrix Multiplication on the Biswapped-Mesh Network},\\n  author={Wenhong Wei and W. Xiao},\\n  journal={Software Engineering, Artificial Intelligence, Networking and Parallel/Distributed Computing},\\n  year={2007},\\n  doi={10.1109/SNPD.2007.51},\\n  url={https://www.semanticscholar.org/paper/9770ab7f8e3e6a1ebb990bf9c3b7b98b3466976d}\\n}' apa='Wei, W. & Xiao, W. (2007). Matrix Multiplication on the Biswapped-Mesh Network. Software Engineering, Artificial Intelligence, Networking and Parallel/Distributed Computing.' ieee='Wenhong Wei, W. Xiao, \"Matrix Multiplication on the Biswapped-Mesh Network,\" Software Engineering, Artificial Intelligence, Networking and Parallel/Distributed Computing, 2007.' mla='Wei, W., and W. Xiao. \"Matrix Multiplication on the Biswapped-Mesh Network.\" Software Engineering, Artificial Intelligence, Networking and Parallel/Distributed Computing, 2007.'",
  "paper_id='10_1109_ICIC_2009_49' bibtex='@inproceedings{10_1109_ICIC_2009_49,\\n  title={Broadcasting on the BSN-Hypercube Network},\\n  author={He-ping Ye and W. Xiao and Jiao-yu Wu},\\n  booktitle={2009 Second International Conference on Information and Computing Science},\\n  year={2009},\\n  doi={10.1109/ICIC.2009.49},\\n  url={https://www.semanticscholar.org/paper/d20beb6f7bda55252553befc91acb822a3c8becd}\\n}' apa='Ye, H., Xiao, W., & Wu, J. (2009). Broadcasting on the BSN-Hypercube Network. In 2009 Second International Conference on Information and Computing Science.' ieee='He-ping Ye, W. Xiao, Jiao-yu Wu, \"Broadcasting on the BSN-Hypercube Network,\" in 2009 Second International Conference on Information and Computing Science, 2009.' mla='Ye, H., et al.. \"Broadcasting on the BSN-Hypercube Network.\" 2009 Second International Conference on Information and Computing Science, 2009.'",
  "paper_id='10_5815_ijcnis_2022_01_06' bibtex='@article{10_5815_ijcnis_2022_01_06,\\n  title={Optimized Parallel Counting Sort Algorithm for Distinct Numeric Values on Biswapped Hyper Hexa-Cell Optoelectronic Network},\\n  author={Ashish Gupta},\\n  journal={International Journal of Computer Network and Information Security},\\n  year={2021},\\n  doi={10.5815/ijcnis.2022.01.06},\\n  url={https://www.semanticscholar.org/paper/f769876cab5d81cd03d01b6c1150bb387500ed00}\\n}' apa='Gupta, A. (2021). Optimized Parallel Counting Sort Algorithm for Distinct Numeric Values on Biswapped Hyper Hexa-Cell Optoelectronic Network. International Journal of Computer Network and Information Security.' ieee='Ashish Gupta, \"Optimized Parallel Counting Sort Algorithm for Distinct Numeric Values on Biswapped Hyper Hexa-Cell Optoelectronic Network,\" International Journal of Computer Network and Information Security, 2021.' mla='Gupta, A.. \"Optimized Parallel Counting Sort Algorithm for Distinct Numeric Values on Biswapped Hyper Hexa-Cell Optoelectronic Network.\" International Journal of Computer Network and Information Security, 2021.'",
  "paper_id='10_1007_978_1_4939_7131_2_101152' bibtex='@article{10_1007_978_1_4939_7131_2_101152,\\n  title={Social Network Analysis},\\n  author={Tracy M. Sweet},\\n  journal={Encyclopedia of Social Network Analysis and Mining. 2nd Ed.},\\n  year={2018},\\n  doi={10.1007/978-1-4939-7131-2_101152},\\n  url={https://www.semanticscholar.org/paper/a9e5b61738fdcc0a9233aae2ad5ac3dd9d088f08}\\n}' apa='Sweet, T. M. (2018). Social Network Analysis. Encyclopedia of Social Network Analysis and Mining. 2nd Ed..' ieee='Tracy M. Sweet, \"Social Network Analysis,\" Encyclopedia of Social Network Analysis and Mining. 2nd Ed., 2018.' mla='Sweet, T. M.. \"Social Network Analysis.\" Encyclopedia of Social Network Analysis and Mining. 2nd Ed., 2018.'",
  "paper_id='10_1007_978_1_4939_7131_2_100721' bibtex='@article{10_1007_978_1_4939_7131_2_100721,\\n  title={Network Analysis},\\n  author={Natalie Lambert},\\n  journal={Encyclopedia of Social Network Analysis and Mining. 2nd Ed.},\\n  year={2018},\\n  doi={10.1007/978-1-4939-7131-2_100721},\\n  url={https://www.semanticscholar.org/paper/bf1a38628c53b6d06a575d43fba612ad394c5798}\\n}' apa='Lambert, N. (2018). Network Analysis. Encyclopedia of Social Network Analysis and Mining. 2nd Ed..' ieee='Natalie Lambert, \"Network Analysis,\" Encyclopedia of Social Network Analysis and Mining. 2nd Ed., 2018.' mla='Lambert, N.. \"Network Analysis.\" Encyclopedia of Social Network Analysis and Mining. 2nd Ed., 2018.'",
  "paper_id='10_3403_30168736u' bibtex='@article{10_3403_30168736u,\\n  title={Multimedia home network. Network interfaces for network adapter},\\n  author={},\\n  journal={},\\n  year={2023},\\n  doi={10.3403/30168736u},\\n  url={https://doi.org/10.3403/30168736u}\\n}' apa='Unknown Author (2023). Multimedia home network. Network interfaces for network adapter. .' ieee='Unknown Author, \"Multimedia home network. Network interfaces for network adapter,\" , 2023.' mla='Unknown Author. \"Multimedia home network. Network interfaces for network adapter.\" , 2023.'",
  "paper_id='10_5353_th_b3126831' bibtex='@article{10_5353_th_b3126831,\\n  title={Business network : network marketing : analysis of network marketing using business network theories},\\n  author={Pui-kuen Tang},\\n  journal={},\\n  year={2023},\\n  doi={10.5353/th_b3126831},\\n  url={https://doi.org/10.5353/th_b3126831}\\n}' apa='Tang, P. (2023). Business network : network marketing : analysis of network marketing using business network theories. .' ieee='Pui-kuen Tang, \"Business network : network marketing : analysis of network marketing using business network theories,\" , 2023.' mla='Tang, P.. \"Business network : network marketing : analysis of network marketing using business network theories.\" , 2023.'",
  "paper_id='10_2172_2005192' bibtex='@article{10_2172_2005192,\\n  title={Network Calculus and Mu2e event building Network},\\n  author={Hiu kao},\\n  journal={Network Calculus and Mu2e event building Network},\\n  year={2023},\\n  doi={10.2172/2005192},\\n  url={https://doi.org/10.2172/2005192}\\n}' apa='kao, H. (2023). Network Calculus and Mu2e event building Network. Network Calculus and Mu2e event building Network.' ieee='Hiu kao, \"Network Calculus and Mu2e event building Network,\" Network Calculus and Mu2e event building Network, 2023.' mla='kao, H.. \"Network Calculus and Mu2e event building Network.\" Network Calculus and Mu2e event building Network, 2023.'",
  "paper_id='10_1007_springerreference_19661' bibtex='@article{10_1007_springerreference_19661,\\n  title={network-network interface},\\n  author={},\\n  journal={SpringerReference},\\n  year={2023},\\n  doi={10.1007/springerreference_19661},\\n  url={https://doi.org/10.1007/springerreference_19661}\\n}' apa='Unknown Author (2023). network-network interface. SpringerReference.' ieee='Unknown Author, \"network-network interface,\" SpringerReference, 2023.' mla='Unknown Author. \"network-network interface.\" SpringerReference, 2023.'",
  "paper_id='10_3390_network3010004' bibtex='@article{10_3390_network3010004,\\n  title={Acknowledgment to the Reviewers of Network in 2022},\\n  author={},\\n  journal={Network},\\n  year={2023},\\n  doi={10.3390/network3010004},\\n  url={https://doi.org/10.3390/network3010004}\\n}' apa='Unknown Author (2023). Acknowledgment to the Reviewers of Network in 2022. Network.' ieee='Unknown Author, \"Acknowledgment to the Reviewers of Network in 2022,\" Network, 2023.' mla='Unknown Author. \"Acknowledgment to the Reviewers of Network in 2022.\" Network, 2023.'",
  "paper_id='10_3390_network2010006' bibtex='@article{10_3390_network2010006,\\n  title={Acknowledgment to Reviewers of Network in 2021},\\n  author={},\\n  journal={Network},\\n  year={2022},\\n  doi={10.3390/network2010006},\\n  url={https://doi.org/10.3390/network2010006}\\n}' apa='Unknown Author (2022). Acknowledgment to Reviewers of Network in 2021. Network.' ieee='Unknown Author, \"Acknowledgment to Reviewers of Network in 2021,\" Network, 2022.' mla='Unknown Author. \"Acknowledgment to Reviewers of Network in 2021.\" Network, 2022.'",
  "paper_id='10_1080_02564602_2020_1823251' bibtex='@article{10_1080_02564602_2020_1823251,\\n  title={BSN MOT: A Fast and Cost-efficient Optoelectronic Architecture},\\n  author={Ashish Gupta and B. K. Sarkar},\\n  journal={IETE Technical Review},\\n  year={2020},\\n  doi={10.1080/02564602.2020.1823251},\\n  url={https://www.semanticscholar.org/paper/55a72b8e04275a3bd81e9d218e502e7f203e7421}\\n}' apa='Gupta, A. & Sarkar, B. K. (2020). BSN MOT: A Fast and Cost-efficient Optoelectronic Architecture. IETE Technical Review.' ieee='Ashish Gupta, B. K. Sarkar, \"BSN MOT: A Fast and Cost-efficient Optoelectronic Architecture,\" IETE Technical Review, 2020.' mla='Gupta, A., and B. K. Sarkar. \"BSN MOT: A Fast and Cost-efficient Optoelectronic Architecture.\" IETE Technical Review, 2020.'",
  "paper_id='10_4304_jnw_5_9_994_1000' bibtex='@article{10_4304_jnw_5_9_994_1000,\\n  title={Principle of Symmetry for Network Topology with Applications to Some Networks},\\n  author={Zhaoquan Cai and W. Xiao and Qin Zhang and Yanxia Liu},\\n  journal={J. Networks},\\n  year={2010},\\n  doi={10.4304/jnw.5.9.994-1000},\\n  url={https://www.semanticscholar.org/paper/4fd0630545977ca6b5f16737dec1e8702d55ffb7}\\n}' apa='Cai, Z., Xiao, W., Zhang, Q., & Liu, Y. (2010). Principle of Symmetry for Network Topology with Applications to Some Networks. J. Networks.' ieee='Zhaoquan Cai et al., \"Principle of Symmetry for Network Topology with Applications to Some Networks,\" J. Networks, 2010.' mla='Cai, Z., et al.. \"Principle of Symmetry for Network Topology with Applications to Some Networks.\" J. Networks, 2010.'",
  "paper_id='10_1504_IJGUC_2015_070684' bibtex='@article{10_1504_IJGUC_2015_070684,\\n  title={BSN-mesh and its basic parallel algorithms},\\n  author={Wenhong Wei and Qingxia Li and Ming Tao},\\n  journal={International Journal of Grid and Utility Computing},\\n  year={2015},\\n  doi={10.1504/IJGUC.2015.070684},\\n  url={https://www.semanticscholar.org/paper/58edb103b28f0435661c2ff02244a22433b2bc8c}\\n}' apa='Wei, W., Li, Q., & Tao, M. (2015). BSN-mesh and its basic parallel algorithms. International Journal of Grid and Utility Computing.' ieee='Wenhong Wei, Qingxia Li, Ming Tao, \"BSN-mesh and its basic parallel algorithms,\" International Journal of Grid and Utility Computing, 2015.' mla='Wei, W., et al.. \"BSN-mesh and its basic parallel algorithms.\" International Journal of Grid and Utility Computing, 2015.'",
  "paper_id='10_1093_ofid_ofv133_1465' bibtex='@article{10_1093_ofid_ofv133_1465,\\n  title={Preliminary End-of-Season Estimates of 2014/15 Influenza Vaccine Effectiveness in Preventing Laboratory-Confirmed Influenza-Related Hospitalization From the Serious Outcomes Surveillance (SOS) Network of the Canadian Immunization Research Network (CIRN)},\\n  author={Shelly Mcneil and Ardith Ambrose and Melissa K. Andrew and Guy Boivin and William Bowie and Gael Dos Santos and May Elsherif and Karen Green and Francois Haguinet and Todd Hatchette and Kevin Katz and Jason Leblanc and Mark Loeb and Donna Mackinnon-Cameron and Anne E. Mccarthy and Janet E. Mcelhaney and Allison Mcgeer and Jeff Powis and David Richardson and Makeda Semret and Rohita Sharma and Vivek Shinde and Daniel Smyth and Sylvie Trottier and Louis Valiquette and Duncan Webster and Lingyun Ye},\\n  journal={Open Forum Infectious Diseases},\\n  year={2015},\\n  doi={10.1093/ofid/ofv133.1465},\\n  url={https://doi.org/10.1093/ofid/ofv133.1465}\\n}' apa='Mcneil, S., Ambrose, A., Andrew, M. K., Boivin, G., Bowie, W., Santos, G. D., Elsherif, M., Green, K., Haguinet, F., Hatchette, T., Katz, K., Leblanc, J., Loeb, M., Mackinnon-Cameron, D., Mccarthy, A. E., Mcelhaney, J. E., Mcgeer, A., Powis, J., Richardson, D., ... Ye, L. (2015). Preliminary End-of-Season Estimates of 2014/15 Influenza Vaccine Effectiveness in Preventing Laboratory-Confirmed Influenza-Related Hospitalization From the Serious Outcomes Surveillance (SOS) Network of the Canadian Immunization Research Network (CIRN). Open Forum Infectious Diseases.' ieee='Shelly Mcneil et al., \"Preliminary End-of-Season Estimates of 2014/15 Influenza Vaccine Effectiveness in Preventing Laboratory-Confirmed Influenza-Related Hospitalization From the Serious Outcomes Surveillance (SOS) Network of the Canadian Immunization Research Network (CIRN),\" Open Forum Infectious Diseases, 2015.' mla='Mcneil, S., et al.. \"Preliminary End-of-Season Estimates of 2014/15 Influenza Vaccine Effectiveness in Preventing Laboratory-Confirmed Influenza-Related Hospitalization From the Serious Outcomes Surveillance (SOS) Network of the Canadian Immunization Research Network (CIRN).\" Open Forum Infectious Diseases, 2015.'",
  "paper_id='10_1109_mnet_2012_6308064' bibtex='@article{10_1109_mnet_2012_6308064,\\n  title={IEEE Network [cover]},\\n  author={},\\n  journal={IEEE Network},\\n  year={2012},\\n  doi={10.1109/mnet.2012.6308064},\\n  url={https://doi.org/10.1109/mnet.2012.6308064}\\n}' apa='Unknown Author (2012). IEEE Network [cover]. IEEE Network.' ieee='Unknown Author, \"IEEE Network [cover],\" IEEE Network, 2012.' mla='Unknown Author. \"IEEE Network [cover].\" IEEE Network, 2012.'",
  "paper_id='10_1016_s1353_4858_00_80009_4' bibtex='@article{10_1016_s1353_4858_00_80009_4,\\n  title={Managing network security: Simulating network security},\\n  author={Fred Cohen},\\n  journal={Network Security},\\n  year={1999},\\n  doi={10.1016/s1353-4858(00)80009-4},\\n  url={https://doi.org/10.1016/s1353-4858(00)80009-4}\\n}' apa='Cohen, F. (1999). Managing network security: Simulating network security. Network Security.' ieee='Fred Cohen, \"Managing network security: Simulating network security,\" Network Security, 1999.' mla='Cohen, F.. \"Managing network security: Simulating network security.\" Network Security, 1999.'",
  "paper_id='10_1002_0471650129_dob0482' bibtex='@article{10_1002_0471650129_dob0482,\\n  title={Network (Genetic Network, Metabolic Network, Molecular Network)},\\n  author={Denis Thieffry},\\n  journal={Dictionary of Bioinformatics and Computational Biology},\\n  year={2004},\\n  doi={10.1002/0471650129.dob0482},\\n  url={https://doi.org/10.1002/0471650129.dob0482}\\n}' apa='Thieffry, D. (2004). Network (Genetic Network, Metabolic Network, Molecular Network). Dictionary of Bioinformatics and Computational Biology.' ieee='Denis Thieffry, \"Network (Genetic Network, Metabolic Network, Molecular Network),\" Dictionary of Bioinformatics and Computational Biology, 2004.' mla='Thieffry, D.. \"Network (Genetic Network, Metabolic Network, Molecular Network).\" Dictionary of Bioinformatics and Computational Biology, 2004.'",
  "paper_id='10_1109_mnet_2011_5772051' bibtex='@article{10_1109_mnet_2011_5772051,\\n  title={IEEE Network},\\n  author={},\\n  journal={IEEE Network},\\n  year={2011},\\n  doi={10.1109/mnet.2011.5772051},\\n  url={https://doi.org/10.1109/mnet.2011.5772051}\\n}' apa='Unknown Author (2011). IEEE Network. IEEE Network.' ieee='Unknown Author, \"IEEE Network,\" IEEE Network, 2011.' mla='Unknown Author. \"IEEE Network.\" IEEE Network, 2011.'",
  "paper_id='10_1109_mnet_2006_273117' bibtex='@article{10_1109_mnet_2006_273117,\\n  title={IEEE Network Magazine Call For Papers Advances In Network Systems Architecture},\\n  author={},\\n  journal={IEEE Network},\\n  year={2006},\\n  doi={10.1109/mnet.2006.273117},\\n  url={https://doi.org/10.1109/mnet.2006.273117}\\n}' apa='Unknown Author (2006). IEEE Network Magazine Call For Papers Advances In Network Systems Architecture. IEEE Network.' ieee='Unknown Author, \"IEEE Network Magazine Call For Papers Advances In Network Systems Architecture,\" IEEE Network, 2006.' mla='Unknown Author. \"IEEE Network Magazine Call For Papers Advances In Network Systems Architecture.\" IEEE Network, 2006.'",
  "paper_id='10_1109_mnet_2011_6085633' bibtex='@article{10_1109_mnet_2011_6085633,\\n  title={IEEE Network - Cover},\\n  author={},\\n  journal={IEEE Network},\\n  year={2011},\\n  doi={10.1109/mnet.2011.6085633},\\n  url={https://doi.org/10.1109/mnet.2011.6085633}\\n}' apa='Unknown Author (2011). IEEE Network - Cover. IEEE Network.' ieee='Unknown Author, \"IEEE Network - Cover,\" IEEE Network, 2011.' mla='Unknown Author. \"IEEE Network - Cover.\" IEEE Network, 2011.'",
  "paper_id='unknown_pubmed_paper_41331308_2023' bibtex='@article{unknown_pubmed_paper_41331308_2023,\\n  title={PubMed Paper 41331308},\\n  author={Unknown},\\n  journal={PubMed},\\n  year={2023},\\n  url={https://pubmed.ncbi.nlm.nih.gov/41331308/}\\n}' apa='Unknown (2023). PubMed Paper 41331308. PubMed.' ieee='Unknown, \"PubMed Paper 41331308,\" PubMed, 2023.' mla='Unknown. \"PubMed Paper 41331308.\" PubMed, 2023.'",
  "paper_id='10_1109_EIDWT_2013_12' bibtex='@inproceedings{10_1109_EIDWT_2013_12,\\n  title={Parallel Prefix Algorithm on BSN-Mesh},\\n  author={Wenhong Wei and Qingxia Li and Ming Tao},\\n  booktitle={2013 Fourth International Conference on Emerging Intelligent Data and Web Technologies},\\n  year={2013},\\n  doi={10.1109/EIDWT.2013.12},\\n  url={https://www.semanticscholar.org/paper/02a963720789a0e9594efb2bc0ac10f6163b9316}\\n}' apa='Wei, W., Li, Q., & Tao, M. (2013). Parallel Prefix Algorithm on BSN-Mesh. In 2013 Fourth International Conference on Emerging Intelligent Data and Web Technologies.' ieee='Wenhong Wei, Qingxia Li, Ming Tao, \"Parallel Prefix Algorithm on BSN-Mesh,\" in 2013 Fourth International Conference on Emerging Intelligent Data and Web Technologies, 2013.' mla='Wei, W., et al.. \"Parallel Prefix Algorithm on BSN-Mesh.\" 2013 Fourth International Conference on Emerging Intelligent Data and Web Technologies, 2013.'",
  "paper_id='bourgeois_algorithms_and_architectures_2008' bibtex='@article{bourgeois_algorithms_and_architectures_2008,\\n  title={Algorithms and architectures for parallel processing : 8th international conference, ICA3PP 2008, Cyprus, June 9-11, 2008 : proceedings},\\n  author={Anu G. Bourgeois and S. Q. Zheng},\\n  journal={},\\n  year={2008},\\n  url={https://www.semanticscholar.org/paper/edfe11d8ed261e41c569bef1a6ba7370d01e41b3}\\n}' apa='Bourgeois, A. G. & Zheng, S. Q. (2008). Algorithms and architectures for parallel processing : 8th international conference, ICA3PP 2008, Cyprus, June 9-11, 2008 : proceedings. .' ieee='Anu G. Bourgeois, S. Q. Zheng, \"Algorithms and architectures for parallel processing : 8th international conference, ICA3PP 2008, Cyprus, June 9-11, 2008 : proceedings,\" , 2008.' mla='Bourgeois, A. G., and S. Q. Zheng. \"Algorithms and architectures for parallel processing : 8th international conference, ICA3PP 2008, Cyprus, June 9-11, 2008 : proceedings.\" , 2008.'"
]