[
  "paper_id='10_11648_j_mcs_20251001_13' bibtex='@article{10_11648_j_mcs_20251001_13,\\n  title={Graph Entropy Based on Wiener Polarity Index Under Four Kinds of Graph Operations},\\n  author={Chen Yang and Chongmin Li},\\n  journal={Mathematics and Computer Science},\\n  year={2025},\\n  doi={10.11648/j.mcs.20251001.13},\\n  url={https://doi.org/10.11648/j.mcs.20251001.13}\\n}' apa='Yang, C. & Li, C. (2025). Graph Entropy Based on Wiener Polarity Index Under Four Kinds of Graph Operations. Mathematics and Computer Science.' ieee='Chen Yang, Chongmin Li, \"Graph Entropy Based on Wiener Polarity Index Under Four Kinds of Graph Operations,\" Mathematics and Computer Science, 2025.' mla='Yang, C., and Chongmin Li. \"Graph Entropy Based on Wiener Polarity Index Under Four Kinds of Graph Operations.\" Mathematics and Computer Science, 2025.'",
  "paper_id='10_1155_2021_2757925' bibtex='@article{10_1155_2021_2757925,\\n  title={On Wiener Polarity Index and Wiener Index of Certain Triangular Networks},\\n  author={Mr. Adnan and Syed Ahtsham Ul Haq Bokhary and Muhammad Imran},\\n  journal={Journal of Chemistry},\\n  year={2021},\\n  doi={10.1155/2021/2757925},\\n  url={https://doi.org/10.1155/2021/2757925}\\n}' apa='Adnan, M., Bokhary, S. A. U. H., & Imran, M. (2021). On Wiener Polarity Index and Wiener Index of Certain Triangular Networks. Journal of Chemistry.' ieee='Mr. Adnan, Syed Ahtsham Ul Haq Bokhary, Muhammad Imran, \"On Wiener Polarity Index and Wiener Index of Certain Triangular Networks,\" Journal of Chemistry, 2021.' mla='Adnan, M., et al.. \"On Wiener Polarity Index and Wiener Index of Certain Triangular Networks.\" Journal of Chemistry, 2021.'",
  "paper_id='10_1002_qua_26627' bibtex='@article{10_1002_qua_26627,\\n  title={Wiener polarity index and related molecular topological descriptors of titanium oxide nanotubes},\\n  author={Muhammad Imran and Mehar Ali Malik and Ramsha Javed},\\n  journal={International Journal of Quantum Chemistry},\\n  year={2021},\\n  doi={10.1002/qua.26627},\\n  url={https://doi.org/10.1002/qua.26627}\\n}' apa='Imran, M., Malik, M. A., & Javed, R. (2021). Wiener polarity index and related molecular topological descriptors of titanium oxide nanotubes. International Journal of Quantum Chemistry.' ieee='Muhammad Imran, Mehar Ali Malik, Ramsha Javed, \"Wiener polarity index and related molecular topological descriptors of titanium oxide nanotubes,\" International Journal of Quantum Chemistry, 2021.' mla='Imran, M., et al.. \"Wiener polarity index and related molecular topological descriptors of titanium oxide nanotubes.\" International Journal of Quantum Chemistry, 2021.'",
  "paper_id='10_1155_2021_6686352' bibtex='@article{10_1155_2021_6686352,\\n  title={Wiener Polarity Index Calculation of Square-Free Graphs and Its Implementation to Certain Complex Materials},\\n  author={Lin Zhang and Tian-Le Sun and Micheal Arockiaraj and M. Arulperumjothi and S. Prabhu},\\n  journal={Mathematical Problems in Engineering},\\n  year={2021},\\n  doi={10.1155/2021/6686352},\\n  url={https://doi.org/10.1155/2021/6686352}\\n}' apa='Zhang, L., Sun, T., Arockiaraj, M., Arulperumjothi, M., & Prabhu, S. (2021). Wiener Polarity Index Calculation of Square-Free Graphs and Its Implementation to Certain Complex Materials. Mathematical Problems in Engineering.' ieee='Lin Zhang et al., \"Wiener Polarity Index Calculation of Square-Free Graphs and Its Implementation to Certain Complex Materials,\" Mathematical Problems in Engineering, 2021.' mla='Zhang, L., et al.. \"Wiener Polarity Index Calculation of Square-Free Graphs and Its Implementation to Certain Complex Materials.\" Mathematical Problems in Engineering, 2021.'",
  "paper_id='10_1002_qua_26631' bibtex='@article{10_1002_qua_26631,\\n  title={On the second maximum Wiener polarity index of chemical trees of a fixed order},\\n  author={Akbar Ali and Zhibin Du and Syeda Sifwa Zaineb and Tariq Alraqad},\\n  journal={International Journal of Quantum Chemistry},\\n  year={2021},\\n  doi={10.1002/qua.26631},\\n  url={https://doi.org/10.1002/qua.26631}\\n}' apa='Ali, A., Du, Z., Zaineb, S. S., & Alraqad, T. (2021). On the second maximum Wiener polarity index of chemical trees of a fixed order. International Journal of Quantum Chemistry.' ieee='Akbar Ali et al., \"On the second maximum Wiener polarity index of chemical trees of a fixed order,\" International Journal of Quantum Chemistry, 2021.' mla='Ali, A., et al.. \"On the second maximum Wiener polarity index of chemical trees of a fixed order.\" International Journal of Quantum Chemistry, 2021.'",
  "paper_id='arxiv_1106_2986' bibtex='@article{arxiv_1106_2986,\\n  title={Generalizations of Wiener polarity index and terminal Wiener index},\\n  author={Aleksandar Ilic and Milovan Ilic},\\n  journal={arXiv preprint arXiv:1106.2986},\\n  year={2011},\\n  url={http://arxiv.org/abs/1106.2986v2}\\n}' apa='Ilic, A. & Ilic, M. (2011). Generalizations of Wiener polarity index and terminal Wiener index. arXiv preprint arXiv:1106.2986.' ieee='Aleksandar Ilic, Milovan Ilic, \"Generalizations of Wiener polarity index and terminal Wiener index,\" arXiv preprint arXiv:1106.2986, 2011.' mla='Ilic, A., and Milovan Ilic. \"Generalizations of Wiener polarity index and terminal Wiener index.\" arXiv, 1106.2986, 2011.'",
  "paper_id='arxiv_1211_3513' bibtex='@article{arxiv_1211_3513,\\n  title={On Wiener polarity index of cactus graphs},\\n  author={Nan Chen and Wen-Xue Du and Yi-Zheng Fan},\\n  journal={arXiv preprint arXiv:1211.3513},\\n  year={2012},\\n  url={http://arxiv.org/abs/1211.3513v1}\\n}' apa='Chen, N., Du, W., & Fan, Y. (2012). On Wiener polarity index of cactus graphs. arXiv preprint arXiv:1211.3513.' ieee='Nan Chen, Wen-Xue Du, Yi-Zheng Fan, \"On Wiener polarity index of cactus graphs,\" arXiv preprint arXiv:1211.3513, 2012.' mla='Chen, N., et al.. \"On Wiener polarity index of cactus graphs.\" arXiv, 1211.3513, 2012.'",
  "paper_id='arxiv_1711_03600' bibtex='@article{arxiv_1711_03600,\\n  title={The Wiener polarity index of benzenoid systems and nanotubes},\\n  author={Niko Tratnik},\\n  journal={arXiv preprint arXiv:1711.03600},\\n  year={2017},\\n  url={http://arxiv.org/abs/1711.03600v1}\\n}' apa='Tratnik, N. (2017). The Wiener polarity index of benzenoid systems and nanotubes. arXiv preprint arXiv:1711.03600.' ieee='Niko Tratnik, \"The Wiener polarity index of benzenoid systems and nanotubes,\" arXiv preprint arXiv:1711.03600, 2017.' mla='Tratnik, N.. \"The Wiener polarity index of benzenoid systems and nanotubes.\" arXiv, 1711.03600, 2017.'",
  "paper_id='arxiv_1801_05963' bibtex='@article{arxiv_1801_05963,\\n  title={Formula for calculating the Wiener polarity index with applications to benzenoid graphs and phenylenes},\\n  author={Niko Tratnik},\\n  journal={arXiv preprint arXiv:1801.05963},\\n  year={2018},\\n  url={http://arxiv.org/abs/1801.05963v2}\\n}' apa='Tratnik, N. (2018). Formula for calculating the Wiener polarity index with applications to benzenoid graphs and phenylenes. arXiv preprint arXiv:1801.05963.' ieee='Niko Tratnik, \"Formula for calculating the Wiener polarity index with applications to benzenoid graphs and phenylenes,\" arXiv preprint arXiv:1801.05963, 2018.' mla='Tratnik, N.. \"Formula for calculating the Wiener polarity index with applications to benzenoid graphs and phenylenes.\" arXiv, 1801.05963, 2018.'",
  "paper_id='arxiv_2007_12930' bibtex='@article{arxiv_2007_12930,\\n  title={Towards the Solution of an Extremal Problem Concerning the Wiener Polarity Index of Alkanes},\\n  author={Sadia Noureen and Akhlaq Ahmad Bhatti and Akbar Ali},\\n  journal={arXiv preprint arXiv:2007.12930},\\n  year={2020},\\n  url={http://arxiv.org/abs/2007.12930v1}\\n}' apa='Noureen, S., Bhatti, A. A., & Ali, A. (2020). Towards the Solution of an Extremal Problem Concerning the Wiener Polarity Index of Alkanes. arXiv preprint arXiv:2007.12930.' ieee='Sadia Noureen, Akhlaq Ahmad Bhatti, Akbar Ali, \"Towards the Solution of an Extremal Problem Concerning the Wiener Polarity Index of Alkanes,\" arXiv preprint arXiv:2007.12930, 2020.' mla='Noureen, S., et al.. \"Towards the Solution of an Extremal Problem Concerning the Wiener Polarity Index of Alkanes.\" arXiv, 2007.12930, 2020.'",
  "paper_id='10_1038_srep19066' bibtex='@article{10_1038_srep19066,\\n  title={On Wiener polarity index of bicyclic networks},\\n  author={Jing Ma and Yongtang Shi and Zhen Wang and Jun Yue},\\n  journal={Scientific Reports},\\n  year={2016},\\n  doi={10.1038/srep19066},\\n  url={https://doi.org/10.1038/srep19066}\\n}' apa='Ma, J., Shi, Y., Wang, Z., & Yue, J. (2016). On Wiener polarity index of bicyclic networks. Scientific Reports.' ieee='Jing Ma et al., \"On Wiener polarity index of bicyclic networks,\" Scientific Reports, 2016.' mla='Ma, J., et al.. \"On Wiener polarity index of bicyclic networks.\" Scientific Reports, 2016.'",
  "paper_id='10_1002_minf_201800076' bibtex='@article{10_1002_minf_201800076,\\n  title={The Alkanes with Maximum Wiener Polarity Index},\\n  author={Zhibin Du and Akbar Ali},\\n  journal={Molecular Informatics},\\n  year={2019},\\n  doi={10.1002/minf.201800076},\\n  url={https://doi.org/10.1002/minf.201800076}\\n}' apa='Du, Z. & Ali, A. (2019). The Alkanes with Maximum Wiener Polarity Index. Molecular Informatics.' ieee='Zhibin Du, Akbar Ali, \"The Alkanes with Maximum Wiener Polarity Index,\" Molecular Informatics, 2019.' mla='Du, Z., and Akbar Ali. \"The Alkanes with Maximum Wiener Polarity Index.\" Molecular Informatics, 2019.'",
  "paper_id='10_1002_qua_25973' bibtex='@article{10_1002_qua_25973,\\n  title={Ordering chemical unicyclic graphs by Wiener polarity index},\\n  author={Ali Ghalavand and Ali R. Ashrafi},\\n  journal={International Journal of Quantum Chemistry},\\n  year={2019},\\n  doi={10.1002/qua.25973},\\n  url={https://doi.org/10.1002/qua.25973}\\n}' apa='Ghalavand, A. & Ashrafi, A. R. (2019). Ordering chemical unicyclic graphs by Wiener polarity index. International Journal of Quantum Chemistry.' ieee='Ali Ghalavand, Ali R. Ashrafi, \"Ordering chemical unicyclic graphs by Wiener polarity index,\" International Journal of Quantum Chemistry, 2019.' mla='Ghalavand, A., and Ali R. Ashrafi. \"Ordering chemical unicyclic graphs by Wiener polarity index.\" International Journal of Quantum Chemistry, 2019.'",
  "paper_id='10_1155_2014_476705' bibtex='@article{10_1155_2014_476705,\\n  title={Wiener Polarity Index of Cycle-Block Graphs},\\n  author={Zhen Jia and Fuyi Wei and Yang Wu},\\n  journal={Chinese Journal of Mathematics},\\n  year={2014},\\n  doi={10.1155/2014/476705},\\n  url={https://doi.org/10.1155/2014/476705}\\n}' apa='Jia, Z., Wei, F., & Wu, Y. (2014). Wiener Polarity Index of Cycle-Block Graphs. Chinese Journal of Mathematics.' ieee='Zhen Jia, Fuyi Wei, Yang Wu, \"Wiener Polarity Index of Cycle-Block Graphs,\" Chinese Journal of Mathematics, 2014.' mla='Jia, Z., et al.. \"Wiener Polarity Index of Cycle-Block Graphs.\" Chinese Journal of Mathematics, 2014.'",
  "paper_id='10_2298_jsc100320114d' bibtex='@article{10_2298_jsc100320114d,\\n  title={The Wiener polarity index of molecular graphs of alkanes with a given number of methyl groups},\\n  author={Hanyuan Deng and Hui Xiao},\\n  journal={Journal of the Serbian Chemical Society},\\n  year={2010},\\n  doi={10.2298/jsc100320114d},\\n  url={https://doi.org/10.2298/jsc100320114d}\\n}' apa='Deng, H. & Xiao, H. (2010). The Wiener polarity index of molecular graphs of alkanes with a given number of methyl groups. Journal of the Serbian Chemical Society.' ieee='Hanyuan Deng, Hui Xiao, \"The Wiener polarity index of molecular graphs of alkanes with a given number of methyl groups,\" Journal of the Serbian Chemical Society, 2010.' mla='Deng, H., and Hui Xiao. \"The Wiener polarity index of molecular graphs of alkanes with a given number of methyl groups.\" Journal of the Serbian Chemical Society, 2010.'",
  "paper_id='10_1155_2016_3873597' bibtex='@article{10_1155_2016_3873597,\\n  title={On the Extremal Wiener Polarity Index of Hückel Graphs},\\n  author={Hongzhuan Wang},\\n  journal={Computational and Mathematical Methods in Medicine},\\n  year={2016},\\n  doi={10.1155/2016/3873597},\\n  url={https://doi.org/10.1155/2016/3873597}\\n}' apa='Wang, H. (2016). On the Extremal Wiener Polarity Index of Hückel Graphs. Computational and Mathematical Methods in Medicine.' ieee='Hongzhuan Wang, \"On the Extremal Wiener Polarity Index of Hückel Graphs,\" Computational and Mathematical Methods in Medicine, 2016.' mla='Wang, H.. \"On the Extremal Wiener Polarity Index of Hückel Graphs.\" Computational and Mathematical Methods in Medicine, 2016.'",
  "paper_id='10_1080_02522667_2021_1896652' bibtex='@article{10_1080_02522667_2021_1896652,\\n  title={On <i>k</i>-total distance degrees and <i>k</i>-total Wiener polarity index},\\n  author={Süleyman Ediz and İdris Çiftçi and Murat Cancan and Mohammad Reza Farahani},\\n  journal={Journal of Information and Optimization Sciences},\\n  year={2021},\\n  doi={10.1080/02522667.2021.1896652},\\n  url={https://doi.org/10.1080/02522667.2021.1896652}\\n}' apa='Ediz, S., Çiftçi, İ., Cancan, M., & Farahani, M. R. (2021). On <i>k</i>-total distance degrees and <i>k</i>-total Wiener polarity index. Journal of Information and Optimization Sciences.' ieee='Süleyman Ediz et al., \"On <i>k</i>-total distance degrees and <i>k</i>-total Wiener polarity index,\" Journal of Information and Optimization Sciences, 2021.' mla='Ediz, S., et al.. \"On <i>k</i>-total distance degrees and <i>k</i>-total Wiener polarity index.\" Journal of Information and Optimization Sciences, 2021.'",
  "paper_id='10_1080_09720529_2019_1688965' bibtex='@article{10_1080_09720529_2019_1688965,\\n  title={On Wiener index and Wiener polarity index of some polyomino chains},\\n  author={Sarfraz Ahmad and Hafiz Muhammad Afzal Siddiqui and Arfan Ali and Mohammad R. Farahani and Muhammad Imran and Ismail Naci Cangul},\\n  journal={Journal of Discrete Mathematical Sciences and Cryptography},\\n  year={2019},\\n  doi={10.1080/09720529.2019.1688965},\\n  url={https://doi.org/10.1080/09720529.2019.1688965}\\n}' apa='Ahmad, S., Siddiqui, H. M. A., Ali, A., Farahani, M. R., Imran, M., & Cangul, I. N. (2019). On Wiener index and Wiener polarity index of some polyomino chains. Journal of Discrete Mathematical Sciences and Cryptography.' ieee='Sarfraz Ahmad et al., \"On Wiener index and Wiener polarity index of some polyomino chains,\" Journal of Discrete Mathematical Sciences and Cryptography, 2019.' mla='Ahmad, S., et al.. \"On Wiener index and Wiener polarity index of some polyomino chains.\" Journal of Discrete Mathematical Sciences and Cryptography, 2019.'",
  "paper_id='10_15439_2015f340' bibtex='@article{10_15439_2015f340,\\n  title={On the generalized Wiener polarity index for some classes of graphs},\\n  author={Halina Bielak and Kinga Dąbrowska and Katarzyna Wolska},\\n  journal={Annals of Computer Science and Information Systems},\\n  year={2015},\\n  doi={10.15439/2015f340},\\n  url={https://doi.org/10.15439/2015f340}\\n}' apa='Bielak, H., Dąbrowska, K., & Wolska, K. (2015). On the generalized Wiener polarity index for some classes of graphs. Annals of Computer Science and Information Systems.' ieee='Halina Bielak, Kinga Dąbrowska, Katarzyna Wolska, \"On the generalized Wiener polarity index for some classes of graphs,\" Annals of Computer Science and Information Systems, 2015.' mla='Bielak, H., et al.. \"On the generalized Wiener polarity index for some classes of graphs.\" Annals of Computer Science and Information Systems, 2015.'",
  "paper_id='10_1080_02522667_2020_1748274' bibtex='@article{10_1080_02522667_2020_1748274,\\n  title={An exact formulas for the Wiener polarity index of nanostar dendrimers},\\n  author={Mehdi Alaeiyan and Farkhanda Afzal and Mohammad R. Farahani and Mohammad Ali Rostami},\\n  journal={Journal of Information and Optimization Sciences},\\n  year={2020},\\n  doi={10.1080/02522667.2020.1748274},\\n  url={https://doi.org/10.1080/02522667.2020.1748274}\\n}' apa='Alaeiyan, M., Afzal, F., Farahani, M. R., & Rostami, M. A. (2020). An exact formulas for the Wiener polarity index of nanostar dendrimers. Journal of Information and Optimization Sciences.' ieee='Mehdi Alaeiyan et al., \"An exact formulas for the Wiener polarity index of nanostar dendrimers,\" Journal of Information and Optimization Sciences, 2020.' mla='Alaeiyan, M., et al.. \"An exact formulas for the Wiener polarity index of nanostar dendrimers.\" Journal of Information and Optimization Sciences, 2020.'",
  "paper_id='10_11648_j_mcs_20251001_12' bibtex='@article{10_11648_j_mcs_20251001_12,\\n  title={Sufficient Conditions for Wiener Index, Hyper-Wiener Index and Harary Index of the Hamilton Graph},\\n  author={Jiangyi Liu},\\n  journal={Mathematics and Computer Science},\\n  year={2025},\\n  doi={10.11648/j.mcs.20251001.12},\\n  url={https://doi.org/10.11648/j.mcs.20251001.12}\\n}' apa='Liu, J. (2025). Sufficient Conditions for Wiener Index, Hyper-Wiener Index and Harary Index of the Hamilton Graph. Mathematics and Computer Science.' ieee='Jiangyi Liu, \"Sufficient Conditions for Wiener Index, Hyper-Wiener Index and Harary Index of the Hamilton Graph,\" Mathematics and Computer Science, 2025.' mla='Liu, J.. \"Sufficient Conditions for Wiener Index, Hyper-Wiener Index and Harary Index of the Hamilton Graph.\" Mathematics and Computer Science, 2025.'",
  "paper_id='10_1016_j_amc_2017_11_038' bibtex='@article{10_1016_j_amc_2017_11_038,\\n  title={Wiener polarity index of dendrimers},\\n  author={Guoliang Liu and Guodong Liu},\\n  journal={Applied Mathematics and Computation},\\n  year={2018},\\n  doi={10.1016/j.amc.2017.11.038},\\n  url={https://doi.org/10.1016/j.amc.2017.11.038}\\n}' apa='Liu, G. & Liu, G. (2018). Wiener polarity index of dendrimers. Applied Mathematics and Computation.' ieee='Guoliang Liu, Guodong Liu, \"Wiener polarity index of dendrimers,\" Applied Mathematics and Computation, 2018.' mla='Liu, G., and Guodong Liu. \"Wiener polarity index of dendrimers.\" Applied Mathematics and Computation, 2018.'",
  "paper_id='10_1016_j_amc_2015_10_045' bibtex='@article{10_1016_j_amc_2015_10_045,\\n  title={The Nordhaus–Gaddum-type inequality for the Wiener polarity index},\\n  author={Yanhong Zhang and Yumei Hu},\\n  journal={Applied Mathematics and Computation},\\n  year={2016},\\n  doi={10.1016/j.amc.2015.10.045},\\n  url={https://doi.org/10.1016/j.amc.2015.10.045}\\n}' apa='Zhang, Y. & Hu, Y. (2016). The Nordhaus–Gaddum-type inequality for the Wiener polarity index. Applied Mathematics and Computation.' ieee='Yanhong Zhang, Yumei Hu, \"The Nordhaus–Gaddum-type inequality for the Wiener polarity index,\" Applied Mathematics and Computation, 2016.' mla='Zhang, Y., and Yumei Hu. \"The Nordhaus–Gaddum-type inequality for the Wiener polarity index.\" Applied Mathematics and Computation, 2016.'",
  "paper_id='10_1016_j_aml_2012_01_006' bibtex='@article{10_1016_j_aml_2012_01_006,\\n  title={Wiener polarity index of fullerenes and hexagonal systems},\\n  author={A. Behmaram and H. Yousefi-Azari and A.R. Ashrafi},\\n  journal={Applied Mathematics Letters},\\n  year={2012},\\n  doi={10.1016/j.aml.2012.01.006},\\n  url={https://doi.org/10.1016/j.aml.2012.01.006}\\n}' apa='Behmaram, A., Yousefi-Azari, H., & Ashrafi, A. (2012). Wiener polarity index of fullerenes and hexagonal systems. Applied Mathematics Letters.' ieee='A. Behmaram, H. Yousefi-Azari, A.R. Ashrafi, \"Wiener polarity index of fullerenes and hexagonal systems,\" Applied Mathematics Letters, 2012.' mla='Behmaram, A., et al.. \"Wiener polarity index of fullerenes and hexagonal systems.\" Applied Mathematics Letters, 2012.'",
  "paper_id='10_1371_journal_pone_0197142' bibtex='@article{10_1371_journal_pone_0197142,\\n  title={The inverse Wiener polarity index problem for chemical trees},\\n  author={Zhibin Du and Akbar Ali},\\n  journal={PLOS ONE},\\n  year={2018},\\n  doi={10.1371/journal.pone.0197142},\\n  url={https://doi.org/10.1371/journal.pone.0197142}\\n}' apa='Du, Z. & Ali, A. (2018). The inverse Wiener polarity index problem for chemical trees. PLOS ONE.' ieee='Zhibin Du, Akbar Ali, \"The inverse Wiener polarity index problem for chemical trees,\" PLOS ONE, 2018.' mla='Du, Z., and Akbar Ali. \"The inverse Wiener polarity index problem for chemical trees.\" PLOS ONE, 2018.'",
  "paper_id='10_1016_j_amc_2017_06_005' bibtex='@article{10_1016_j_amc_2017_06_005,\\n  title={Ordering chemical trees by Wiener polarity index},\\n  author={Ali Reza Ashrafi and Ali Ghalavand},\\n  journal={Applied Mathematics and Computation},\\n  year={2017},\\n  doi={10.1016/j.amc.2017.06.005},\\n  url={https://doi.org/10.1016/j.amc.2017.06.005}\\n}' apa='Ashrafi, A. R. & Ghalavand, A. (2017). Ordering chemical trees by Wiener polarity index. Applied Mathematics and Computation.' ieee='Ali Reza Ashrafi, Ali Ghalavand, \"Ordering chemical trees by Wiener polarity index,\" Applied Mathematics and Computation, 2017.' mla='Ashrafi, A. R., and Ali Ghalavand. \"Ordering chemical trees by Wiener polarity index.\" Applied Mathematics and Computation, 2017.'",
  "paper_id='10_1016_j_amc_2012_03_090' bibtex='@article{10_1016_j_amc_2012_03_090,\\n  title={The maximum Wiener polarity index of unicyclic graphs},\\n  author={Huoquan Hou and Bolian Liu and Yufei Huang},\\n  journal={Applied Mathematics and Computation},\\n  year={2012},\\n  doi={10.1016/j.amc.2012.03.090},\\n  url={https://doi.org/10.1016/j.amc.2012.03.090}\\n}' apa='Hou, H., Liu, B., & Huang, Y. (2012). The maximum Wiener polarity index of unicyclic graphs. Applied Mathematics and Computation.' ieee='Huoquan Hou, Bolian Liu, Yufei Huang, \"The maximum Wiener polarity index of unicyclic graphs,\" Applied Mathematics and Computation, 2012.' mla='Hou, H., et al.. \"The maximum Wiener polarity index of unicyclic graphs.\" Applied Mathematics and Computation, 2012.'",
  "paper_id='10_1016_j_amc_2018_04_051' bibtex='@article{10_1016_j_amc_2018_04_051,\\n  title={A note on chemical trees with minimum Wiener polarity index},\\n  author={Akbar Ali and Zhibin Du and Muhammad Ali},\\n  journal={Applied Mathematics and Computation},\\n  year={2018},\\n  doi={10.1016/j.amc.2018.04.051},\\n  url={https://doi.org/10.1016/j.amc.2018.04.051}\\n}' apa='Ali, A., Du, Z., & Ali, M. (2018). A note on chemical trees with minimum Wiener polarity index. Applied Mathematics and Computation.' ieee='Akbar Ali, Zhibin Du, Muhammad Ali, \"A note on chemical trees with minimum Wiener polarity index,\" Applied Mathematics and Computation, 2018.' mla='Ali, A., et al.. \"A note on chemical trees with minimum Wiener polarity index.\" Applied Mathematics and Computation, 2018.'",
  "paper_id='10_1016_j_camwa_2010_07_045' bibtex='@article{10_1016_j_camwa_2010_07_045,\\n  title={On the Wiener polarity index of trees with maximum degree or given number of leaves},\\n  author={Bolian Liu and Huoquan Hou and Yufei Huang},\\n  journal={Computers &amp; Mathematics with Applications},\\n  year={2010},\\n  doi={10.1016/j.camwa.2010.07.045},\\n  url={https://doi.org/10.1016/j.camwa.2010.07.045}\\n}' apa='Liu, B., Hou, H., & Huang, Y. (2010). On the Wiener polarity index of trees with maximum degree or given number of leaves. Computers &amp; Mathematics with Applications.' ieee='Bolian Liu, Huoquan Hou, Yufei Huang, \"On the Wiener polarity index of trees with maximum degree or given number of leaves,\" Computers &amp; Mathematics with Applications, 2010.' mla='Liu, B., et al.. \"On the Wiener polarity index of trees with maximum degree or given number of leaves.\" Computers &amp; Mathematics with Applications, 2010.'",
  "paper_id='10_5958_0974_360x_2018_00392_x' bibtex='@article{10_5958_0974_360x_2018_00392_x,\\n  title={Determination of wiener polarity index from reduced distance matrix and molecular structure of drugs-A theoretical approach},\\n  author={M. Yamuna and T. Divya},\\n  journal={Research Journal of Pharmacy and Technology},\\n  year={2018},\\n  doi={10.5958/0974-360x.2018.00392.x},\\n  url={https://doi.org/10.5958/0974-360x.2018.00392.x}\\n}' apa='Yamuna, M. & Divya, T. (2018). Determination of wiener polarity index from reduced distance matrix and molecular structure of drugs-A theoretical approach. Research Journal of Pharmacy and Technology.' ieee='M. Yamuna, T. Divya, \"Determination of wiener polarity index from reduced distance matrix and molecular structure of drugs-A theoretical approach,\" Research Journal of Pharmacy and Technology, 2018.' mla='Yamuna, M., and T. Divya. \"Determination of wiener polarity index from reduced distance matrix and molecular structure of drugs-A theoretical approach.\" Research Journal of Pharmacy and Technology, 2018.'",
  "paper_id='10_1016_j_aml_2010_02_013' bibtex='@article{10_1016_j_aml_2010_02_013,\\n  title={The maximum Wiener polarity index of trees with <mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" altimg=\"si2.gif\" display=\"inline\" overflow=\"scroll\"><mml:mi>k</mml:mi></mml:math> pendants},\\n  author={Hanyuan Deng and Hui Xiao},\\n  journal={Applied Mathematics Letters},\\n  year={2010},\\n  doi={10.1016/j.aml.2010.02.013},\\n  url={https://doi.org/10.1016/j.aml.2010.02.013}\\n}' apa='Deng, H. & Xiao, H. (2010). The maximum Wiener polarity index of trees with <mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" altimg=\"si2.gif\" display=\"inline\" overflow=\"scroll\"><mml:mi>k</mml:mi></mml:math> pendants. Applied Mathematics Letters.' ieee='Hanyuan Deng, Hui Xiao, \"The maximum Wiener polarity index of trees with <mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" altimg=\"si2.gif\" display=\"inline\" overflow=\"scroll\"><mml:mi>k</mml:mi></mml:math> pendants,\" Applied Mathematics Letters, 2010.' mla='Deng, H., and Hui Xiao. \"The maximum Wiener polarity index of trees with <mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" altimg=\"si2.gif\" display=\"inline\" overflow=\"scroll\"><mml:mi>k</mml:mi></mml:math> pendants.\" Applied Mathematics Letters, 2010.'",
  "paper_id='10_1016_j_amc_2016_01_043' bibtex='@article{10_1016_j_amc_2016_01_043,\\n  title={On the Wiener polarity index of graphs},\\n  author={Hongbo Hua and Kinkar Ch. Das},\\n  journal={Applied Mathematics and Computation},\\n  year={2016},\\n  doi={10.1016/j.amc.2016.01.043},\\n  url={https://doi.org/10.1016/j.amc.2016.01.043}\\n}' apa='Hua, H. & Das, K. C. (2016). On the Wiener polarity index of graphs. Applied Mathematics and Computation.' ieee='Hongbo Hua, Kinkar Ch. Das, \"On the Wiener polarity index of graphs,\" Applied Mathematics and Computation, 2016.' mla='Hua, H., and Kinkar Ch. Das. \"On the Wiener polarity index of graphs.\" Applied Mathematics and Computation, 2016.'",
  "paper_id='10_3389_fphy_2020_553261' bibtex='@article{10_3389_fphy_2020_553261,\\n  title={Third Smallest Wiener Polarity Index of Unicyclic Graphs},\\n  author={Wei Fang and Muhan Ma and FuYuan Chen and Hufeng Dong},\\n  journal={Frontiers in Physics},\\n  year={2020},\\n  doi={10.3389/fphy.2020.553261},\\n  url={https://doi.org/10.3389/fphy.2020.553261}\\n}' apa='Fang, W., Ma, M., Chen, F., & Dong, H. (2020). Third Smallest Wiener Polarity Index of Unicyclic Graphs. Frontiers in Physics.' ieee='Wei Fang et al., \"Third Smallest Wiener Polarity Index of Unicyclic Graphs,\" Frontiers in Physics, 2020.' mla='Fang, W., et al.. \"Third Smallest Wiener Polarity Index of Unicyclic Graphs.\" Frontiers in Physics, 2020.'",
  "paper_id='10_1371_journal_pone_0167075' bibtex='@article{10_1371_journal_pone_0167075,\\n  title={On the Wiener Polarity Index of Lattice Networks},\\n  author={Lin Chen and Tao Li and Jinfeng Liu and Yongtang Shi and Hua Wang},\\n  journal={PLOS ONE},\\n  year={2016},\\n  doi={10.1371/journal.pone.0167075},\\n  url={https://doi.org/10.1371/journal.pone.0167075}\\n}' apa='Chen, L., Li, T., Liu, J., Shi, Y., & Wang, H. (2016). On the Wiener Polarity Index of Lattice Networks. PLOS ONE.' ieee='Lin Chen et al., \"On the Wiener Polarity Index of Lattice Networks,\" PLOS ONE, 2016.' mla='Chen, L., et al.. \"On the Wiener Polarity Index of Lattice Networks.\" PLOS ONE, 2016.'",
  "paper_id='10_1016_j_jksus_2023_102680' bibtex='@article{10_1016_j_jksus_2023_102680,\\n  title={Wiener polarity and Wiener index of double generalized Petersen graph},\\n  author={Tanveer Iqbal and Syed Ahtsham Ul Haq Bokhary and Ghulam Abbas and Jamel Baili and Hijaz Ahmad and Hafsah Tabassum and Saqib Murtaza and Zubair Ahmad and Xiao-Zhong Zhang},\\n  journal={Journal of King Saud University - Science},\\n  year={2023},\\n  doi={10.1016/j.jksus.2023.102680},\\n  url={https://doi.org/10.1016/j.jksus.2023.102680}\\n}' apa='Iqbal, T., Bokhary, S. A. U. H., Abbas, G., Baili, J., Ahmad, H., Tabassum, H., Murtaza, S., Ahmad, Z., & Zhang, X. (2023). Wiener polarity and Wiener index of double generalized Petersen graph. Journal of King Saud University - Science.' ieee='Tanveer Iqbal et al., \"Wiener polarity and Wiener index of double generalized Petersen graph,\" Journal of King Saud University - Science, 2023.' mla='Iqbal, T., et al.. \"Wiener polarity and Wiener index of double generalized Petersen graph.\" Journal of King Saud University - Science, 2023.'",
  "paper_id='arxiv_1603_06099' bibtex='@article{arxiv_1603_06099,\\n  title={Some Aspects of the Wiener Index for Sun Graphs},\\n  author={Mohamed Amine Boutiche},\\n  journal={arXiv preprint arXiv:1603.06099},\\n  year={2016},\\n  url={http://arxiv.org/abs/1603.06099v1}\\n}' apa='Boutiche, M. A. (2016). Some Aspects of the Wiener Index for Sun Graphs. arXiv preprint arXiv:1603.06099.' ieee='Mohamed Amine Boutiche, \"Some Aspects of the Wiener Index for Sun Graphs,\" arXiv preprint arXiv:1603.06099, 2016.' mla='Boutiche, M. A.. \"Some Aspects of the Wiener Index for Sun Graphs.\" arXiv, 1603.06099, 2016.'",
  "paper_id='10_56827_seajmms_2022_1803_23' bibtex='@article{10_56827_seajmms_2022_1803_23,\\n  title={COMPUTATION OF WIENER INDEX, RECIPROCAL WIENER INDEX AND PERIPHERAL WIENER INDEX USING ADJACENCY MATRIX},\\n  author={R. Rajendra and P. Siva Kota Reddy and M. Prabhavathi},\\n  journal={South East Asian J. of Mathematics and Mathematical Sciences},\\n  year={2022},\\n  doi={10.56827/seajmms.2022.1803.23},\\n  url={https://doi.org/10.56827/seajmms.2022.1803.23}\\n}' apa='Rajendra, R., Reddy, P. S. K., & Prabhavathi, M. (2022). COMPUTATION OF WIENER INDEX, RECIPROCAL WIENER INDEX AND PERIPHERAL WIENER INDEX USING ADJACENCY MATRIX. South East Asian J. of Mathematics and Mathematical Sciences.' ieee='R. Rajendra, P. Siva Kota Reddy, M. Prabhavathi, \"COMPUTATION OF WIENER INDEX, RECIPROCAL WIENER INDEX AND PERIPHERAL WIENER INDEX USING ADJACENCY MATRIX,\" South East Asian J. of Mathematics and Mathematical Sciences, 2022.' mla='Rajendra, R., et al.. \"COMPUTATION OF WIENER INDEX, RECIPROCAL WIENER INDEX AND PERIPHERAL WIENER INDEX USING ADJACENCY MATRIX.\" South East Asian J. of Mathematics and Mathematical Sciences, 2022.'",
  "paper_id='arxiv_1801_05146' bibtex='@article{arxiv_1801_05146,\\n  title={Algorithms for Computing Wiener Indices of Acyclic and Unicyclic Graphs},\\n  author={Bo Bi and Muhammad Kamran Jamil and Khawaja Muhammad Fahd and Tian-Le Sun and Imran Ahmad and Lei Ding},\\n  journal={arXiv preprint arXiv:1801.05146},\\n  year={2018},\\n  url={http://arxiv.org/abs/1801.05146v2}\\n}' apa='Bi, B., Jamil, M. K., Fahd, K. M., Sun, T., Ahmad, I., & Ding, L. (2018). Algorithms for Computing Wiener Indices of Acyclic and Unicyclic Graphs. arXiv preprint arXiv:1801.05146.' ieee='Bo Bi et al., \"Algorithms for Computing Wiener Indices of Acyclic and Unicyclic Graphs,\" arXiv preprint arXiv:1801.05146, 2018.' mla='Bi, B., et al.. \"Algorithms for Computing Wiener Indices of Acyclic and Unicyclic Graphs.\" arXiv, 1801.05146, 2018.'",
  "paper_id='10_21275_v4i11_nov151680' bibtex='@article{10_21275_v4i11_nov151680,\\n  title={Wiener Index of Some Thorn Graphs},\\n  author={},\\n  journal={International Journal of Science and Research (IJSR)},\\n  year={2015},\\n  doi={10.21275/v4i11.nov151680},\\n  url={https://doi.org/10.21275/v4i11.nov151680}\\n}' apa='Unknown Author (2015). Wiener Index of Some Thorn Graphs. International Journal of Science and Research (IJSR).' ieee='Unknown Author, \"Wiener Index of Some Thorn Graphs,\" International Journal of Science and Research (IJSR), 2015.' mla='Unknown Author. \"Wiener Index of Some Thorn Graphs.\" International Journal of Science and Research (IJSR), 2015.'",
  "paper_id='10_12988_ams_2014_43202' bibtex='@article{10_12988_ams_2014_43202,\\n  title={The Wiener index, the hyper-Wiener index and the degree distance index of the corona Cm.Cn},\\n  author={Mohamed Essalih and Mohamed El Marraki and Abd Errahmane Atmani},\\n  journal={Applied Mathematical Sciences},\\n  year={2014},\\n  doi={10.12988/ams.2014.43202},\\n  url={https://doi.org/10.12988/ams.2014.43202}\\n}' apa='Essalih, M., Marraki, M. E., & Atmani, A. E. (2014). The Wiener index, the hyper-Wiener index and the degree distance index of the corona Cm.Cn. Applied Mathematical Sciences.' ieee='Mohamed Essalih, Mohamed El Marraki, Abd Errahmane Atmani, \"The Wiener index, the hyper-Wiener index and the degree distance index of the corona Cm.Cn,\" Applied Mathematical Sciences, 2014.' mla='Essalih, M., et al.. \"The Wiener index, the hyper-Wiener index and the degree distance index of the corona Cm.Cn.\" Applied Mathematical Sciences, 2014.'",
  "paper_id='10_22199_issn_0717_6279_4804' bibtex='@article{10_22199_issn_0717_6279_4804,\\n  title={On the Wiener index and the hyper-Wiener index of the Kragujevac trees},\\n  author={Abbas Heydari},\\n  journal={Proyecciones (Antofagasta)},\\n  year={2023},\\n  doi={10.22199/issn.0717-6279-4804},\\n  url={https://doi.org/10.22199/issn.0717-6279-4804}\\n}' apa='Heydari, A. (2023). On the Wiener index and the hyper-Wiener index of the Kragujevac trees. Proyecciones (Antofagasta).' ieee='Abbas Heydari, \"On the Wiener index and the hyper-Wiener index of the Kragujevac trees,\" Proyecciones (Antofagasta), 2023.' mla='Heydari, A.. \"On the Wiener index and the hyper-Wiener index of the Kragujevac trees.\" Proyecciones (Antofagasta), 2023.'",
  "paper_id='10_1093_med_9780198748625_003_0015' bibtex='@article{10_1093_med_9780198748625_003_0015,\\n  title={Predominant polarity, polarity index, and treatment selection in bipolar disorder},\\n  author={Sabrina C. da Costa and Joao L. de Quevedo and André F. Carvalho},\\n  journal={Oxford Medicine Online},\\n  year={2017},\\n  doi={10.1093/med/9780198748625.003.0015},\\n  url={https://doi.org/10.1093/med/9780198748625.003.0015}\\n}' apa='Costa, S. C. D., Quevedo, J. L. D., & Carvalho, A. F. (2017). Predominant polarity, polarity index, and treatment selection in bipolar disorder. Oxford Medicine Online.' ieee='Sabrina C. da Costa, Joao L. de Quevedo, André F. Carvalho, \"Predominant polarity, polarity index, and treatment selection in bipolar disorder,\" Oxford Medicine Online, 2017.' mla='Costa, S. C. D., et al.. \"Predominant polarity, polarity index, and treatment selection in bipolar disorder.\" Oxford Medicine Online, 2017.'",
  "paper_id='10_7717_peerj_12224_fig_6' bibtex='@article{10_7717_peerj_12224_fig_6,\\n  title={Figure 6: Shannon–Wiener index of river fauna diversity.},\\n  author={},\\n  journal={},\\n  year={2023},\\n  doi={10.7717/peerj.12224/fig-6},\\n  url={https://doi.org/10.7717/peerj.12224/fig-6}\\n}' apa='Unknown Author (2023). Figure 6: Shannon–Wiener index of river fauna diversity.. .' ieee='Unknown Author, \"Figure 6: Shannon–Wiener index of river fauna diversity.,\" , 2023.' mla='Unknown Author. \"Figure 6: Shannon–Wiener index of river fauna diversity..\" , 2023.'",
  "paper_id='10_7717_peerj_19854_fig_4' bibtex='@article{10_7717_peerj_19854_fig_4,\\n  title={Figure 4: The Shannon-Wiener index (A) and the Simpson index of different repair types (B).},\\n  author={},\\n  journal={},\\n  year={2023},\\n  doi={10.7717/peerj.19854/fig-4},\\n  url={https://doi.org/10.7717/peerj.19854/fig-4}\\n}' apa='Unknown Author (2023). Figure 4: The Shannon-Wiener index (A) and the Simpson index of different repair types (B).. .' ieee='Unknown Author, \"Figure 4: The Shannon-Wiener index (A) and the Simpson index of different repair types (B).,\" , 2023.' mla='Unknown Author. \"Figure 4: The Shannon-Wiener index (A) and the Simpson index of different repair types (B)..\" , 2023.'",
  "paper_id='10_2139_ssrn_4578445' bibtex='@article{10_2139_ssrn_4578445,\\n  title={Corrigendum on Wiener Index, Zagreb Indices and Harary Index of Eulerian Graphs},\\n  author={Stijn Cambie},\\n  journal={},\\n  year={2023},\\n  doi={10.2139/ssrn.4578445},\\n  url={https://doi.org/10.2139/ssrn.4578445}\\n}' apa='Cambie, S. (2023). Corrigendum on Wiener Index, Zagreb Indices and Harary Index of Eulerian Graphs. .' ieee='Stijn Cambie, \"Corrigendum on Wiener Index, Zagreb Indices and Harary Index of Eulerian Graphs,\" , 2023.' mla='Cambie, S.. \"Corrigendum on Wiener Index, Zagreb Indices and Harary Index of Eulerian Graphs.\" , 2023.'",
  "paper_id='10_2139_ssrn_4346337' bibtex='@article{10_2139_ssrn_4346337,\\n  title={The Wiener Index and the Wiener Complexity of the Zero-Divisor Graph of a Finite Semisimple Ring},\\n  author={David Dolzan},\\n  journal={},\\n  year={2023},\\n  doi={10.2139/ssrn.4346337},\\n  url={https://doi.org/10.2139/ssrn.4346337}\\n}' apa='Dolzan, D. (2023). The Wiener Index and the Wiener Complexity of the Zero-Divisor Graph of a Finite Semisimple Ring. .' ieee='David Dolzan, \"The Wiener Index and the Wiener Complexity of the Zero-Divisor Graph of a Finite Semisimple Ring,\" , 2023.' mla='Dolzan, D.. \"The Wiener Index and the Wiener Complexity of the Zero-Divisor Graph of a Finite Semisimple Ring.\" , 2023.'",
  "paper_id='10_2174_9781681082691116010007' bibtex='@article{10_2174_9781681082691116010007,\\n  title={Polarity Index Method},\\n  author={},\\n  journal={Polarity Index in Proteins - A Bioinformatics Tool},\\n  year={2016},\\n  doi={10.2174/9781681082691116010007},\\n  url={https://doi.org/10.2174/9781681082691116010007}\\n}' apa='Unknown Author (2016). Polarity Index Method. Polarity Index in Proteins - A Bioinformatics Tool.' ieee='Unknown Author, \"Polarity Index Method,\" Polarity Index in Proteins - A Bioinformatics Tool, 2016.' mla='Unknown Author. \"Polarity Index Method.\" Polarity Index in Proteins - A Bioinformatics Tool, 2016.'",
  "paper_id='10_1007_s00706_003_0003_7' bibtex='@article{10_1007_s00706_003_0003_7,\\n  title={Hyper-Wiener Index vs. Wiener Index. Two Highly Correlated Structure-Descriptors},\\n  author={Ivan Gutman and Boris Furtula},\\n  journal={Monatshefte für Chemie - Chemical Monthly},\\n  year={2003},\\n  doi={10.1007/s00706-003-0003-7},\\n  url={https://doi.org/10.1007/s00706-003-0003-7}\\n}' apa='Gutman, I. & Furtula, B. (2003). Hyper-Wiener Index vs. Wiener Index. Two Highly Correlated Structure-Descriptors. Monatshefte für Chemie - Chemical Monthly.' ieee='Ivan Gutman, Boris Furtula, \"Hyper-Wiener Index vs. Wiener Index. Two Highly Correlated Structure-Descriptors,\" Monatshefte für Chemie - Chemical Monthly, 2003.' mla='Gutman, I., and Boris Furtula. \"Hyper-Wiener Index vs. Wiener Index. Two Highly Correlated Structure-Descriptors.\" Monatshefte für Chemie - Chemical Monthly, 2003.'",
  "paper_id='10_2174_97816810826911160101' bibtex='@article{10_2174_97816810826911160101,\\n  title={Polarity Index in Proteins - A Bioinformatics Tool},\\n  author={},\\n  journal={},\\n  year={2016},\\n  doi={10.2174/97816810826911160101},\\n  url={https://doi.org/10.2174/97816810826911160101}\\n}' apa='Unknown Author (2016). Polarity Index in Proteins - A Bioinformatics Tool. .' ieee='Unknown Author, \"Polarity Index in Proteins - A Bioinformatics Tool,\" , 2016.' mla='Unknown Author. \"Polarity Index in Proteins - A Bioinformatics Tool.\" , 2016.'",
  "paper_id='10_1080_15363830903133204' bibtex='@article{10_1080_15363830903133204,\\n  title={Computing Wiener Polynomial, Wiener Index and Hyper Wiener Index of C<sub>80</sub>Fullerene by GAP Program},\\n  author={Ali Iranmanesh and Y. Alizadeh and S. Mirzaie},\\n  journal={Fullerenes, Nanotubes and Carbon Nanostructures},\\n  year={2009},\\n  doi={10.1080/15363830903133204},\\n  url={https://doi.org/10.1080/15363830903133204}\\n}' apa='Iranmanesh, A., Alizadeh, Y., & Mirzaie, S. (2009). Computing Wiener Polynomial, Wiener Index and Hyper Wiener Index of C<sub>80</sub>Fullerene by GAP Program. Fullerenes, Nanotubes and Carbon Nanostructures.' ieee='Ali Iranmanesh, Y. Alizadeh, S. Mirzaie, \"Computing Wiener Polynomial, Wiener Index and Hyper Wiener Index of C<sub>80</sub>Fullerene by GAP Program,\" Fullerenes, Nanotubes and Carbon Nanostructures, 2009.' mla='Iranmanesh, A., et al.. \"Computing Wiener Polynomial, Wiener Index and Hyper Wiener Index of C<sub>80</sub>Fullerene by GAP Program.\" Fullerenes, Nanotubes and Carbon Nanostructures, 2009.'",
  "paper_id='10_2174_9781681082691116010019' bibtex='@article{10_2174_9781681082691116010019,\\n  title={Subject Index},\\n  author={},\\n  journal={Polarity Index in Proteins - A Bioinformatics Tool},\\n  year={2016},\\n  doi={10.2174/9781681082691116010019},\\n  url={https://doi.org/10.2174/9781681082691116010019}\\n}' apa='Unknown Author (2016). Subject Index. Polarity Index in Proteins - A Bioinformatics Tool.' ieee='Unknown Author, \"Subject Index,\" Polarity Index in Proteins - A Bioinformatics Tool, 2016.' mla='Unknown Author. \"Subject Index.\" Polarity Index in Proteins - A Bioinformatics Tool, 2016.'",
  "paper_id='10_7312_shel92432_007' bibtex='@article{10_7312_shel92432_007,\\n  title={Index},\\n  author={},\\n  journal={Process and Polarity},\\n  year={1944},\\n  doi={10.7312/shel92432-007},\\n  url={https://doi.org/10.7312/shel92432-007}\\n}' apa='Unknown Author (1944). Index. Process and Polarity.' ieee='Unknown Author, \"Index,\" Process and Polarity, 1944.' mla='Unknown Author. \"Index.\" Process and Polarity, 1944.'",
  "paper_id='unknown_pubmed_paper_30091531_2023' bibtex='@article{unknown_pubmed_paper_30091531_2023,\\n  title={PubMed Paper 30091531},\\n  author={Unknown},\\n  journal={PubMed},\\n  year={2023},\\n  url={https://pubmed.ncbi.nlm.nih.gov/30091531/}\\n}' apa='Unknown (2023). PubMed Paper 30091531. PubMed.' ieee='Unknown, \"PubMed Paper 30091531,\" PubMed, 2023.' mla='Unknown. \"PubMed Paper 30091531.\" PubMed, 2023.'",
  "paper_id='unknown_pubmed_paper_29750800_2023' bibtex='@article{unknown_pubmed_paper_29750800_2023,\\n  title={PubMed Paper 29750800},\\n  author={Unknown},\\n  journal={PubMed},\\n  year={2023},\\n  url={https://pubmed.ncbi.nlm.nih.gov/29750800/}\\n}' apa='Unknown (2023). PubMed Paper 29750800. PubMed.' ieee='Unknown, \"PubMed Paper 29750800,\" PubMed, 2023.' mla='Unknown. \"PubMed Paper 29750800.\" PubMed, 2023.'",
  "paper_id='unknown_pubmed_paper_27930705_2023' bibtex='@article{unknown_pubmed_paper_27930705_2023,\\n  title={PubMed Paper 27930705},\\n  author={Unknown},\\n  journal={PubMed},\\n  year={2023},\\n  url={https://pubmed.ncbi.nlm.nih.gov/27930705/}\\n}' apa='Unknown (2023). PubMed Paper 27930705. PubMed.' ieee='Unknown, \"PubMed Paper 27930705,\" PubMed, 2023.' mla='Unknown. \"PubMed Paper 27930705.\" PubMed, 2023.'",
  "paper_id='unknown_pubmed_paper_27247613_2023' bibtex='@article{unknown_pubmed_paper_27247613_2023,\\n  title={PubMed Paper 27247613},\\n  author={Unknown},\\n  journal={PubMed},\\n  year={2023},\\n  url={https://pubmed.ncbi.nlm.nih.gov/27247613/}\\n}' apa='Unknown (2023). PubMed Paper 27247613. PubMed.' ieee='Unknown, \"PubMed Paper 27247613,\" PubMed, 2023.' mla='Unknown. \"PubMed Paper 27247613.\" PubMed, 2023.'",
  "paper_id='unknown_pubmed_paper_26750820_2023' bibtex='@article{unknown_pubmed_paper_26750820_2023,\\n  title={PubMed Paper 26750820},\\n  author={Unknown},\\n  journal={PubMed},\\n  year={2023},\\n  url={https://pubmed.ncbi.nlm.nih.gov/26750820/}\\n}' apa='Unknown (2023). PubMed Paper 26750820. PubMed.' ieee='Unknown, \"PubMed Paper 26750820,\" PubMed, 2023.' mla='Unknown. \"PubMed Paper 26750820.\" PubMed, 2023.'"
]