[
  "paper_id='10_22436_jmcs_022_02_08' bibtex='@article{10_22436_jmcs_022_02_08,\\n  title={Computing the edge metric dimension of convex polytopes related graphs},\\n  author={M. Ahsan and Zohaib Zahid and Sohail Zafar and A. Rafiq and M. Sindhu and M. Umar},\\n  journal={Journal of Mathematics and Computer Science},\\n  year={2020},\\n  doi={10.22436/jmcs.022.02.08},\\n  url={https://www.semanticscholar.org/paper/4c96a6ca83f5a2ec2f078090051efa1c027d24b2}\\n}' apa='Ahsan, M., Zahid, Z., Zafar, S., Rafiq, A., Sindhu, M., & Umar, M. (2020). Computing the edge metric dimension of convex polytopes related graphs. Journal of Mathematics and Computer Science.' ieee='M. Ahsan et al., \"Computing the edge metric dimension of convex polytopes related graphs,\" Journal of Mathematics and Computer Science, 2020.' mla='Ahsan, M., et al.. \"Computing the edge metric dimension of convex polytopes related graphs.\" Journal of Mathematics and Computer Science, 2020.'",
  "paper_id='10_3934_math_2021069' bibtex='@article{10_3934_math_2021069,\\n  title={Fault-tolerant edge metric dimension of certain families of graphs},\\n  author={Xiaogang Liu and M. Ahsan and Zohaib Zahid and Shuili Ren},\\n  journal={AIMS Mathematics},\\n  year={2021},\\n  doi={10.3934/math.2021069},\\n  url={https://www.semanticscholar.org/paper/86c2bdab5729d698c60db8e6a1a0f1202406179f}\\n}' apa='Liu, X., Ahsan, M., Zahid, Z., & Ren, S. (2021). Fault-tolerant edge metric dimension of certain families of graphs. AIMS Mathematics.' ieee='Xiaogang Liu et al., \"Fault-tolerant edge metric dimension of certain families of graphs,\" AIMS Mathematics, 2021.' mla='Liu, X., et al.. \"Fault-tolerant edge metric dimension of certain families of graphs.\" AIMS Mathematics, 2021.'",
  "paper_id='10_1109_ACCESS_2022_3158982' bibtex='@article{10_1109_ACCESS_2022_3158982,\\n  title={Edge Metric Dimension and Edge Basis of One-Heptagonal Carbon Nanocone Networks},\\n  author={Karnika Sharma and V. K. Bhat and S. Sharma},\\n  journal={IEEE Access},\\n  year={2022},\\n  doi={10.1109/ACCESS.2022.3158982},\\n  url={https://www.semanticscholar.org/paper/a2c8c9f3a5e8d036afcf0e5d93b17db83813d23b}\\n}' apa='Sharma, K., Bhat, V. K., & Sharma, S. (2022). Edge Metric Dimension and Edge Basis of One-Heptagonal Carbon Nanocone Networks. IEEE Access.' ieee='Karnika Sharma, V. K. Bhat, S. Sharma, \"Edge Metric Dimension and Edge Basis of One-Heptagonal Carbon Nanocone Networks,\" IEEE Access, 2022.' mla='Sharma, K., et al.. \"Edge Metric Dimension and Edge Basis of One-Heptagonal Carbon Nanocone Networks.\" IEEE Access, 2022.'",
  "paper_id='10_1016_j_jpdc_2025_105141' bibtex='@article{10_1016_j_jpdc_2025_105141,\\n  title={Edge metric basis and its fault tolerance over certain interconnection networks},\\n  author={S. Prabhu and T. J. Janany and M. Arulperumjothi and I.G. Yero},\\n  journal={J. Parallel Distributed Comput.},\\n  year={2025},\\n  doi={10.1016/j.jpdc.2025.105141},\\n  url={https://www.semanticscholar.org/paper/09ae949612b61e8d0b0880faeb3ce87278bf3da9}\\n}' apa='Prabhu, S., Janany, T. J., Arulperumjothi, M., & Yero, I. (2025). Edge metric basis and its fault tolerance over certain interconnection networks. J. Parallel Distributed Comput..' ieee='S. Prabhu et al., \"Edge metric basis and its fault tolerance over certain interconnection networks,\" J. Parallel Distributed Comput., 2025.' mla='Prabhu, S., et al.. \"Edge metric basis and its fault tolerance over certain interconnection networks.\" J. Parallel Distributed Comput., 2025.'",
  "paper_id='10_3389_fphy_2021_749166' bibtex='@article{10_3389_fphy_2021_749166,\\n  title={Computing Edge Metric Dimension of One-Pentagonal Carbon Nanocone},\\n  author={S. Sharma and H. Raza and V. K. Bhat},\\n  journal={Frontiers of Physics},\\n  year={2021},\\n  doi={10.3389/fphy.2021.749166},\\n  url={https://www.semanticscholar.org/paper/25d60388ef4bccaea373ab6885eac941a5670fb2}\\n}' apa='Sharma, S., Raza, H., & Bhat, V. K. (2021). Computing Edge Metric Dimension of One-Pentagonal Carbon Nanocone. Frontiers of Physics.' ieee='S. Sharma, H. Raza, V. K. Bhat, \"Computing Edge Metric Dimension of One-Pentagonal Carbon Nanocone,\" Frontiers of Physics, 2021.' mla='Sharma, S., et al.. \"Computing Edge Metric Dimension of One-Pentagonal Carbon Nanocone.\" Frontiers of Physics, 2021.'",
  "paper_id='10_1080_00268976_2023_2259508' bibtex='@article{10_1080_00268976_2023_2259508,\\n  title={COVID antiviral drug structures and their edge metric dimension},\\n  author={Ibtisam Masmali and Muhammad Tanzeel Ali Kanwal and Muhammad Kamran Jamil and Ali Ahmad and M. Azeem and Ali N. A. Koam},\\n  journal={Molecular Physics},\\n  year={2023},\\n  doi={10.1080/00268976.2023.2259508},\\n  url={https://www.semanticscholar.org/paper/a8193db0c9b7c3076d717f9ab044e98854bd3b44}\\n}' apa='Masmali, I., Kanwal, M. T. A., Jamil, M. K., Ahmad, A., Azeem, M., & Koam, A. N. A. (2023). COVID antiviral drug structures and their edge metric dimension. Molecular Physics.' ieee='Ibtisam Masmali et al., \"COVID antiviral drug structures and their edge metric dimension,\" Molecular Physics, 2023.' mla='Masmali, I., et al.. \"COVID antiviral drug structures and their edge metric dimension.\" Molecular Physics, 2023.'",
  "paper_id='10_1142_S1793830921501329' bibtex='@article{10_1142_S1793830921501329,\\n  title={Fault-tolerant metric dimension of two-fold heptagonal-nonagonal circular ladder},\\n  author={S. Sharma and V. K. Bhat},\\n  journal={Discret. Math. Algorithms Appl.},\\n  year={2021},\\n  doi={10.1142/S1793830921501329},\\n  url={https://www.semanticscholar.org/paper/d2340629e49db997e91f2cc855c30bfba85e8867}\\n}' apa='Sharma, S. & Bhat, V. K. (2021). Fault-tolerant metric dimension of two-fold heptagonal-nonagonal circular ladder. Discret. Math. Algorithms Appl..' ieee='S. Sharma, V. K. Bhat, \"Fault-tolerant metric dimension of two-fold heptagonal-nonagonal circular ladder,\" Discret. Math. Algorithms Appl., 2021.' mla='Sharma, S., and V. K. Bhat. \"Fault-tolerant metric dimension of two-fold heptagonal-nonagonal circular ladder.\" Discret. Math. Algorithms Appl., 2021.'",
  "paper_id='10_47836_mjms_19_3_16' bibtex='@article{10_47836_mjms_19_3_16,\\n  title={Investigating Metric and Edge Metric Resolvability in Molecular Structures of Breast Cancer Therapeutics},\\n  author={E. Pandeeswari and J. Ravi Sankar},\\n  journal={Malaysian Journal of Mathematical Sciences},\\n  year={2025},\\n  doi={10.47836/mjms.19.3.16},\\n  url={https://doi.org/10.47836/mjms.19.3.16}\\n}' apa='Pandeeswari, E. & Sankar, J. R. (2025). Investigating Metric and Edge Metric Resolvability in Molecular Structures of Breast Cancer Therapeutics. Malaysian Journal of Mathematical Sciences.' ieee='E. Pandeeswari, J. Ravi Sankar, \"Investigating Metric and Edge Metric Resolvability in Molecular Structures of Breast Cancer Therapeutics,\" Malaysian Journal of Mathematical Sciences, 2025.' mla='Pandeeswari, E., and J. Ravi Sankar. \"Investigating Metric and Edge Metric Resolvability in Molecular Structures of Breast Cancer Therapeutics.\" Malaysian Journal of Mathematical Sciences, 2025.'",
  "paper_id='10_2478_auom_2020_0032' bibtex='@article{10_2478_auom_2020_0032,\\n  title={Edge metric dimension of some classes of circulant graphs},\\n  author={M. Ahsan and Zohaib Zahid and Sohail Zafar},\\n  journal={},\\n  year={2020},\\n  doi={10.2478/auom-2020-0032},\\n  url={https://www.semanticscholar.org/paper/cdcc0acd614a3f7756cd6d37a4546e8e0f05ca13}\\n}' apa='Ahsan, M., Zahid, Z., & Zafar, S. (2020). Edge metric dimension of some classes of circulant graphs. .' ieee='M. Ahsan, Zohaib Zahid, Sohail Zafar, \"Edge metric dimension of some classes of circulant graphs,\" , 2020.' mla='Ahsan, M., et al.. \"Edge metric dimension of some classes of circulant graphs.\" , 2020.'",
  "paper_id='10_61091_jcmcc122_19' bibtex='@article{10_61091_jcmcc122_19,\\n  title={On Symmetrical Convex Polytopes and their Edge Resolvability},\\n  author={S. Sharma},\\n  journal={Journal of Combinatorial Mathematics and Combinatorial Computing},\\n  year={2024},\\n  doi={10.61091/jcmcc122-19},\\n  url={https://www.semanticscholar.org/paper/775a7e88e4a9916934406bb81a37aff83fe0805b}\\n}' apa='Sharma, S. (2024). On Symmetrical Convex Polytopes and their Edge Resolvability. Journal of Combinatorial Mathematics and Combinatorial Computing.' ieee='S. Sharma, \"On Symmetrical Convex Polytopes and their Edge Resolvability,\" Journal of Combinatorial Mathematics and Combinatorial Computing, 2024.' mla='Sharma, S.. \"On Symmetrical Convex Polytopes and their Edge Resolvability.\" Journal of Combinatorial Mathematics and Combinatorial Computing, 2024.'",
  "paper_id='10_5614_ejgta_2023_11_1_16' bibtex='@article{10_5614_ejgta_2023_11_1_16,\\n  title={The dominant edge metric dimension of graphs},\\n  author={M. Tavakoli and M. Korivand and A. Erfanian and Gholamreza Abrishami and E. Baskoro},\\n  journal={Electronic Journal of Graph Theory and Applications},\\n  year={2023},\\n  doi={10.5614/ejgta.2023.11.1.16},\\n  url={https://www.semanticscholar.org/paper/12b9184b6000235ed015342cd8c4ac4e163f6e4f}\\n}' apa='Tavakoli, M., Korivand, M., Erfanian, A., Abrishami, G., & Baskoro, E. (2023). The dominant edge metric dimension of graphs. Electronic Journal of Graph Theory and Applications.' ieee='M. Tavakoli et al., \"The dominant edge metric dimension of graphs,\" Electronic Journal of Graph Theory and Applications, 2023.' mla='Tavakoli, M., et al.. \"The dominant edge metric dimension of graphs.\" Electronic Journal of Graph Theory and Applications, 2023.'",
  "paper_id='10_1088_1742_6596_1821_1_012017' bibtex='@article{10_1088_1742_6596_1821_1_012017,\\n  title={Edge metric dimensions of neighbourhood corona graph containing dominant vertices},\\n  author={N. M. Rosyidah and Rinurwati},\\n  journal={},\\n  year={2021},\\n  doi={10.1088/1742-6596/1821/1/012017},\\n  url={https://www.semanticscholar.org/paper/0d69dc8a67eb4d2951efce04984c497e529988d9}\\n}' apa='Rosyidah, N. M. & Rinurwati (2021). Edge metric dimensions of neighbourhood corona graph containing dominant vertices. .' ieee='N. M. Rosyidah, Rinurwati, \"Edge metric dimensions of neighbourhood corona graph containing dominant vertices,\" , 2021.' mla='Rosyidah, N. M., and Rinurwati. \"Edge metric dimensions of neighbourhood corona graph containing dominant vertices.\" , 2021.'",
  "paper_id='arxiv_2107_14484' bibtex='@article{arxiv_2107_14484,\\n  title={Metric and Edge Metric Dimension of Zigzag Edge Coronoid Fused with Starphene},\\n  author={Sunny Kumar Sharma and Vijay Kumar Bhat and Hassan Raza and Karnika Sharma},\\n  journal={arXiv preprint arXiv:2107.14484},\\n  year={2021},\\n  url={http://arxiv.org/abs/2107.14484v1}\\n}' apa='Sharma, S. K., Bhat, V. K., Raza, H., & Sharma, K. (2021). Metric and Edge Metric Dimension of Zigzag Edge Coronoid Fused with Starphene. arXiv preprint arXiv:2107.14484.' ieee='Sunny Kumar Sharma et al., \"Metric and Edge Metric Dimension of Zigzag Edge Coronoid Fused with Starphene,\" arXiv preprint arXiv:2107.14484, 2021.' mla='Sharma, S. K., et al.. \"Metric and Edge Metric Dimension of Zigzag Edge Coronoid Fused with Starphene.\" arXiv, 2107.14484, 2021.'",
  "paper_id='10_1142_s0129054125500285' bibtex='@article{10_1142_s0129054125500285,\\n  title={The Nonlocal Metric Dimension of Some Convex Polytopes},\\n  author={Jinxia Liang and Chenxu Yang and Guixian Liu and Hongluan Zhao},\\n  journal={International Journal of Foundations of Computer Science},\\n  year={2025},\\n  doi={10.1142/s0129054125500285},\\n  url={https://www.semanticscholar.org/paper/79cef35c416eb9028b3a2ea09749a69654207960}\\n}' apa='Liang, J., Yang, C., Liu, G., & Zhao, H. (2025). The Nonlocal Metric Dimension of Some Convex Polytopes. International Journal of Foundations of Computer Science.' ieee='Jinxia Liang et al., \"The Nonlocal Metric Dimension of Some Convex Polytopes,\" International Journal of Foundations of Computer Science, 2025.' mla='Liang, J., et al.. \"The Nonlocal Metric Dimension of Some Convex Polytopes.\" International Journal of Foundations of Computer Science, 2025.'",
  "paper_id='10_3934_neuroscience_2022021' bibtex='@article{10_3934_neuroscience_2022021,\\n  title={Neural basis of topographical disorientation in the primate posterior cingulate gyrus based on a labeled graph},\\n  author={Yang Yu and Tsuyoshi Setogawa and Jumpei Matsumoto and Hiroshi Nishimaru and H. Nishijo},\\n  journal={AIMS Neuroscience},\\n  year={2022},\\n  doi={10.3934/neuroscience.2022021},\\n  url={https://www.semanticscholar.org/paper/ae153721b12c77fe94fdb1c01aad2188429d1f81}\\n}' apa='Yu, Y., Setogawa, T., Matsumoto, J., Nishimaru, H., & Nishijo, H. (2022). Neural basis of topographical disorientation in the primate posterior cingulate gyrus based on a labeled graph. AIMS Neuroscience.' ieee='Yang Yu et al., \"Neural basis of topographical disorientation in the primate posterior cingulate gyrus based on a labeled graph,\" AIMS Neuroscience, 2022.' mla='Yu, Y., et al.. \"Neural basis of topographical disorientation in the primate posterior cingulate gyrus based on a labeled graph.\" AIMS Neuroscience, 2022.'",
  "paper_id='10_12962_j24775401_v10i1_20267' bibtex='@article{10_12962_j24775401_v10i1_20267,\\n  title={Bi-Edge Metric Dimension of Graphs},\\n  author={Rinurwati Rinurwati and Fadillah Dian Maharani},\\n  journal={International Journal of Computing Science and Applied Mathematics},\\n  year={2024},\\n  doi={10.12962/j24775401.v10i1.20267},\\n  url={https://doi.org/10.12962/j24775401.v10i1.20267}\\n}' apa='Rinurwati, R. & Maharani, F. D. (2024). Bi-Edge Metric Dimension of Graphs. International Journal of Computing Science and Applied Mathematics.' ieee='Rinurwati Rinurwati, Fadillah Dian Maharani, \"Bi-Edge Metric Dimension of Graphs,\" International Journal of Computing Science and Applied Mathematics, 2024.' mla='Rinurwati, R., and Fadillah Dian Maharani. \"Bi-Edge Metric Dimension of Graphs.\" International Journal of Computing Science and Applied Mathematics, 2024.'",
  "paper_id='10_1080_10406638_2021_2019066' bibtex='@article{10_1080_10406638_2021_2019066,\\n  title={Multiset and Mixed Metric Dimension for Starphene and Zigzag-Edge Coronoid},\\n  author={Jia-bao Liu and S. Sharma and V. K. Bhat and H. Raza},\\n  journal={Polycyclic aromatic compounds (Print)},\\n  year={2021},\\n  doi={10.1080/10406638.2021.2019066},\\n  url={https://www.semanticscholar.org/paper/0817cedef534d9cf73a0077dd5849f087f334485}\\n}' apa='Liu, J., Sharma, S., Bhat, V. K., & Raza, H. (2021). Multiset and Mixed Metric Dimension for Starphene and Zigzag-Edge Coronoid. Polycyclic aromatic compounds (Print).' ieee='Jia-bao Liu et al., \"Multiset and Mixed Metric Dimension for Starphene and Zigzag-Edge Coronoid,\" Polycyclic aromatic compounds (Print), 2021.' mla='Liu, J., et al.. \"Multiset and Mixed Metric Dimension for Starphene and Zigzag-Edge Coronoid.\" Polycyclic aromatic compounds (Print), 2021.'",
  "paper_id='10_1016_j_tcs_2021_11_015' bibtex='@article{10_1016_j_tcs_2021_11_015,\\n  title={Computing a metric basis of a bipartite distance-hereditary graph},\\n  author={Marina Moscarini},\\n  journal={Theoretical Computer Science},\\n  year={2022},\\n  doi={10.1016/j.tcs.2021.11.015},\\n  url={https://doi.org/10.1016/j.tcs.2021.11.015}\\n}' apa='Moscarini, M. (2022). Computing a metric basis of a bipartite distance-hereditary graph. Theoretical Computer Science.' ieee='Marina Moscarini, \"Computing a metric basis of a bipartite distance-hereditary graph,\" Theoretical Computer Science, 2022.' mla='Moscarini, M.. \"Computing a metric basis of a bipartite distance-hereditary graph.\" Theoretical Computer Science, 2022.'",
  "paper_id='10_1007_978_3_642_00683_8_7' bibtex='@article{10_1007_978_3_642_00683_8_7,\\n  title={Adaptive Edge and Defect Detection as a basis for Automated Lumber Classification and Optimisation},\\n  author={Roman Louban},\\n  journal={Springer Series in Materials Science},\\n  year={2009},\\n  doi={10.1007/978-3-642-00683-8_7},\\n  url={https://doi.org/10.1007/978-3-642-00683-8_7}\\n}' apa='Louban, R. (2009). Adaptive Edge and Defect Detection as a basis for Automated Lumber Classification and Optimisation. Springer Series in Materials Science.' ieee='Roman Louban, \"Adaptive Edge and Defect Detection as a basis for Automated Lumber Classification and Optimisation,\" Springer Series in Materials Science, 2009.' mla='Louban, R.. \"Adaptive Edge and Defect Detection as a basis for Automated Lumber Classification and Optimisation.\" Springer Series in Materials Science, 2009.'",
  "paper_id='10_3390_dynamics5020016' bibtex='@article{10_3390_dynamics5020016,\\n  title={Kolmogorov–Smirnov-Based Edge Centrality Measure for Metric Graphs},\\n  author={Christina Durón and Hannah Kravitz and Moysey Brio},\\n  journal={Dynamics},\\n  year={2025},\\n  doi={10.3390/dynamics5020016},\\n  url={https://doi.org/10.3390/dynamics5020016}\\n}' apa='Durón, C., Kravitz, H., & Brio, M. (2025). Kolmogorov–Smirnov-Based Edge Centrality Measure for Metric Graphs. Dynamics.' ieee='Christina Durón, Hannah Kravitz, Moysey Brio, \"Kolmogorov–Smirnov-Based Edge Centrality Measure for Metric Graphs,\" Dynamics, 2025.' mla='Durón, C., et al.. \"Kolmogorov–Smirnov-Based Edge Centrality Measure for Metric Graphs.\" Dynamics, 2025.'",
  "paper_id='10_17654_ms102050965' bibtex='@article{10_17654_ms102050965,\\n  title={ON METRIC DIMENSION OF EDGE-CORONA GRAPHS},\\n  author={Rinurwati and Herry Suprajitno and Slamin},\\n  journal={Far East Journal of Mathematical Sciences (FJMS)},\\n  year={2017},\\n  doi={10.17654/ms102050965},\\n  url={https://doi.org/10.17654/ms102050965}\\n}' apa='Rinurwati, Suprajitno, H., & Slamin (2017). ON METRIC DIMENSION OF EDGE-CORONA GRAPHS. Far East Journal of Mathematical Sciences (FJMS).' ieee='Rinurwati, Herry Suprajitno, Slamin, \"ON METRIC DIMENSION OF EDGE-CORONA GRAPHS,\" Far East Journal of Mathematical Sciences (FJMS), 2017.' mla='Rinurwati, et al.. \"ON METRIC DIMENSION OF EDGE-CORONA GRAPHS.\" Far East Journal of Mathematical Sciences (FJMS), 2017.'",
  "paper_id='10_1088_1742_6596_1836_1_012010' bibtex='@article{10_1088_1742_6596_1836_1_012010,\\n  title={Metric and edge-metric dimensions of bobble-neighbourhood-corona graphs},\\n  author={Rinurwati and R. Nabila},\\n  journal={},\\n  year={2021},\\n  doi={10.1088/1742-6596/1836/1/012010},\\n  url={https://www.semanticscholar.org/paper/8dc3cf4ebf677a7cc33aa0d8f5acb5f149562627}\\n}' apa='Rinurwati & Nabila, R. (2021). Metric and edge-metric dimensions of bobble-neighbourhood-corona graphs. .' ieee='Rinurwati, R. Nabila, \"Metric and edge-metric dimensions of bobble-neighbourhood-corona graphs,\" , 2021.' mla='Rinurwati, and R. Nabila. \"Metric and edge-metric dimensions of bobble-neighbourhood-corona graphs.\" , 2021.'",
  "paper_id='10_1088_1402_4896_ad3add' bibtex='@article{10_1088_1402_4896_ad3add,\\n  title={Mathematical analysis of the structure of one-heptagonal carbon nanocone in terms of its basis and dimension},\\n  author={Yousef Al-Qudah and Ali Jaradat and S. Sharma and Vijay Kumar Bhat},\\n  journal={Physica Scripta},\\n  year={2024},\\n  doi={10.1088/1402-4896/ad3add},\\n  url={https://www.semanticscholar.org/paper/384bd123aed81a2bedf83f55d7f64527980cc399}\\n}' apa='Al-Qudah, Y., Jaradat, A., Sharma, S., & Bhat, V. K. (2024). Mathematical analysis of the structure of one-heptagonal carbon nanocone in terms of its basis and dimension. Physica Scripta.' ieee='Yousef Al-Qudah et al., \"Mathematical analysis of the structure of one-heptagonal carbon nanocone in terms of its basis and dimension,\" Physica Scripta, 2024.' mla='Al-Qudah, Y., et al.. \"Mathematical analysis of the structure of one-heptagonal carbon nanocone in terms of its basis and dimension.\" Physica Scripta, 2024.'",
  "paper_id='10_3390_sym15030708' bibtex='@article{10_3390_sym15030708,\\n  title={Constant Time Calculation of the Metric Dimension of the Join of Path Graphs},\\n  author={Chuanjun Zhang and Ghulam Haidar and Murad-ul-Islam Khan and Faisal Yousafzai and K. Hila and A. Khan},\\n  journal={Symmetry},\\n  year={2023},\\n  doi={10.3390/sym15030708},\\n  url={https://www.semanticscholar.org/paper/8d48400f3faa28fbb61dccdd4cdd37f58faf1d94}\\n}' apa='Zhang, C., Haidar, G., Khan, M., Yousafzai, F., Hila, K., & Khan, A. (2023). Constant Time Calculation of the Metric Dimension of the Join of Path Graphs. Symmetry.' ieee='Chuanjun Zhang et al., \"Constant Time Calculation of the Metric Dimension of the Join of Path Graphs,\" Symmetry, 2023.' mla='Zhang, C., et al.. \"Constant Time Calculation of the Metric Dimension of the Join of Path Graphs.\" Symmetry, 2023.'",
  "paper_id='10_1109_TNSM_2025_3539830' bibtex='@article{10_1109_TNSM_2025_3539830,\\n  title={Explainable and Energy-Efficient Selective Ensemble Learning in Mobile Edge Computing Systems},\\n  author={Lei Feng and Chaorui Liao and Yingji Shi and F. Zhou},\\n  journal={IEEE Transactions on Network and Service Management},\\n  year={2025},\\n  doi={10.1109/TNSM.2025.3539830},\\n  url={https://www.semanticscholar.org/paper/3a56be071dd958ffec0a1450cde88ac3f58825a1}\\n}' apa='Feng, L., Liao, C., Shi, Y., & Zhou, F. (2025). Explainable and Energy-Efficient Selective Ensemble Learning in Mobile Edge Computing Systems. IEEE Transactions on Network and Service Management.' ieee='Lei Feng et al., \"Explainable and Energy-Efficient Selective Ensemble Learning in Mobile Edge Computing Systems,\" IEEE Transactions on Network and Service Management, 2025.' mla='Feng, L., et al.. \"Explainable and Energy-Efficient Selective Ensemble Learning in Mobile Edge Computing Systems.\" IEEE Transactions on Network and Service Management, 2025.'",
  "paper_id='10_1109_ACCESS_2021_3083182' bibtex='@article{10_1109_ACCESS_2021_3083182,\\n  title={The Edge Version of Metric Dimension for the Family of Circulant Graphs Cₙ(1, 2)},\\n  author={Junya Lv and Xiao-Yan Lv and R. Nasir and Zohaib Zahids},\\n  journal={IEEE Access},\\n  year={2021},\\n  doi={10.1109/ACCESS.2021.3083182},\\n  url={https://www.semanticscholar.org/paper/c6be28559aa0f6ddbfbe7d08e9b754ee9efc98ee}\\n}' apa='Lv, J., Lv, X., Nasir, R., & Zahids, Z. (2021). The Edge Version of Metric Dimension for the Family of Circulant Graphs Cₙ(1, 2). IEEE Access.' ieee='Junya Lv et al., \"The Edge Version of Metric Dimension for the Family of Circulant Graphs Cₙ(1, 2),\" IEEE Access, 2021.' mla='Lv, J., et al.. \"The Edge Version of Metric Dimension for the Family of Circulant Graphs Cₙ(1, 2).\" IEEE Access, 2021.'",
  "paper_id='10_1088_1742_6596_1306_1_012015' bibtex='@inproceedings{10_1088_1742_6596_1306_1_012015,\\n  title={The local metric dimension of generalized broken fan graph and edge corona product of star graph and path graph},\\n  author={Silfiatul Khoiriah and Tri Atmojo Kusmayadi},\\n  booktitle={Journal of Physics: Conference Series},\\n  year={2019},\\n  doi={10.1088/1742-6596/1306/1/012015},\\n  url={https://www.semanticscholar.org/paper/e254b51aae76fc9a7d522ce16af5ca2610def123}\\n}' apa='Khoiriah, S. & Kusmayadi, T. A. (2019). The local metric dimension of generalized broken fan graph and edge corona product of star graph and path graph. In Journal of Physics: Conference Series.' ieee='Silfiatul Khoiriah, Tri Atmojo Kusmayadi, \"The local metric dimension of generalized broken fan graph and edge corona product of star graph and path graph,\" in Journal of Physics: Conference Series, 2019.' mla='Khoiriah, S., and Tri Atmojo Kusmayadi. \"The local metric dimension of generalized broken fan graph and edge corona product of star graph and path graph.\" Journal of Physics: Conference Series, 2019.'",
  "paper_id='10_1142_s1793830924500769' bibtex='@article{10_1142_s1793830924500769,\\n  title={Metric basis and metric dimension of some infinite planar graphs},\\n  author={S. Vidya and Sunny Kumar Sharma and Prasanna Poojary and G. R. Vadiraja Bhatta},\\n  journal={Discrete Mathematics, Algorithms and Applications},\\n  year={2024},\\n  doi={10.1142/s1793830924500769},\\n  url={https://doi.org/10.1142/s1793830924500769}\\n}' apa='Vidya, S., Sharma, S. K., Poojary, P., & Bhatta, G. R. V. (2024). Metric basis and metric dimension of some infinite planar graphs. Discrete Mathematics, Algorithms and Applications.' ieee='S. Vidya et al., \"Metric basis and metric dimension of some infinite planar graphs,\" Discrete Mathematics, Algorithms and Applications, 2024.' mla='Vidya, S., et al.. \"Metric basis and metric dimension of some infinite planar graphs.\" Discrete Mathematics, Algorithms and Applications, 2024.'",
  "paper_id='10_29020_nybg_ejpam_v17i3_5295' bibtex='@article{10_29020_nybg_ejpam_v17i3_5295,\\n  title={Investigating Metric Dimension and Edge Metric Dimension of Hexagonal Boron Nitride and Carbon Nanotubes},\\n  author={Waseem Abbas and Faryal Chudhary and Umar Farooq and Muhammad Azeem and Yilun Shang},\\n  journal={European Journal of Pure and Applied Mathematics},\\n  year={2024},\\n  doi={10.29020/nybg.ejpam.v17i3.5295},\\n  url={https://doi.org/10.29020/nybg.ejpam.v17i3.5295}\\n}' apa='Abbas, W., Chudhary, F., Farooq, U., Azeem, M., & Shang, Y. (2024). Investigating Metric Dimension and Edge Metric Dimension of Hexagonal Boron Nitride and Carbon Nanotubes. European Journal of Pure and Applied Mathematics.' ieee='Waseem Abbas et al., \"Investigating Metric Dimension and Edge Metric Dimension of Hexagonal Boron Nitride and Carbon Nanotubes,\" European Journal of Pure and Applied Mathematics, 2024.' mla='Abbas, W., et al.. \"Investigating Metric Dimension and Edge Metric Dimension of Hexagonal Boron Nitride and Carbon Nanotubes.\" European Journal of Pure and Applied Mathematics, 2024.'",
  "paper_id='10_1007_s10476_024_00006_z' bibtex='@article{10_1007_s10476_024_00006_z,\\n  title={Reaction-diffusion equations on metric graphs with edge noise},\\n  author={E. Sikolya},\\n  journal={Analysis Mathematica},\\n  year={2024},\\n  doi={10.1007/s10476-024-00006-z},\\n  url={https://doi.org/10.1007/s10476-024-00006-z}\\n}' apa='Sikolya, E. (2024). Reaction-diffusion equations on metric graphs with edge noise. Analysis Mathematica.' ieee='E. Sikolya, \"Reaction-diffusion equations on metric graphs with edge noise,\" Analysis Mathematica, 2024.' mla='Sikolya, E.. \"Reaction-diffusion equations on metric graphs with edge noise.\" Analysis Mathematica, 2024.'",
  "paper_id='10_1142_s1793830920500378' bibtex='@article{10_1142_s1793830920500378,\\n  title={Edge version of metric dimension for the families of grid graphs and generalized prism graphs},\\n  author={R. Nasir and Zohaib Zahid and Sohail Zafar},\\n  journal={Discret. Math. Algorithms Appl.},\\n  year={2020},\\n  doi={10.1142/s1793830920500378},\\n  url={https://www.semanticscholar.org/paper/2c6fbbb925f32463abd59b61c1bd0ee441d2cbd4}\\n}' apa='Nasir, R., Zahid, Z., & Zafar, S. (2020). Edge version of metric dimension for the families of grid graphs and generalized prism graphs. Discret. Math. Algorithms Appl..' ieee='R. Nasir, Zohaib Zahid, Sohail Zafar, \"Edge version of metric dimension for the families of grid graphs and generalized prism graphs,\" Discret. Math. Algorithms Appl., 2020.' mla='Nasir, R., et al.. \"Edge version of metric dimension for the families of grid graphs and generalized prism graphs.\" Discret. Math. Algorithms Appl., 2020.'",
  "paper_id='10_1371_journal_pone_0296897' bibtex='@article{10_1371_journal_pone_0296897,\\n  title={Load balance -aware dynamic cloud-edge-end collaborative offloading strategy},\\n  author={Yueqi Fan},\\n  journal={PLoS ONE},\\n  year={2024},\\n  doi={10.1371/journal.pone.0296897},\\n  url={https://www.semanticscholar.org/paper/dc6f0a92cd5613ec139e670066c82c9eeaa7cfb2}\\n}' apa='Fan, Y. (2024). Load balance -aware dynamic cloud-edge-end collaborative offloading strategy. PLoS ONE.' ieee='Yueqi Fan, \"Load balance -aware dynamic cloud-edge-end collaborative offloading strategy,\" PLoS ONE, 2024.' mla='Fan, Y.. \"Load balance -aware dynamic cloud-edge-end collaborative offloading strategy.\" PLoS ONE, 2024.'",
  "paper_id='10_1088_1742_6596_1306_1_012018' bibtex='@inproceedings{10_1088_1742_6596_1306_1_012018,\\n  title={On the strong metric dimension of crossed prism graph and edge corona of cycle with path graph},\\n  author={Astri Yunitasari and Tri Atmojo Kusmayadi},\\n  booktitle={Journal of Physics: Conference Series},\\n  year={2019},\\n  doi={10.1088/1742-6596/1306/1/012018},\\n  url={https://www.semanticscholar.org/paper/c67656d6c56094aae463beaf967c67f39f011cad}\\n}' apa='Yunitasari, A. & Kusmayadi, T. A. (2019). On the strong metric dimension of crossed prism graph and edge corona of cycle with path graph. In Journal of Physics: Conference Series.' ieee='Astri Yunitasari, Tri Atmojo Kusmayadi, \"On the strong metric dimension of crossed prism graph and edge corona of cycle with path graph,\" in Journal of Physics: Conference Series, 2019.' mla='Yunitasari, A., and Tri Atmojo Kusmayadi. \"On the strong metric dimension of crossed prism graph and edge corona of cycle with path graph.\" Journal of Physics: Conference Series, 2019.'",
  "paper_id='10_1109_TON_2025_3601104' bibtex='@article{10_1109_TON_2025_3601104,\\n  title={Multi-Source Peak Age of Information Optimization in Mobile Edge Computing Systems},\\n  author={Jianhang Zhu and Jie Gong},\\n  journal={IEEE Transactions on Networking},\\n  year={2025},\\n  doi={10.1109/TON.2025.3601104},\\n  url={https://www.semanticscholar.org/paper/82f5d11dd5b8b71525ab0c493dbf1f7969999f68}\\n}' apa='Zhu, J. & Gong, J. (2025). Multi-Source Peak Age of Information Optimization in Mobile Edge Computing Systems. IEEE Transactions on Networking.' ieee='Jianhang Zhu, Jie Gong, \"Multi-Source Peak Age of Information Optimization in Mobile Edge Computing Systems,\" IEEE Transactions on Networking, 2025.' mla='Zhu, J., and Jie Gong. \"Multi-Source Peak Age of Information Optimization in Mobile Edge Computing Systems.\" IEEE Transactions on Networking, 2025.'",
  "paper_id='10_19139_soic_2310_5070_1925' bibtex='@article{10_19139_soic_2310_5070_1925,\\n  title={Dominant Mixed Metric Dimension of Graph},\\n  author={R. Alfarisi and S. Husain and L. Susilowati and A. I. Kristiana},\\n  journal={Statistics, Optimization &amp; Information Computing},\\n  year={2024},\\n  doi={10.19139/soic-2310-5070-1925},\\n  url={https://www.semanticscholar.org/paper/bba5b0885d9a66ff41ea3abaf4a5f4a563f43356}\\n}' apa='Alfarisi, R., Husain, S., Susilowati, L., & Kristiana, A. I. (2024). Dominant Mixed Metric Dimension of Graph. Statistics, Optimization &amp; Information Computing.' ieee='R. Alfarisi et al., \"Dominant Mixed Metric Dimension of Graph,\" Statistics, Optimization &amp; Information Computing, 2024.' mla='Alfarisi, R., et al.. \"Dominant Mixed Metric Dimension of Graph.\" Statistics, Optimization &amp; Information Computing, 2024.'",
  "paper_id='10_48550_arXiv_2412_00295' bibtex='@article{10_48550_arXiv_2412_00295,\\n  title={Linear Simple Cycle Reservoirs at the edge of stability perform Fourier decomposition of the input driving signals},\\n  author={Robert Simon Fong and Boyu Li and Peter Tino},\\n  journal={Chaos},\\n  year={2024},\\n  doi={10.48550/arXiv.2412.00295},\\n  url={https://www.semanticscholar.org/paper/ffeae8282b2a5cdf952712ac6705a22756e353ea}\\n}' apa='Fong, R. S., Li, B., & Tino, P. (2024). Linear Simple Cycle Reservoirs at the edge of stability perform Fourier decomposition of the input driving signals. Chaos.' ieee='Robert Simon Fong, Boyu Li, Peter Tino, \"Linear Simple Cycle Reservoirs at the edge of stability perform Fourier decomposition of the input driving signals,\" Chaos, 2024.' mla='Fong, R. S., et al.. \"Linear Simple Cycle Reservoirs at the edge of stability perform Fourier decomposition of the input driving signals.\" Chaos, 2024.'",
  "paper_id='10_21203_rs_3_rs_3783303_v1' bibtex='@article{10_21203_rs_3_rs_3783303_v1,\\n  title={Fault-Tolerant Metric Dimension (FTMD) of M-polynomial of Zigzag Edge Coronoid Fused by Starphene},\\n  author={Umar Farooq and Faryal Chudhary and Deeba Afzal and Waseem Abbas},\\n  journal={},\\n  year={2023},\\n  doi={10.21203/rs.3.rs-3783303/v1},\\n  url={https://doi.org/10.21203/rs.3.rs-3783303/v1}\\n}' apa='Farooq, U., Chudhary, F., Afzal, D., & Abbas, W. (2023). Fault-Tolerant Metric Dimension (FTMD) of M-polynomial of Zigzag Edge Coronoid Fused by Starphene. .' ieee='Umar Farooq et al., \"Fault-Tolerant Metric Dimension (FTMD) of M-polynomial of Zigzag Edge Coronoid Fused by Starphene,\" , 2023.' mla='Farooq, U., et al.. \"Fault-Tolerant Metric Dimension (FTMD) of M-polynomial of Zigzag Edge Coronoid Fused by Starphene.\" , 2023.'",
  "paper_id='10_1088_1742_6596_1306_1_012014' bibtex='@article{10_1088_1742_6596_1306_1_012014,\\n  title={The local metric dimension of edge corona and corona product of cycle graph and path graph},\\n  author={Elis Dyah Wulancar and Tri Atmojo Kusmayadi},\\n  journal={},\\n  year={2019},\\n  doi={10.1088/1742-6596/1306/1/012014},\\n  url={https://www.semanticscholar.org/paper/09bb0e3a7c56ab57716bf7a0bd49b5ca5bca5161}\\n}' apa='Wulancar, E. D. & Kusmayadi, T. A. (2019). The local metric dimension of edge corona and corona product of cycle graph and path graph. .' ieee='Elis Dyah Wulancar, Tri Atmojo Kusmayadi, \"The local metric dimension of edge corona and corona product of cycle graph and path graph,\" , 2019.' mla='Wulancar, E. D., and Tri Atmojo Kusmayadi. \"The local metric dimension of edge corona and corona product of cycle graph and path graph.\" , 2019.'",
  "paper_id='10_1088_1742_6596_1306_1_012017' bibtex='@inproceedings{10_1088_1742_6596_1306_1_012017,\\n  title={On the metric dimension of generalized broken fan graph and edge corona product of path with star graph},\\n  author={Makarima Sabila and Tri Atmojo Kusmayadi},\\n  booktitle={Journal of Physics: Conference Series},\\n  year={2019},\\n  doi={10.1088/1742-6596/1306/1/012017},\\n  url={https://www.semanticscholar.org/paper/2bf02a88650fd702b1baa8c6b8b68a99323a2506}\\n}' apa='Sabila, M. & Kusmayadi, T. A. (2019). On the metric dimension of generalized broken fan graph and edge corona product of path with star graph. In Journal of Physics: Conference Series.' ieee='Makarima Sabila, Tri Atmojo Kusmayadi, \"On the metric dimension of generalized broken fan graph and edge corona product of path with star graph,\" in Journal of Physics: Conference Series, 2019.' mla='Sabila, M., and Tri Atmojo Kusmayadi. \"On the metric dimension of generalized broken fan graph and edge corona product of path with star graph.\" Journal of Physics: Conference Series, 2019.'",
  "paper_id='10_3934_math_2024485' bibtex='@article{10_3934_math_2024485,\\n  title={Metric based resolvability of cycle related graphs},\\n  author={Ali N. A. Koam},\\n  journal={AIMS Mathematics},\\n  year={2024},\\n  doi={10.3934/math.2024485},\\n  url={https://www.semanticscholar.org/paper/59d1f8d37b2c132e57f7f73b1517acce9d261ce9}\\n}' apa='Koam, A. N. A. (2024). Metric based resolvability of cycle related graphs. AIMS Mathematics.' ieee='Ali N. A. Koam, \"Metric based resolvability of cycle related graphs,\" AIMS Mathematics, 2024.' mla='Koam, A. N. A.. \"Metric based resolvability of cycle related graphs.\" AIMS Mathematics, 2024.'",
  "paper_id='10_30812_matrik_v23i3_3961' bibtex='@article{10_30812_matrik_v23i3_3961,\\n  title={Deep Learning Model Compression Techniques Performance on Edge Devices},\\n  author={Rakandhiya D. Rachmanto and Ahmad N. L. Nabhaan and Arief Setyanto},\\n  journal={Matrik},\\n  year={2024},\\n  doi={10.30812/matrik.v23i3.3961},\\n  url={https://www.semanticscholar.org/paper/cfa4477b85bd9a48cad2181d6044745d187e698d}\\n}' apa='Rachmanto, R. D., Nabhaan, A. N. L., & Setyanto, A. (2024). Deep Learning Model Compression Techniques Performance on Edge Devices. Matrik.' ieee='Rakandhiya D. Rachmanto, Ahmad N. L. Nabhaan, Arief Setyanto, \"Deep Learning Model Compression Techniques Performance on Edge Devices,\" Matrik, 2024.' mla='Rachmanto, R. D., et al.. \"Deep Learning Model Compression Techniques Performance on Edge Devices.\" Matrik, 2024.'",
  "paper_id='10_3390_buildings13112739' bibtex='@article{10_3390_buildings13112739,\\n  title={Improved Edge Folding Algorithm for 3D Building Models Taking into Account the Visual Features},\\n  author={Haoyuan Bai and Tao Shen and Liang Huo and Xiaoyu Wang and Xinyu Liu},\\n  journal={Buildings},\\n  year={2023},\\n  doi={10.3390/buildings13112739},\\n  url={https://www.semanticscholar.org/paper/7edc9c1ab0da199c274c24b51cfd6dacd2172033}\\n}' apa='Bai, H., Shen, T., Huo, L., Wang, X., & Liu, X. (2023). Improved Edge Folding Algorithm for 3D Building Models Taking into Account the Visual Features. Buildings.' ieee='Haoyuan Bai et al., \"Improved Edge Folding Algorithm for 3D Building Models Taking into Account the Visual Features,\" Buildings, 2023.' mla='Bai, H., et al.. \"Improved Edge Folding Algorithm for 3D Building Models Taking into Account the Visual Features.\" Buildings, 2023.'",
  "paper_id='rehman_partition_dimension_and_2020' bibtex='@article{rehman_partition_dimension_and_2020,\\n  title={Partition dimension and strong metric dimension of chain cycle},\\n  author={Talmeez U. R. Rehman and N. Mehreen},\\n  journal={},\\n  year={2020},\\n  url={https://www.semanticscholar.org/paper/d0ac6764614f6f9b3235e5859199576954fecd33}\\n}' apa='Rehman, T. U. R. & Mehreen, N. (2020). Partition dimension and strong metric dimension of chain cycle. .' ieee='Talmeez U. R. Rehman, N. Mehreen, \"Partition dimension and strong metric dimension of chain cycle,\" , 2020.' mla='Rehman, T. U. R., and N. Mehreen. \"Partition dimension and strong metric dimension of chain cycle.\" , 2020.'",
  "paper_id='10_24891_ea_24_1_172' bibtex='@article{10_24891_ea_24_1_172,\\n  title={The metric basis for assessing corporate sustainability},\\n  author={Sergei V. PETROV},\\n  journal={Economic Analysis: Theory and Practice},\\n  year={2025},\\n  doi={10.24891/ea.24.1.172},\\n  url={https://doi.org/10.24891/ea.24.1.172}\\n}' apa='PETROV, S. V. (2025). The metric basis for assessing corporate sustainability. Economic Analysis: Theory and Practice.' ieee='Sergei V. PETROV, \"The metric basis for assessing corporate sustainability,\" Economic Analysis: Theory and Practice, 2025.' mla='PETROV, S. V.. \"The metric basis for assessing corporate sustainability.\" Economic Analysis: Theory and Practice, 2025.'",
  "paper_id='10_12988_IMF_2016_67102' bibtex='@article{10_12988_IMF_2016_67102,\\n  title={General results of local metric dimensions of edge-corona of graphs},\\n  author={Rinurwati and Slamin and H. Suprajitno},\\n  journal={},\\n  year={2016},\\n  doi={10.12988/IMF.2016.67102},\\n  url={https://www.semanticscholar.org/paper/c53391a49a76596a59a9878d48f7fb36c6fe9022}\\n}' apa='Rinurwati, Slamin, & Suprajitno, H. (2016). General results of local metric dimensions of edge-corona of graphs. .' ieee='Rinurwati, Slamin, H. Suprajitno, \"General results of local metric dimensions of edge-corona of graphs,\" , 2016.' mla='Rinurwati, et al.. \"General results of local metric dimensions of edge-corona of graphs.\" , 2016.'",
  "paper_id='10_1088_1402_4896_ad5fcb' bibtex='@article{10_1088_1402_4896_ad5fcb,\\n  title={Edge dependent fault-tolerance in certain carbon-based crystal structures},\\n  author={Malkesh Singh and Sohan Lal and S. Sharma and Vijay Kumar Bhat},\\n  journal={Physica Scripta},\\n  year={2024},\\n  doi={10.1088/1402-4896/ad5fcb},\\n  url={https://www.semanticscholar.org/paper/5f3da012d63151c240b1c4488f99de89d8a11a0d}\\n}' apa='Singh, M., Lal, S., Sharma, S., & Bhat, V. K. (2024). Edge dependent fault-tolerance in certain carbon-based crystal structures. Physica Scripta.' ieee='Malkesh Singh et al., \"Edge dependent fault-tolerance in certain carbon-based crystal structures,\" Physica Scripta, 2024.' mla='Singh, M., et al.. \"Edge dependent fault-tolerance in certain carbon-based crystal structures.\" Physica Scripta, 2024.'",
  "paper_id='10_1080_10406638_2023_2206142' bibtex='@article{10_1080_10406638_2023_2206142,\\n  title={Vertex-Edge Partition Resolvability for Certain Carbon Nanocones},\\n  author={S. Sharma and Malkesh Singh and V. K. Bhat},\\n  journal={Polycyclic aromatic compounds (Print)},\\n  year={2023},\\n  doi={10.1080/10406638.2023.2206142},\\n  url={https://www.semanticscholar.org/paper/751c99ccacc02fe077a7d9649a01b28bb18a8924}\\n}' apa='Sharma, S., Singh, M., & Bhat, V. K. (2023). Vertex-Edge Partition Resolvability for Certain Carbon Nanocones. Polycyclic aromatic compounds (Print).' ieee='S. Sharma, Malkesh Singh, V. K. Bhat, \"Vertex-Edge Partition Resolvability for Certain Carbon Nanocones,\" Polycyclic aromatic compounds (Print), 2023.' mla='Sharma, S., et al.. \"Vertex-Edge Partition Resolvability for Certain Carbon Nanocones.\" Polycyclic aromatic compounds (Print), 2023.'",
  "paper_id='10_30605_proximal_v8i1_4707' bibtex='@article{10_30605_proximal_v8i1_4707,\\n  title={Local Metric Dimension of the Line Graph of a Generalized Petersen Graph},\\n  author={Nur Fahri Tadjuddin},\\n  journal={Proximal},\\n  year={2024},\\n  doi={10.30605/proximal.v8i1.4707},\\n  url={https://www.semanticscholar.org/paper/1bf766aaede756fcc33ea0851c7e48ac609f8847}\\n}' apa='Tadjuddin, N. F. (2024). Local Metric Dimension of the Line Graph of a Generalized Petersen Graph. Proximal.' ieee='Nur Fahri Tadjuddin, \"Local Metric Dimension of the Line Graph of a Generalized Petersen Graph,\" Proximal, 2024.' mla='Tadjuddin, N. F.. \"Local Metric Dimension of the Line Graph of a Generalized Petersen Graph.\" Proximal, 2024.'",
  "paper_id='10_61091_ars157_10' bibtex='@article{10_61091_ars157_10,\\n  title={On Vertex-Edge Resolvability for the Web Graph and Prism Related Graph},\\n  author={S. Sharma and Vijay Kumar Bhat},\\n  journal={Ars Comb.},\\n  year={2023},\\n  doi={10.61091/ars157-10},\\n  url={https://www.semanticscholar.org/paper/c760d73148a8ebb5725019acbf7267ed9618a8a1}\\n}' apa='Sharma, S. & Bhat, V. K. (2023). On Vertex-Edge Resolvability for the Web Graph and Prism Related Graph. Ars Comb..' ieee='S. Sharma, Vijay Kumar Bhat, \"On Vertex-Edge Resolvability for the Web Graph and Prism Related Graph,\" Ars Comb., 2023.' mla='Sharma, S., and Vijay Kumar Bhat. \"On Vertex-Edge Resolvability for the Web Graph and Prism Related Graph.\" Ars Comb., 2023.'",
  "paper_id='10_48550_arXiv_2312_07048' bibtex='@article{10_48550_arXiv_2312_07048,\\n  title={Edge Wasserstein Distance Loss for Oriented Object Detection},\\n  author={Yuke Zhu and Yumeng Ruan and Zihua Xiong and Sheng Guo},\\n  journal={arXiv.org},\\n  year={2023},\\n  doi={10.48550/arXiv.2312.07048},\\n  url={https://www.semanticscholar.org/paper/96eedf259c85ee793648d362bcbeda017549267f}\\n}' apa='Zhu, Y., Ruan, Y., Xiong, Z., & Guo, S. (2023). Edge Wasserstein Distance Loss for Oriented Object Detection. arXiv.org.' ieee='Yuke Zhu et al., \"Edge Wasserstein Distance Loss for Oriented Object Detection,\" arXiv.org, 2023.' mla='Zhu, Y., et al.. \"Edge Wasserstein Distance Loss for Oriented Object Detection.\" arXiv.org, 2023.'",
  "paper_id='10_3390_math9121405' bibtex='@article{10_3390_math9121405,\\n  title={Edge Metric and Fault-Tolerant Edge Metric Dimension of Hollow Coronoid},\\n  author={Ali N. A. Koam and Ali Ahmad and Muhammad Ibrahim and Muhammad Azeem},\\n  journal={Mathematics},\\n  year={2021},\\n  doi={10.3390/math9121405},\\n  url={https://doi.org/10.3390/math9121405}\\n}' apa='Koam, A. N. A., Ahmad, A., Ibrahim, M., & Azeem, M. (2021). Edge Metric and Fault-Tolerant Edge Metric Dimension of Hollow Coronoid. Mathematics.' ieee='Ali N. A. Koam et al., \"Edge Metric and Fault-Tolerant Edge Metric Dimension of Hollow Coronoid,\" Mathematics, 2021.' mla='Koam, A. N. A., et al.. \"Edge Metric and Fault-Tolerant Edge Metric Dimension of Hollow Coronoid.\" Mathematics, 2021.'",
  "paper_id='10_1088_1742_6596_2279_1_012010' bibtex='@inproceedings{10_1088_1742_6596_2279_1_012010,\\n  title={Metric dimension of vertex shackle operation result graph on wheel and star graphs},\\n  author={Ilham Saifudin and R. Umilasari and Abdul Jalil},\\n  booktitle={Journal of Physics: Conference Series},\\n  year={2022},\\n  doi={10.1088/1742-6596/2279/1/012010},\\n  url={https://www.semanticscholar.org/paper/b30251c52b7c28038fa5a29d5b550f2f7e7a803c}\\n}' apa='Saifudin, I., Umilasari, R., & Jalil, A. (2022). Metric dimension of vertex shackle operation result graph on wheel and star graphs. In Journal of Physics: Conference Series.' ieee='Ilham Saifudin, R. Umilasari, Abdul Jalil, \"Metric dimension of vertex shackle operation result graph on wheel and star graphs,\" in Journal of Physics: Conference Series, 2022.' mla='Saifudin, I., et al.. \"Metric dimension of vertex shackle operation result graph on wheel and star graphs.\" Journal of Physics: Conference Series, 2022.'",
  "paper_id='10_21512_comtech_v13i2_7268' bibtex='@article{10_21512_comtech_v13i2_7268,\\n  title={The Alternative of Sensor Placement in Multi-Story Buildings through the Metric Dimension Approach: A Representation of Generalized Petersen Graphs},\\n  author={A. Asmiati and A. Junaidi and A. Aldino and Ari S. Munandar},\\n  journal={ComTech},\\n  year={2022},\\n  doi={10.21512/comtech.v13i2.7268},\\n  url={https://www.semanticscholar.org/paper/450a8b671eee43b094c4136b60b4e44055d0aaa1}\\n}' apa='Asmiati, A., Junaidi, A., Aldino, A., & Munandar, A. S. (2022). The Alternative of Sensor Placement in Multi-Story Buildings through the Metric Dimension Approach: A Representation of Generalized Petersen Graphs. ComTech.' ieee='A. Asmiati et al., \"The Alternative of Sensor Placement in Multi-Story Buildings through the Metric Dimension Approach: A Representation of Generalized Petersen Graphs,\" ComTech, 2022.' mla='Asmiati, A., et al.. \"The Alternative of Sensor Placement in Multi-Story Buildings through the Metric Dimension Approach: A Representation of Generalized Petersen Graphs.\" ComTech, 2022.'",
  "paper_id='10_1081_AMP_200060407' bibtex='@article{10_1081_AMP_200060407,\\n  title={Redefining the Diamond Cutting Edge: A Technique that Complements Nano-Metric Surface Generation},\\n  author={K. Ramesh and W. Lewis and S. Veldhuis and A. Yui},\\n  journal={},\\n  year={2005},\\n  doi={10.1081/AMP-200060407},\\n  url={https://www.semanticscholar.org/paper/8e5ce7be829df8310f1f388e3e07adf743d97f10}\\n}' apa='Ramesh, K., Lewis, W., Veldhuis, S., & Yui, A. (2005). Redefining the Diamond Cutting Edge: A Technique that Complements Nano-Metric Surface Generation. .' ieee='K. Ramesh et al., \"Redefining the Diamond Cutting Edge: A Technique that Complements Nano-Metric Surface Generation,\" , 2005.' mla='Ramesh, K., et al.. \"Redefining the Diamond Cutting Edge: A Technique that Complements Nano-Metric Surface Generation.\" , 2005.'",
  "paper_id='10_21203_rs_3_rs_3800695_v1' bibtex='@article{10_21203_rs_3_rs_3800695_v1,\\n  title={Investigating The Metric Basis And Metric Dimension Of Graphene},\\n  author={Wasim Abbas and Faryal Chaudhry and Deeba Afzal and Umar Farooq},\\n  journal={},\\n  year={2023},\\n  doi={10.21203/rs.3.rs-3800695/v1},\\n  url={https://doi.org/10.21203/rs.3.rs-3800695/v1}\\n}' apa='Abbas, W., Chaudhry, F., Afzal, D., & Farooq, U. (2023). Investigating The Metric Basis And Metric Dimension Of Graphene. .' ieee='Wasim Abbas et al., \"Investigating The Metric Basis And Metric Dimension Of Graphene,\" , 2023.' mla='Abbas, W., et al.. \"Investigating The Metric Basis And Metric Dimension Of Graphene.\" , 2023.'",
  "paper_id='10_31219_osf_io_m6rdh' bibtex='@article{10_31219_osf_io_m6rdh,\\n  title={A Physical Basis for the Symmetries in the Friedmann-Robertson-Walker Metric},\\n  author={Fulvio Melia},\\n  journal={},\\n  year={2023},\\n  doi={10.31219/osf.io/m6rdh},\\n  url={https://doi.org/10.31219/osf.io/m6rdh}\\n}' apa='Melia, F. (2023). A Physical Basis for the Symmetries in the Friedmann-Robertson-Walker Metric. .' ieee='Fulvio Melia, \"A Physical Basis for the Symmetries in the Friedmann-Robertson-Walker Metric,\" , 2023.' mla='Melia, F.. \"A Physical Basis for the Symmetries in the Friedmann-Robertson-Walker Metric.\" , 2023.'",
  "paper_id='10_1145_3679240_3734632' bibtex='@article{10_1145_3679240_3734632,\\n  title={Mix-BEATS: Mixer-enhanced Basis Expansion Analysis for Load Forecasting},\\n  author={Anuj Kumar and H. Saravanan and Shivam Dwivedi and P. Arjunan},\\n  journal={Energy-Efficient Computing and Networking},\\n  year={2025},\\n  doi={10.1145/3679240.3734632},\\n  url={https://www.semanticscholar.org/paper/65af78beb9b61bbc8e83b01f332c30425c3d3c17}\\n}' apa='Kumar, A., Saravanan, H., Dwivedi, S., & Arjunan, P. (2025). Mix-BEATS: Mixer-enhanced Basis Expansion Analysis for Load Forecasting. Energy-Efficient Computing and Networking.' ieee='Anuj Kumar et al., \"Mix-BEATS: Mixer-enhanced Basis Expansion Analysis for Load Forecasting,\" Energy-Efficient Computing and Networking, 2025.' mla='Kumar, A., et al.. \"Mix-BEATS: Mixer-enhanced Basis Expansion Analysis for Load Forecasting.\" Energy-Efficient Computing and Networking, 2025.'",
  "paper_id='10_13189_ms_2025_130302' bibtex='@article{10_13189_ms_2025_130302,\\n  title={Edge Metric and Edge Metric Topology on Graph},\\n  author={Roy John and Athira Chandran and G. Suresh Singh},\\n  journal={Mathematics and Statistics},\\n  year={2025},\\n  doi={10.13189/ms.2025.130302},\\n  url={https://doi.org/10.13189/ms.2025.130302}\\n}' apa='John, R., Chandran, A., & Singh, G. S. (2025). Edge Metric and Edge Metric Topology on Graph. Mathematics and Statistics.' ieee='Roy John, Athira Chandran, G. Suresh Singh, \"Edge Metric and Edge Metric Topology on Graph,\" Mathematics and Statistics, 2025.' mla='John, R., et al.. \"Edge Metric and Edge Metric Topology on Graph.\" Mathematics and Statistics, 2025.'",
  "paper_id='10_1038_s41598_025_24939_z' bibtex='@article{10_1038_s41598_025_24939_z,\\n  title={Metric, edge-metric, mixed-metric, and fault-tolerant metric dimensions of geometric networks with potential applications},\\n  author={Sakander Hayat and Rishi Naeem and Hafiz Muhammad Afzal Siddiqui and Amina Riaz and Muhammad Imran and Melaku Berhe Belay and Zeineb Klai},\\n  journal={Scientific Reports},\\n  year={2025},\\n  doi={10.1038/s41598-025-24939-z},\\n  url={https://doi.org/10.1038/s41598-025-24939-z}\\n}' apa='Hayat, S., Naeem, R., Siddiqui, H. M. A., Riaz, A., Imran, M., Belay, M. B., & Klai, Z. (2025). Metric, edge-metric, mixed-metric, and fault-tolerant metric dimensions of geometric networks with potential applications. Scientific Reports.' ieee='Sakander Hayat et al., \"Metric, edge-metric, mixed-metric, and fault-tolerant metric dimensions of geometric networks with potential applications,\" Scientific Reports, 2025.' mla='Hayat, S., et al.. \"Metric, edge-metric, mixed-metric, and fault-tolerant metric dimensions of geometric networks with potential applications.\" Scientific Reports, 2025.'",
  "paper_id='10_3390_sym10080300' bibtex='@article{10_3390_sym10080300,\\n  title={Computing Metric Dimension and Metric Basis of 2D Lattice of Alpha-Boron Nanotubes},\\n  author={Zafar Hussain and Mobeen Munir and Maqbool Chaudhary and Shin Min Kang},\\n  journal={Symmetry},\\n  year={2018},\\n  doi={10.3390/sym10080300},\\n  url={https://doi.org/10.3390/sym10080300}\\n}' apa='Hussain, Z., Munir, M., Chaudhary, M., & Kang, S. M. (2018). Computing Metric Dimension and Metric Basis of 2D Lattice of Alpha-Boron Nanotubes. Symmetry.' ieee='Zafar Hussain et al., \"Computing Metric Dimension and Metric Basis of 2D Lattice of Alpha-Boron Nanotubes,\" Symmetry, 2018.' mla='Hussain, Z., et al.. \"Computing Metric Dimension and Metric Basis of 2D Lattice of Alpha-Boron Nanotubes.\" Symmetry, 2018.'",
  "paper_id='10_1038_s41598_020_76516_1' bibtex='@article{10_1038_s41598_020_76516_1,\\n  title={Metric basis and metric dimension of 1-pentagonal carbon nanocone networks},\\n  author={Zafar Hussain and Mobeen Munir and Ashfaq Ahmad and Maqbool Chaudhary and Junaid Alam Khan and Imtiaz Ahmed},\\n  journal={Scientific Reports},\\n  year={2020},\\n  doi={10.1038/s41598-020-76516-1},\\n  url={https://doi.org/10.1038/s41598-020-76516-1}\\n}' apa='Hussain, Z., Munir, M., Ahmad, A., Chaudhary, M., Khan, J. A., & Ahmed, I. (2020). Metric basis and metric dimension of 1-pentagonal carbon nanocone networks. Scientific Reports.' ieee='Zafar Hussain et al., \"Metric basis and metric dimension of 1-pentagonal carbon nanocone networks,\" Scientific Reports, 2020.' mla='Hussain, Z., et al.. \"Metric basis and metric dimension of 1-pentagonal carbon nanocone networks.\" Scientific Reports, 2020.'",
  "paper_id='10_1142_s1793830920500706' bibtex='@article{10_1142_s1793830920500706,\\n  title={Computing edge version of metric and double metric dimensions of Kayak paddle graphs},\\n  author={Muhammad Ahmad and Naeem Ameen and Zohaib Zahid and Sohail Zafar},\\n  journal={Discrete Mathematics, Algorithms and Applications},\\n  year={2020},\\n  doi={10.1142/s1793830920500706},\\n  url={https://doi.org/10.1142/s1793830920500706}\\n}' apa='Ahmad, M., Ameen, N., Zahid, Z., & Zafar, S. (2020). Computing edge version of metric and double metric dimensions of Kayak paddle graphs. Discrete Mathematics, Algorithms and Applications.' ieee='Muhammad Ahmad et al., \"Computing edge version of metric and double metric dimensions of Kayak paddle graphs,\" Discrete Mathematics, Algorithms and Applications, 2020.' mla='Ahmad, M., et al.. \"Computing edge version of metric and double metric dimensions of Kayak paddle graphs.\" Discrete Mathematics, Algorithms and Applications, 2020.'",
  "paper_id='10_14311_cej_2018_01_0005' bibtex='@article{10_14311_cej_2018_01_0005,\\n  title={METRIC SURVEY DOCUMENTATION AS A BASIS FOR UNDERSTANDING THE DEVELOPMENT OF RURAL ARCHITECTURE},\\n  author={Zdeněk Poloprutský},\\n  journal={Stavební obzor - Civil Engineering Journal},\\n  year={2018},\\n  doi={10.14311/cej.2018.01.0005},\\n  url={https://doi.org/10.14311/cej.2018.01.0005}\\n}' apa='Poloprutský, Z. (2018). METRIC SURVEY DOCUMENTATION AS A BASIS FOR UNDERSTANDING THE DEVELOPMENT OF RURAL ARCHITECTURE. Stavební obzor - Civil Engineering Journal.' ieee='Zdeněk Poloprutský, \"METRIC SURVEY DOCUMENTATION AS A BASIS FOR UNDERSTANDING THE DEVELOPMENT OF RURAL ARCHITECTURE,\" Stavební obzor - Civil Engineering Journal, 2018.' mla='Poloprutský, Z.. \"METRIC SURVEY DOCUMENTATION AS A BASIS FOR UNDERSTANDING THE DEVELOPMENT OF RURAL ARCHITECTURE.\" Stavební obzor - Civil Engineering Journal, 2018.'",
  "paper_id='10_1080_10406638_2022_2086269' bibtex='@article{10_1080_10406638_2022_2086269,\\n  title={Computing Basis and Dimension of Chloroquine and Hydroxychloroquine by Using Chemical Graph Theory},\\n  author={Yogesh Singh and H. Raza and S. Sharma and V. K. Bhat},\\n  journal={Polycyclic aromatic compounds (Print)},\\n  year={2022},\\n  doi={10.1080/10406638.2022.2086269},\\n  url={https://www.semanticscholar.org/paper/7ae5be424b85590e86ba41737e1af388740e457b}\\n}' apa='Singh, Y., Raza, H., Sharma, S., & Bhat, V. K. (2022). Computing Basis and Dimension of Chloroquine and Hydroxychloroquine by Using Chemical Graph Theory. Polycyclic aromatic compounds (Print).' ieee='Yogesh Singh et al., \"Computing Basis and Dimension of Chloroquine and Hydroxychloroquine by Using Chemical Graph Theory,\" Polycyclic aromatic compounds (Print), 2022.' mla='Singh, Y., et al.. \"Computing Basis and Dimension of Chloroquine and Hydroxychloroquine by Using Chemical Graph Theory.\" Polycyclic aromatic compounds (Print), 2022.'",
  "paper_id='10_2139_ssrn_4769772' bibtex='@article{10_2139_ssrn_4769772,\\n  title={Strong Edge Metric Dimension of Graphs},\\n  author={Mojgan Afkhami},\\n  journal={},\\n  year={2023},\\n  doi={10.2139/ssrn.4769772},\\n  url={https://doi.org/10.2139/ssrn.4769772}\\n}' apa='Afkhami, M. (2023). Strong Edge Metric Dimension of Graphs. .' ieee='Mojgan Afkhami, \"Strong Edge Metric Dimension of Graphs,\" , 2023.' mla='Afkhami, M.. \"Strong Edge Metric Dimension of Graphs.\" , 2023.'",
  "paper_id='10_2139_ssrn_4953611' bibtex='@article{10_2139_ssrn_4953611,\\n  title={\\u200eFractional $K$-Clique Metric Dimension of (Edge) Corona Products of Graphs},\\n  author={Zeinab Shahmiri and Darko Dimitrov and Mostafa Tavakoli},\\n  journal={},\\n  year={2023},\\n  doi={10.2139/ssrn.4953611},\\n  url={https://doi.org/10.2139/ssrn.4953611}\\n}' apa='Shahmiri, Z., Dimitrov, D., & Tavakoli, M. (2023). \\u200eFractional $K$-Clique Metric Dimension of (Edge) Corona Products of Graphs. .' ieee='Zeinab Shahmiri, Darko Dimitrov, Mostafa Tavakoli, \"\\u200eFractional $K$-Clique Metric Dimension of (Edge) Corona Products of Graphs,\" , 2023.' mla='Shahmiri, Z., et al.. \"\\u200eFractional $K$-Clique Metric Dimension of (Edge) Corona Products of Graphs.\" , 2023.'",
  "paper_id='10_1109_icip_2002_1038901' bibtex='@inproceedings{10_1109_icip_2002_1038901,\\n  title={No-reference sharpness metric based on local edge kurtosis},\\n  author={J. Caviedes and S. Gurbuz},\\n  booktitle={Proceedings. International Conference on Image Processing},\\n  year={2023},\\n  doi={10.1109/icip.2002.1038901},\\n  url={https://doi.org/10.1109/icip.2002.1038901}\\n}' apa='Caviedes, J. & Gurbuz, S. (2023). No-reference sharpness metric based on local edge kurtosis. In Proceedings. International Conference on Image Processing.' ieee='J. Caviedes, S. Gurbuz, \"No-reference sharpness metric based on local edge kurtosis,\" in Proceedings. International Conference on Image Processing, 2023.' mla='Caviedes, J., and S. Gurbuz. \"No-reference sharpness metric based on local edge kurtosis.\" Proceedings. International Conference on Image Processing, 2023.'",
  "paper_id='10_2172_1995426' bibtex='@article{10_2172_1995426,\\n  title={Physics Basis, Optimization, and Control for Integrated 3D Edge Long-pulse Tokamak Scenarios},\\n  author={Zhihong Lin},\\n  journal={},\\n  year={2023},\\n  doi={10.2172/1995426},\\n  url={https://doi.org/10.2172/1995426}\\n}' apa='Lin, Z. (2023). Physics Basis, Optimization, and Control for Integrated 3D Edge Long-pulse Tokamak Scenarios. .' ieee='Zhihong Lin, \"Physics Basis, Optimization, and Control for Integrated 3D Edge Long-pulse Tokamak Scenarios,\" , 2023.' mla='Lin, Z.. \"Physics Basis, Optimization, and Control for Integrated 3D Edge Long-pulse Tokamak Scenarios.\" , 2023.'",
  "paper_id='saha_metric_dimension_vulnerability_2022' bibtex='@article{saha_metric_dimension_vulnerability_2022,\\n  title={METRIC DIMENSION VULNERABILITY IN TREES UNDER EDGE CONTRACTION},\\n  author={L. Saha and Rupen Lama and Kalishankar Tiwary},\\n  journal={},\\n  year={2022},\\n  url={https://www.semanticscholar.org/paper/b04f4e1aab96fbecb99747a3af8c9fdb06e55a3e}\\n}' apa='Saha, L., Lama, R., & Tiwary, K. (2022). METRIC DIMENSION VULNERABILITY IN TREES UNDER EDGE CONTRACTION. .' ieee='L. Saha, Rupen Lama, Kalishankar Tiwary, \"METRIC DIMENSION VULNERABILITY IN TREES UNDER EDGE CONTRACTION,\" , 2022.' mla='Saha, L., et al.. \"METRIC DIMENSION VULNERABILITY IN TREES UNDER EDGE CONTRACTION.\" , 2022.'",
  "paper_id='10_1007_s10878_021_00838_7' bibtex='@article{10_1007_s10878_021_00838_7,\\n  title={The effect of vertex and edge deletion on the edge metric dimension of graphs},\\n  author={Meiqin Wei and Jun Yue and Lily Chen},\\n  journal={Journal of Combinatorial Optimization},\\n  year={2022},\\n  doi={10.1007/s10878-021-00838-7},\\n  url={https://doi.org/10.1007/s10878-021-00838-7}\\n}' apa='Wei, M., Yue, J., & Chen, L. (2022). The effect of vertex and edge deletion on the edge metric dimension of graphs. Journal of Combinatorial Optimization.' ieee='Meiqin Wei, Jun Yue, Lily Chen, \"The effect of vertex and edge deletion on the edge metric dimension of graphs,\" Journal of Combinatorial Optimization, 2022.' mla='Wei, M., et al.. \"The effect of vertex and edge deletion on the edge metric dimension of graphs.\" Journal of Combinatorial Optimization, 2022.'",
  "paper_id='10_1285_I15900932V40N2P99' bibtex='@article{10_1285_I15900932V40N2P99,\\n  title={On the edge metric dimension and Wiener index of the blow up of graphs},\\n  author={M. Afkhami},\\n  journal={},\\n  year={2021},\\n  doi={10.1285/I15900932V40N2P99},\\n  url={https://www.semanticscholar.org/paper/5c03119dc8dd3d507e4ab9e543600d39c6c1441e}\\n}' apa='Afkhami, M. (2021). On the edge metric dimension and Wiener index of the blow up of graphs. .' ieee='M. Afkhami, \"On the edge metric dimension and Wiener index of the blow up of graphs,\" , 2021.' mla='Afkhami, M.. \"On the edge metric dimension and Wiener index of the blow up of graphs.\" , 2021.'",
  "paper_id='10_3934_math_2021531' bibtex='@article{10_3934_math_2021531,\\n  title={Metric dimension and edge metric dimension of windmill graphs},\\n  author={Pradeep Singh and Sahil Sharma and Sunny Kumar Sharma and Vijay Kumar Bhat},\\n  journal={AIMS Mathematics},\\n  year={2021},\\n  doi={10.3934/math.2021531},\\n  url={https://doi.org/10.3934/math.2021531}\\n}' apa='Singh, P., Sharma, S., Sharma, S. K., & Bhat, V. K. (2021). Metric dimension and edge metric dimension of windmill graphs. AIMS Mathematics.' ieee='Pradeep Singh et al., \"Metric dimension and edge metric dimension of windmill graphs,\" AIMS Mathematics, 2021.' mla='Singh, P., et al.. \"Metric dimension and edge metric dimension of windmill graphs.\" AIMS Mathematics, 2021.'",
  "paper_id='10_1002_jsid_132' bibtex='@article{10_1002_jsid_132,\\n  title={A perceived sharpness metric based on the luminance slope and overshoot of the motion‐induced edge‐blur profile},\\n  author={Yuan Cui and Wen Song and Xiaohua Li},\\n  journal={},\\n  year={2012},\\n  doi={10.1002/jsid.132},\\n  url={https://www.semanticscholar.org/paper/e6179220929e24425b670bf9d5889afe3a0c5545}\\n}' apa='Cui, Y., Song, W., & Li, X. (2012). A perceived sharpness metric based on the luminance slope and overshoot of the motion‐induced edge‐blur profile. .' ieee='Yuan Cui, Wen Song, Xiaohua Li, \"A perceived sharpness metric based on the luminance slope and overshoot of the motion‐induced edge‐blur profile,\" , 2012.' mla='Cui, Y., et al.. \"A perceived sharpness metric based on the luminance slope and overshoot of the motion‐induced edge‐blur profile.\" , 2012.'",
  "paper_id='メンディラッタヴィーナ_method_and_apparatus_2012' bibtex='@article{メンディラッタヴィーナ_method_and_apparatus_2012,\\n  title={Method and apparatus for deriving the edge composite ties metric between nodes of a telecommunications call graph},\\n  author={ビー． メンディラッタ，ヴィーナ and ドラン，デレク and ファク，シトラ and ウズナイオグリュー，フセイン and クシュニール，ダン},\\n  journal={},\\n  year={2012},\\n  url={https://www.semanticscholar.org/paper/6cff34c555d1465ebeb9bbb25ad4269c01865925}\\n}' apa='メンディラッタ，ヴィーナ, ビ., ドラン，デレク, ファク，シトラ, ウズナイオグリュー，フセイン, & クシュニール，ダン (2012). Method and apparatus for deriving the edge composite ties metric between nodes of a telecommunications call graph. .' ieee='ビー． メンディラッタ，ヴィーナ et al., \"Method and apparatus for deriving the edge composite ties metric between nodes of a telecommunications call graph,\" , 2012.' mla='メンディラッタ，ヴィーナ, ビ., et al.. \"Method and apparatus for deriving the edge composite ties metric between nodes of a telecommunications call graph.\" , 2012.'",
  "paper_id='10_1007_978_0_387_69200_5_4' bibtex=\"@article{10_1007_978_0_387_69200_5_4,\\n  title={Basis Vector Fields and the Metric Tensor},\\n  author={},\\n  journal={Einstein's General Theory of Relativity},\\n  year={2007},\\n  doi={10.1007/978-0-387-69200-5_4},\\n  url={https://doi.org/10.1007/978-0-387-69200-5_4}\\n}\" apa=\"Unknown Author (2007). Basis Vector Fields and the Metric Tensor. Einstein's General Theory of Relativity.\" ieee='Unknown Author, \"Basis Vector Fields and the Metric Tensor,\" Einstein\\'s General Theory of Relativity, 2007.' mla='Unknown Author. \"Basis Vector Fields and the Metric Tensor.\" Einstein\\'s General Theory of Relativity, 2007.'",
  "paper_id='10_1117_12_130263' bibtex='@article{10_1117_12_130263,\\n  title={Adaptable edge quality metric},\\n  author={Robin N. Strickland},\\n  journal={Optical Engineering},\\n  year={1993},\\n  doi={10.1117/12.130263},\\n  url={https://doi.org/10.1117/12.130263}\\n}' apa='Strickland, R. N. (1993). Adaptable edge quality metric. Optical Engineering.' ieee='Robin N. Strickland, \"Adaptable edge quality metric,\" Optical Engineering, 1993.' mla='Strickland, R. N.. \"Adaptable edge quality metric.\" Optical Engineering, 1993.'",
  "paper_id='10_1117_2_1200910_1829' bibtex='@article{10_1117_2_1200910_1829,\\n  title={New metric describes edge noise in bilevel images},\\n  author={Elisa Barney Smith},\\n  journal={SPIE Newsroom},\\n  year={2009},\\n  doi={10.1117/2.1200910.1829},\\n  url={https://doi.org/10.1117/2.1200910.1829}\\n}' apa='Smith, E. B. (2009). New metric describes edge noise in bilevel images. SPIE Newsroom.' ieee='Elisa Barney Smith, \"New metric describes edge noise in bilevel images,\" SPIE Newsroom, 2009.' mla='Smith, E. B.. \"New metric describes edge noise in bilevel images.\" SPIE Newsroom, 2009.'",
  "paper_id='10_9790_03752431' bibtex='@article{10_9790_03752431,\\n  title={Improvised Canny Edge Detector &amp; Performance Metric of Edge Detector Using WPR (White Pixel Ratio)},\\n  author={Naveen Singh Dagar},\\n  journal={IOSR Journal of Engineering},\\n  year={2013},\\n  doi={10.9790/03752431},\\n  url={https://doi.org/10.9790/03752431}\\n}' apa='Dagar, N. S. (2013). Improvised Canny Edge Detector &amp; Performance Metric of Edge Detector Using WPR (White Pixel Ratio). IOSR Journal of Engineering.' ieee='Naveen Singh Dagar, \"Improvised Canny Edge Detector &amp; Performance Metric of Edge Detector Using WPR (White Pixel Ratio),\" IOSR Journal of Engineering, 2013.' mla='Dagar, N. S.. \"Improvised Canny Edge Detector &amp; Performance Metric of Edge Detector Using WPR (White Pixel Ratio).\" IOSR Journal of Engineering, 2013.'",
  "paper_id='10_1117_1_601060' bibtex='@article{10_1117_1_601060,\\n  title={Edge\\u2009quality\\u2009metric\\u2009for\\u2009arbitrary\\u2009two‐dimensional\\u2009edges},\\n  author={Paul V. Khvorostov},\\n  journal={Optical Engineering},\\n  year={1996},\\n  doi={10.1117/1.601060},\\n  url={https://doi.org/10.1117/1.601060}\\n}' apa='Khvorostov, P. V. (1996). Edge\\u2009quality\\u2009metric\\u2009for\\u2009arbitrary\\u2009two‐dimensional\\u2009edges. Optical Engineering.' ieee='Paul V. Khvorostov, \"Edge\\u2009quality\\u2009metric\\u2009for\\u2009arbitrary\\u2009two‐dimensional\\u2009edges,\" Optical Engineering, 1996.' mla='Khvorostov, P. V.. \"Edge\\u2009quality\\u2009metric\\u2009for\\u2009arbitrary\\u2009two‐dimensional\\u2009edges.\" Optical Engineering, 1996.'",
  "paper_id='10_1017_cbo9780511571770_009' bibtex='@article{10_1017_cbo9780511571770_009,\\n  title={The money-metric as a basis for calculation of social welfare functions},\\n  author={},\\n  journal={Measuring Economic Welfare},\\n  year={1983},\\n  doi={10.1017/cbo9780511571770.009},\\n  url={https://doi.org/10.1017/cbo9780511571770.009}\\n}' apa='Unknown Author (1983). The money-metric as a basis for calculation of social welfare functions. Measuring Economic Welfare.' ieee='Unknown Author, \"The money-metric as a basis for calculation of social welfare functions,\" Measuring Economic Welfare, 1983.' mla='Unknown Author. \"The money-metric as a basis for calculation of social welfare functions.\" Measuring Economic Welfare, 1983.'",
  "paper_id='10_5220_0002821700910097' bibtex='@inproceedings{10_5220_0002821700910097,\\n  title={A NOVEL PERFORMANCE METRIC FOR GREY-SCALE EDGE DETECTION},\\n  author={},\\n  booktitle={Proceedings of the International Conference on Computer Vision Theory and Applications},\\n  year={2010},\\n  doi={10.5220/0002821700910097},\\n  url={https://doi.org/10.5220/0002821700910097}\\n}' apa='Unknown Author (2010). A NOVEL PERFORMANCE METRIC FOR GREY-SCALE EDGE DETECTION. In Proceedings of the International Conference on Computer Vision Theory and Applications.' ieee='Unknown Author, \"A NOVEL PERFORMANCE METRIC FOR GREY-SCALE EDGE DETECTION,\" in Proceedings of the International Conference on Computer Vision Theory and Applications, 2010.' mla='Unknown Author. \"A NOVEL PERFORMANCE METRIC FOR GREY-SCALE EDGE DETECTION.\" Proceedings of the International Conference on Computer Vision Theory and Applications, 2010.'",
  "paper_id='10_1109_icip_2010_5653763' bibtex='@inproceedings{10_1109_icip_2010_5653763,\\n  title={Metric tensor for multicomponent edge detection},\\n  author={Sylvain Rousseau and David Helbert and Philippe Carre and Jacques Blanc-Talon},\\n  booktitle={2010 IEEE International Conference on Image Processing},\\n  year={2010},\\n  doi={10.1109/icip.2010.5653763},\\n  url={https://doi.org/10.1109/icip.2010.5653763}\\n}' apa='Rousseau, S., Helbert, D., Carre, P., & Blanc-Talon, J. (2010). Metric tensor for multicomponent edge detection. In 2010 IEEE International Conference on Image Processing.' ieee='Sylvain Rousseau et al., \"Metric tensor for multicomponent edge detection,\" in 2010 IEEE International Conference on Image Processing, 2010.' mla='Rousseau, S., et al.. \"Metric tensor for multicomponent edge detection.\" 2010 IEEE International Conference on Image Processing, 2010.'",
  "paper_id='10_1109_icip_2011_6116379' bibtex='@inproceedings{10_1109_icip_2011_6116379,\\n  title={An image quality assessment metric based on Non-shift Edge},\\n  author={Wufeng Xue and Xuanqin Mou},\\n  booktitle={2011 18th IEEE International Conference on Image Processing},\\n  year={2011},\\n  doi={10.1109/icip.2011.6116379},\\n  url={https://doi.org/10.1109/icip.2011.6116379}\\n}' apa='Xue, W. & Mou, X. (2011). An image quality assessment metric based on Non-shift Edge. In 2011 18th IEEE International Conference on Image Processing.' ieee='Wufeng Xue, Xuanqin Mou, \"An image quality assessment metric based on Non-shift Edge,\" in 2011 18th IEEE International Conference on Image Processing, 2011.' mla='Xue, W., and Xuanqin Mou. \"An image quality assessment metric based on Non-shift Edge.\" 2011 18th IEEE International Conference on Image Processing, 2011.'",
  "paper_id='10_1007_s00357_007_0011_0' bibtex='@article{10_1007_s00357_007_0011_0,\\n  title={The Metric Bridge Partition Problem: Partitioning of a Metric Space into Two Subspaces Linked by an Edge in Any Optimal Realization},\\n  author={Alain Hertz and Sacha Varone},\\n  journal={Journal of Classification},\\n  year={2007},\\n  doi={10.1007/s00357-007-0011-0},\\n  url={https://doi.org/10.1007/s00357-007-0011-0}\\n}' apa='Hertz, A. & Varone, S. (2007). The Metric Bridge Partition Problem: Partitioning of a Metric Space into Two Subspaces Linked by an Edge in Any Optimal Realization. Journal of Classification.' ieee='Alain Hertz, Sacha Varone, \"The Metric Bridge Partition Problem: Partitioning of a Metric Space into Two Subspaces Linked by an Edge in Any Optimal Realization,\" Journal of Classification, 2007.' mla='Hertz, A., and Sacha Varone. \"The Metric Bridge Partition Problem: Partitioning of a Metric Space into Two Subspaces Linked by an Edge in Any Optimal Realization.\" Journal of Classification, 2007.'",
  "paper_id='10_54729_2789_8547_1036' bibtex='@article{10_54729_2789_8547_1036,\\n  title={PARA(NOIA)METRIC: ARCHITECTURE BEYOND THE EDGE OF RATIONALITY},\\n  author={Marwan Halabi},\\n  journal={Architecture and Planning Journal (APJ)},\\n  year={2020},\\n  doi={10.54729/2789-8547.1036},\\n  url={https://doi.org/10.54729/2789-8547.1036}\\n}' apa='Halabi, M. (2020). PARA(NOIA)METRIC: ARCHITECTURE BEYOND THE EDGE OF RATIONALITY. Architecture and Planning Journal (APJ).' ieee='Marwan Halabi, \"PARA(NOIA)METRIC: ARCHITECTURE BEYOND THE EDGE OF RATIONALITY,\" Architecture and Planning Journal (APJ), 2020.' mla='Halabi, M.. \"PARA(NOIA)METRIC: ARCHITECTURE BEYOND THE EDGE OF RATIONALITY.\" Architecture and Planning Journal (APJ), 2020.'",
  "paper_id='10_1016_j_comgeo_2009_03_008' bibtex='@article{10_1016_j_comgeo_2009_03_008,\\n  title={Computing the dilation of edge-augmented graphs in metric spaces},\\n  author={Christian Wulff-Nilsen},\\n  journal={Computational Geometry},\\n  year={2010},\\n  doi={10.1016/j.comgeo.2009.03.008},\\n  url={https://doi.org/10.1016/j.comgeo.2009.03.008}\\n}' apa='Wulff-Nilsen, C. (2010). Computing the dilation of edge-augmented graphs in metric spaces. Computational Geometry.' ieee='Christian Wulff-Nilsen, \"Computing the dilation of edge-augmented graphs in metric spaces,\" Computational Geometry, 2010.' mla='Wulff-Nilsen, C.. \"Computing the dilation of edge-augmented graphs in metric spaces.\" Computational Geometry, 2010.'",
  "paper_id='10_2140_pjm_1975_60_159' bibtex='@article{10_2140_pjm_1975_60_159,\\n  title={A metric basis characterization of Euclidean space},\\n  author={Grattan Murphy},\\n  journal={Pacific Journal of Mathematics},\\n  year={1975},\\n  doi={10.2140/pjm.1975.60.159},\\n  url={https://doi.org/10.2140/pjm.1975.60.159}\\n}' apa='Murphy, G. (1975). A metric basis characterization of Euclidean space. Pacific Journal of Mathematics.' ieee='Grattan Murphy, \"A metric basis characterization of Euclidean space,\" Pacific Journal of Mathematics, 1975.' mla='Murphy, G.. \"A metric basis characterization of Euclidean space.\" Pacific Journal of Mathematics, 1975.'",
  "paper_id='10_1109_access_2020_2990109' bibtex='@article{10_1109_access_2020_2990109,\\n  title={Barycentric Subdivision of Cayley Graphs With Constant Edge Metric Dimension},\\n  author={Ali N. A. Koam and Ali Ahmad},\\n  journal={IEEE Access},\\n  year={2020},\\n  doi={10.1109/access.2020.2990109},\\n  url={https://doi.org/10.1109/access.2020.2990109}\\n}' apa='Koam, A. N. A. & Ahmad, A. (2020). Barycentric Subdivision of Cayley Graphs With Constant Edge Metric Dimension. IEEE Access.' ieee='Ali N. A. Koam, Ali Ahmad, \"Barycentric Subdivision of Cayley Graphs With Constant Edge Metric Dimension,\" IEEE Access, 2020.' mla='Koam, A. N. A., and Ali Ahmad. \"Barycentric Subdivision of Cayley Graphs With Constant Edge Metric Dimension.\" IEEE Access, 2020.'",
  "paper_id='10_1007_s12190_024_02231_z' bibtex='@article{10_1007_s12190_024_02231_z,\\n  title={Edge resolvability of generalized honeycomb rhombic torus},\\n  author={Ayesha Andalib Kiran and Hani Shaker and S. Saputro},\\n  journal={Journal of Applied Mathematics and Computation},\\n  year={2024},\\n  doi={10.1007/s12190-024-02231-z},\\n  url={https://www.semanticscholar.org/paper/feab18d3362a5b75c9bcfd4e63b2fb37e78bf36b}\\n}' apa='Kiran, A. A., Shaker, H., & Saputro, S. (2024). Edge resolvability of generalized honeycomb rhombic torus. Journal of Applied Mathematics and Computation.' ieee='Ayesha Andalib Kiran, Hani Shaker, S. Saputro, \"Edge resolvability of generalized honeycomb rhombic torus,\" Journal of Applied Mathematics and Computation, 2024.' mla='Kiran, A. A., et al.. \"Edge resolvability of generalized honeycomb rhombic torus.\" Journal of Applied Mathematics and Computation, 2024.'",
  "paper_id='10_1201_b10166_14' bibtex='@article{10_1201_b10166_14,\\n  title={6Chapter Energy Medicine: Cutting Edge Modalities},\\n  author={},\\n  journal={The Scientific Basis of Integrative Medicine},\\n  year={2009},\\n  doi={10.1201/b10166-14},\\n  url={https://doi.org/10.1201/b10166-14}\\n}' apa='Unknown Author (2009). 6Chapter Energy Medicine: Cutting Edge Modalities. The Scientific Basis of Integrative Medicine.' ieee='Unknown Author, \"6Chapter Energy Medicine: Cutting Edge Modalities,\" The Scientific Basis of Integrative Medicine, 2009.' mla='Unknown Author. \"6Chapter Energy Medicine: Cutting Edge Modalities.\" The Scientific Basis of Integrative Medicine, 2009.'",
  "paper_id='10_1117_12_2304701_5783316325001' bibtex='@article{10_1117_12_2304701_5783316325001,\\n  title={},\\n  author={},\\n  journal={},\\n  year={2023},\\n  doi={10.1117/12.2304701.5783316325001},\\n  url={https://doi.org/10.1117/12.2304701.5783316325001}\\n}' apa='Unknown Author (2023). . .' ieee='Unknown Author, \",\" , 2023.' mla='Unknown Author. \".\" , 2023.'"
]