[
  "title='The Wiener index of vertex colorings' authors=['Viktoriya Bardenova', 'Neal Bushaw', 'Brent Cody', 'Paul Fay', 'Maya Tennant'] year=2025 venue='arXiv' doi=None arxiv_id='2503.18920' abstract='The Wiener index of a vertex coloring of a graph is defined to be the sum of all pairwise geodesic distances between vertices of the same color. We provide characterizations of vertex colorings of paths and cycles whose Wiener index is as large as possible over various natural collections. Along the way we establish a connection between the majorization order on tuples of integers and the Wiener index of vertex colorings on paths and cycles.' url='http://arxiv.org/abs/2503.18920v3' relevance_score=0.9 impact_score=0.0",
  "title='Peripheral hyper-Wiener index of a graph' authors=['Andry N. Rabenantoandro'] year=2025 venue='arXiv' doi=None arxiv_id='2512.13468' abstract='In this note, we introduce a new topological index of a graph G that we term peripheral hyper-Wiener index, denoted PWW(G). It is a natural extension of the peripheral Wiener index PW(G) initiated in [NB17] and is to the peripheral Wiener index what the hyper-Wiener index is to the Wiener index. We investigate its basic properties. We compute the peripheral hyper-Wiener index of the cartesian product and trees. In particular, we get an explicit formula for the case of the hypercubes. We also give lower and upper bounds on PW(G) and PWW(G) in terms of the order, size, diameter and the number of peripheral vertices. This paper is an echo to [NB17], most of the results we get are analogues of the ones therein.' url='http://arxiv.org/abs/2512.13468v1' relevance_score=0.9 impact_score=0.0",
  "title='Graphs with a given conditional diameter that maximize the Wiener index' authors=['Junfeng An', 'Yingzhi Tian'] year=2024 venue='arXiv' doi=None arxiv_id='2402.15778' abstract='The Wiener index $W(G)$ of a graph $G$ is one of the most well-known topological indices, which is defined as the sum of distances between all pairs of vertices of $G$. The diameter $D(G)$ of $G$ is the maximum distance between all pairs of vertices of $G$; the conditional diameter $D(G;s)$ is the maximum distance between all pairs of vertex subsets with cardinality $s$ of $G$. When $s=1$, the conditional diameter $D(G;s)$ is just the diameter $D(G)$. The authors in \\\\cite{QS} characterized the graphs with the maximum Wiener index among all graphs with diameter $D(G)=n-c$, where $1\\\\le c\\\\le 4$. In this paper, we will characterize the graphs with the maximum Wiener index among all graphs with conditional diameter $D(G;s)=n-2s-c$ ( $-1\\\\leq c\\\\leq 1$), which extends partial results in \\\\cite{QS}.' url='http://arxiv.org/abs/2402.15778v2' relevance_score=0.88 impact_score=0.0",
  "title='Selected topics on Wiener index' authors=['Martin Knor', 'Riste Škrekovski', 'Aleksandra Tepeh'] year=2023 venue='arXiv' doi=None arxiv_id='2303.11405' abstract='The Wiener index is defined as the sum of distances between all unordered pairs of vertices in a graph. It is one of the most recognized and well-researched topological indices, which is on the other hand still a very active area of research. This work presents a natural continuation of the paper Mathematical aspects of Wiener index (Ars Math. Contemp., 2016) in which several interesting open questions on the topic were outlined. Here we collect answers gathered so far, give further insights on the topic of extremal values of Wiener index in different settings, and present further intriguing problems and conjectures.' url='http://arxiv.org/abs/2303.11405v1' relevance_score=0.8600000000000001 impact_score=0.0",
  "title='The maximum Wiener index of a uniform hypergraph' authors=['Stijn Cambie', 'Ervin Győri', 'Nika Salia', 'Casey Tompkins', 'James Tuite'] year=2023 venue='arXiv' doi=None arxiv_id='2302.08686' abstract='The Wiener index of a (hyper)graph is calculated by summing up the distances between all pairs of vertices. We determine the maximum possible Wiener index of a connected $n$-vertex $k$-uniform hypergraph and characterize for every~$n$ all hypergraphs attaining the maximum Wiener index.' url='http://arxiv.org/abs/2302.08686v1' relevance_score=0.8600000000000001 impact_score=0.0",
  "title='Geometric Spanning Trees Minimizing the Wiener Index' authors=['A. Karim Abu-Affash', 'Paz Carmi', 'Ori Luwisch', 'Joseph S. B. Mitchell'] year=2023 venue='arXiv' doi=None arxiv_id='2303.01096' abstract='The Wiener index of a network, introduced by the chemist Harry Wiener, is the sum of distances between all pairs of nodes in the network. This index, originally used in chemical graph representations of the non-hydrogen atoms of a molecule, is considered to be a fundamental and useful network descriptor. We study the problem of constructing geometric networks on point sets in Euclidean space that minimize the Wiener index: given a set $P$ of $n$ points in $\\\\mathbb{R}^d$, the goal is to construct a network, spanning $P$ and satisfying certain constraints, that minimizes the Wiener index among the allowable class of spanning networks.   In this work, we focus mainly on spanning networks that are trees and we focus on problems in the plane ($d=2$). We show that any spanning tree that minimizes the Wiener index has non-crossing edges in the plane. Then, we use this fact to devise an $O(n^4)$-time algorithm that constructs a spanning tree of minimum Wiener index for points in convex position. We also prove that the problem of computing a spanning tree on $P$ whose Wiener index is at most $W$, while having total (Euclidean) weight at most $B$, is NP-hard.   Computing a tree that minimizes the Wiener index has been studied in the area of communication networks, where it is known as the optimum communication spanning tree problem.' url='http://arxiv.org/abs/2303.01096v1' relevance_score=0.8600000000000001 impact_score=0.0",
  "title='The Wiener index and the Wiener Complexity of the zero-divisor graph of a ring' authors=['David Dolžan'] year=2023 venue='arXiv' doi=None arxiv_id='2305.07405' abstract='We calculate the Wiener index of the zero-divisor graph of a finite semisimple ring. We also calculate the Wiener complexity of the zero-divisor graph of a finite simple ring and find an upper bound for the Wiener complexity in the semisimple case.' url='http://arxiv.org/abs/2305.07405v2' relevance_score=0.8600000000000001 impact_score=0.0",
  "title='On the Wiener Index of Orientations of Graphs' authors=['Peter Dankelmann'] year=2022 venue='arXiv' doi=None arxiv_id='2209.08946' abstract='The Wiener index of a strong digraph $D$ is defined as the sum of the distances between all ordered pairs of vertices. This definition has been extended to digraphs that are not necessarily strong by defining the distance from a vertex $a$ to a vertex $b$ as $0$ if there is no path from $a$ to $b$ in $D$.   Knor, uSkrekovski and Tepeh [Some remarks on Wiener index of oriented graphs. Appl.\\\\ Math.\\\\ Comput.\\\\ {\\\\bf 273}] considered orientations of graphs with maximum Wiener index. The authors conjectured that for a given tree $T$, an orientation $D$ of $T$ of maximum Wiener index always contains a vertex $v$ such that for every vertex $u$, there is either a $(u,v)$-path or a $(v,u)$-path in $D$. In this paper we disprove the conjecture.   We also show that the problem of finding an orientation of maximum Wiener index of a given graph is NP-complete, thus answering a question by Knor, uSkrekovski and Tepeh [Orientations of graphs with maximum Wiener index. Discrete Appl.\\\\ Math.\\\\ 211].   We briefly discuss the corresponding problem of finding an orientation of minimum Wiener index of a given graph, and show that the special case of deciding if a given graph on $m$ edges has an orientation of Wiener index $m$ can be solved in time quadratic in $n$.' url='http://arxiv.org/abs/2209.08946v1' relevance_score=0.8400000000000001 impact_score=0.0",
  "title='Disproof of a conjecture on the minimum Wiener index of signed trees' authors=['Songlin Guo', 'Wei Wang', 'Chuanming Wang'] year=2022 venue='arXiv' doi=None arxiv_id='2208.01984' abstract='The Wiener index of a connected graph is the sum of distances between all unordered pairs of vertices. Sam Spiro [The Wiener index of signed graphs, Appl. Math. Comput., 416(2022)126755] recently introduced the Wiener index for a signed graph and conjectured that the path $P_n$ with alternating signs has the minimum Wiener index among all signed trees with $n$ vertices. By constructing an infinite family of counterexamples, we prove that the conjecture is false whenever $n$ is at least 30.' url='http://arxiv.org/abs/2208.01984v1' relevance_score=0.8400000000000001 impact_score=0.0",
  "title='On maximum Wiener index of directed grids' authors=['Martin Knor', 'Riste Skrekovski'] year=2022 venue='arXiv' doi=None arxiv_id='2201.11958' abstract='This paper is devoted to Wiener index of directed graphs, more precisely of directed grids. The grid $G_{m,n}$ is the Cartesian product $P_m\\\\Box P_n$ of paths on $m$ and $n$ vertices, and in a particular case when $m=2$, it is a called the ladder graph $L_n$. Kraner Šumenjak et al. proved that the maximum Wiener index of a digraph, which is obtained by orienting the edges of $L_n$, is obtained when all layers isomorphic to one factor are directed paths directed in the same way except one (corresponding to an endvertex of the other factor) which is a directed path directed in the opposite way. Then they conjectured that the natural generalization of this orientation to $G_{m,n}$ will attain the maximum Wiener index among all orientations of $G_{m,n}$. In this paper we disprove the conjecture by showing that a comb-like orientation of $G_{m,n}$ has significiantly bigger Wiener index.' url='http://arxiv.org/abs/2201.11958v1' relevance_score=0.8400000000000001 impact_score=0.0",
  "title='Wiener index of the Cozero-divisor graph of a finite commutative ring' authors=['Barkha Baloda', 'Praveen Mathil', 'Jitender Kumar', 'Aryan Barapatre'] year=2022 venue='arXiv' doi=None arxiv_id='2210.01570' abstract=\"Let $R$ be a ring with unity. The cozero-divisor graph of a ring $R$, denoted by $Γ'(R)$, is an undirected simple graph whose vertices are the set of all non-zero and non-unit elements of $R$, and two distinct vertices $x$ and $y$ are adjacent if and only if $x \\\\notin Ry$ and $y \\\\notin Rx$. In this article, we extend some of the results of [24] to an arbitrary ring. In this connection, we derive a closed-form formula of the Wiener index of the cozero-divisor graph of a finite commutative ring $R$. As applications, we compute the Wiener index of $Γ'(R)$, when either $R$ is the product of ring of integers modulo $n$ or a reduced ring. At the final part of this paper, we provide a SageMath code to compute the Wiener index of the cozero-divisor graph of these class of rings including the ring $\\\\mathbb{Z}_{n}$ of integers modulo $n$.\" url='http://arxiv.org/abs/2210.01570v1' relevance_score=0.8400000000000001 impact_score=0.0",
  "title='Equiseparability on Terminal Wiener Index and Distances' authors=['Sulphikar A'] year=2021 venue='arXiv' doi=None arxiv_id='2111.14716' abstract='Teminal Wiener index is one of the commonly used topological index in mathematical chemistry. If two or more chemical compounds have the same terminal Wiener index then they will have similar physico-chemical properties. In this work we propose a new method for constructing equiseparable trees w.r.t terminal Wiener index. The existing method is based on the number of pendent vertices but the proposed method is based on distance parameters.' url='http://arxiv.org/abs/2111.14716v1' relevance_score=0.8200000000000001 impact_score=0.0",
  "title='Proof of a Conjecture on the Wiener Index of Eulerian Graphs' authors=['Peter Dankelmann'] year=2021 venue='arXiv' doi=None arxiv_id='2101.08342' abstract='The Wiener index of a connected graph is the sum of the distances between all unordered pairs of vertices. A connected graph is Eulerian if its vertex degrees are all even. In [Gutman, Cruz, Rada, Wiener index of Eulerian Graphs, Discrete Applied Mathematics 132 (2014), 247-250] the authors proved that the cycle is the unique graph maximising the Wiener index among all Eulerian graphs of given order. They also conjectured that for Eulerian graphs of order $n \\\\geq 26$ the graph consisting of a cycle on $n-2$ vertices and a triangle that share a vertex is the unique Eulerian graph with second largest Wiener index. The conjecture is known to hold for all $n\\\\leq 25$ with exception of six values. In this paper we prove the conjecture.' url='http://arxiv.org/abs/2101.08342v1' relevance_score=0.8200000000000001 impact_score=0.0",
  "title='Correction of a theorem in the Wiener index on fuzzy graphs' authors=['Masoud Ghods', 'Zahra Rostami'] year=2021 venue='arXiv' doi=None arxiv_id='2103.15063' abstract='In an article entitled The Counterexample of a theorem in Wiener index of a fuzzy graph and application to illegal immigration networks, we have shown a few examples of incorrect proof of a theorem in the Wiener index. Now, in this article, we will prove it by correcting the desired theorem. We have also used the same method as the author to prove it. There are other methods of proof.' url='http://arxiv.org/abs/2103.15063v1' relevance_score=0.8200000000000001 impact_score=0.0",
  "title='On the Relation Between Wiener Index and Eccentricity of a Graph' authors=['Hamid Darabi', 'Yaser Alizadeh', 'Sandi Klavžar', 'Kinkar Chandra Das'] year=2021 venue='arXiv' doi=None arxiv_id='2103.02307' abstract='The relation between the Wiener index $W(G)$ and the eccentricity $\\\\varepsilon(G)$ of a graph $G$ is studied. Lower and upper bounds on $W(G)$ in terms of $\\\\varepsilon(G)$ are proved and extremal graphs characterized. A Nordhaus-Gaddum type result on $W(G)$ involving $\\\\varepsilon(G)$ is given. A sharp upper bound on the Wiener index of a tree in terms of its eccentricity is proved. It is shown that in the class of trees of the same order, the difference $W(T) - \\\\varepsilon(T)$ is minimized on caterpillars. An exact formula for $W(T) - \\\\varepsilon(T)$ in terms of the radius of a tree $T$ is obtained. A lower bound on the eccentricity of a tree in terms of its radius is also given. Two conjectures are proposed. The first asserts that the difference $W(G) - \\\\varepsilon(G)$ does not increase after contracting an edge of $G$. The second conjecture asserts that the difference between the Wiener index of a graph and its eccentricity is largest on paths.' url='http://arxiv.org/abs/2103.02307v1' relevance_score=0.8200000000000001 impact_score=0.0",
  "title='Wiener index and Steiner 3-Wiener index of a graph' authors=['Matjaž Kovše', 'Rasila V A', 'Ambat Vijayakumar'] year=2018 venue='arXiv' doi=None arxiv_id='1809.10767' abstract='Let $S$ be a set of vertices of a connected graph $G$. The Steiner distance of $S$ is the minimum size of a connected subgraph of $G$ containing all the vertices of $S$. The sum of all Steiner distances on sets of size $k$ is called the Steiner $k$-Wiener index, hence for $k=2$ we get the Wiener index. The modular graphs are graphs in which every three vertices $x, y$ and $z$ have at least one median vertex $m(x,y,z)$ that belongs to shortest paths between each pair of $x, y$ and $z$. The Steiner 3-Wiener index of a modular graph is expressed in terms of its Wiener index. As a corollary formulae for the Steiner 3-Wiener index of Fibonacci and Lucas cubes are obtained.' url='http://arxiv.org/abs/1809.10767v1' relevance_score=0.8 impact_score=0.0",
  "title='The Edge-Wiener Index and the Edge-Hyper-Wiener Index of Phenylenes' authors=['Petra Žigert Pleteršek'] year=2017 venue='arXiv' doi=None arxiv_id='1712.06819' abstract='Besides the well known Wiener index, which sums up the distances between all the pairs of vertices, and the hyper-Wiener index, which includes also the squares of distances, the edge versions of both indices attracted a lot of attention in the recent years.   In this paper we consider the edge-Wiener index and the edge-hyper-Wiener index of phenylenes, which represent an important class of molecular graphs. For an arbitrary phenylene, four quotient trees based on the elementary cuts are defined in a similar way as it was previously done for benzenoid systems. The computation of the edge-Wiener index of the phenylene is then reduced to the calculation of the weighted Wiener indices of the corresponding quotient trees. Furthermore, a method for computing the edge-hyper-Wiener index of phenylenes is described. Finally, the application of these results gives closed formulas for the edge-Wiener index and the edge-hyper-Wiener index of linear phenylenes.' url='http://arxiv.org/abs/1712.06819v1' relevance_score=0.8 impact_score=0.0",
  "title='Generalizations of Wiener polarity index and terminal Wiener index' authors=['Aleksandar Ilic', 'Milovan Ilic'] year=2011 venue='arXiv' doi=None arxiv_id='1106.2986' abstract='In theoretical chemistry, distance-based molecular structure descriptors are used for modeling physical, pharmacologic, biological and other properties of chemical compounds. We introduce a generalized Wiener polarity index $W_k (G)$ as the number of unordered pairs of vertices ${u, v}$ of $G$ such that the shortest distance $d (u, v)$ between $u$ and $v$ is $k$ (this is actually the $k$-th coefficient in the Wiener polynomial). For $k = 3$, we get standard Wiener polarity index. Furthermore, we generalize the terminal Wiener index $TW_k (G)$ as the sum of distances between all pairs of vertices of degree $k$. For $k = 1$, we get standard terminal Wiener index. In this paper we describe a linear time algorithm for computing these indices for trees and partial cubes, and characterize extremal trees maximizing the generalized Wiener polarity index and generalized terminal Wiener index among all trees of given order $n$.' url='http://arxiv.org/abs/1106.2986v2' relevance_score=0.8 impact_score=0.0",
  "title='On the Wiener complexity and the Wiener index of fullerene graphs' authors=['Andrey A. Dobrynin', 'Andrei Yu. Vesnin'] year=2019 venue='arXiv' doi=None arxiv_id='1905.01699' abstract='Fullerenes are molecules in the form of cage-like polyhedra, consisting solely of carbon atoms. Fullerene graphs are mathematical models of fullerene molecules. The transmission of a vertex $v$ of a graph is the sum of distances from $v$ to all the other vertices. The number of different vertex transmissions is called the Wiener complexity of a graph. Some calculation results on the Wiener complexity and the Wiener index of fullerene graphs of order $n \\\\le 216$ are presented. Structure of graphs with the maximal Wiener complexity or the maximal Wiener index is discussed and formulas for the Wiener index of several families of graphs are obtained.' url='http://arxiv.org/abs/1905.01699v1' relevance_score=0.8 impact_score=0.0",
  "title='On the Two Conjectures of the Wiener Index' authors=['Ya-Lei Jin', 'Xiao-Dong Zhang'] year=2013 venue='arXiv' doi=None arxiv_id='1304.0873' abstract='The Wiener index of a graph, which is the sum of the distances between all pairs of vertices, has been well studied. Recently, Sills and Wang in 2012 proposed two conjectures on the maximal Wiener index of trees with a given degree sequence. This note proves one of the two conjectures and disproves the other.' url='http://arxiv.org/abs/1304.0873v1' relevance_score=0.8 impact_score=0.0",
  "title='Properties of the Hyper-Wiener index as a local function' authors=['Ya-Hong Chen Hua Wang', 'Xiao-Dong Zhang'] year=2017 venue='arXiv' doi=None arxiv_id='1702.05303' abstract='Hyper-Wiener index was introduced as one of the main generalizations of the well known Wiener index. Through the years properties of the Wiener index have been extensively studied in both Mathematics and Chemistry. The Hyper-Wiener index, although received much attention, is far from being thoroughly examined due to its complex definition. We consider the local version of the Hyper-Wiener index ($WW(G)$), defined as $ww_G(v)=\\\\sum\\\\limits_{u\\\\in V(G)}(d^2(u,v)+d(u,v))$ for a vertex $v$ in a graph $G$, in trees. For established results on the Wiener index ($W(.)$), we present analogous studies on $WW(.)$. In addition to interesting observations, some conjectures and questions are also proposed.' url='http://arxiv.org/abs/1702.05303v1' relevance_score=0.8 impact_score=0.0",
  "title='Wiener Index, Hyper-wiener Index, Harary Index and Hamiltonicity of graphs' authors=['Guidong Yu', 'Lifang Ren', 'Gaixiang Cai'] year=2018 venue='arXiv' doi=None arxiv_id='1804.02648' abstract='In this paper, we discuss the Hamiltonicity of graphs in terms of Wiener index, hyper-Wiener index and Harary index of their quasi-complement or complement. Firstly, we give some sufficient conditions for an balanced bipartite graph with given the minimum degree to be traceable and Hamiltonian, respectively. Secondly, we present some sufficient conditions for a nearly balanced bipartite graph with given the minimum degree to be traceable. Thirdly, we establish some conditions for a graph with given the minimum degree to be traceable and Hamiltonian, respectively. Finally, we provide some conditions for a $k$-connected graph to be Hamilton-connected and traceable for every vertex, respectively.' url='http://arxiv.org/abs/1804.02648v1' relevance_score=0.8 impact_score=0.0",
  "title='Generalized cut method for computing the edge-Wiener index' authors=['Niko Tratnik'] year=2019 venue='arXiv' doi=None arxiv_id='1902.03153' abstract='The edge-Wiener index of a connected graph $G$ is defined as the Wiener index of the line graph of $G$. In this paper it is shown that the edge-Wiener index of an edge-weighted graph can be computed in terms of the Wiener index, the edge-Wiener index, and the vertex-edge-Wiener index of weighted quotient graphs which are defined by a partition of the edge set that is coarser than $Θ^*$-partition. Thus, already known analogous methods for computing the edge-Wiener index of benzenoid systems and phenylenes are greatly generalized. Moreover, reduction theorems are developed for the edge-Wiener index and the vertex-edge-Wiener index since they can be applied in order to compute a corresponding index of a (quotient) graph from the so-called reduced graph. Finally, the obtained results are used to find the closed formula for the edge-Wiener index of an infinite family of graphs.' url='http://arxiv.org/abs/1902.03153v2' relevance_score=0.8 impact_score=0.0",
  "title='Complexity to Find Wiener Index of Some Graphs' authors=['Kalyani Das'] year=2014 venue='arXiv' doi=None arxiv_id='1409.1987' abstract='The Wiener index is one of the oldest graph parameter which is used to study molecular-graph-based structure. This parameter was first proposed by Harold Wiener in 1947 to determining the boiling point of paraffin. The Wiener index of a molecular graph measures the compactness of the underlying molecule. This parameter is wide studied area for molecular chemistry. It is used to study the physio-chemical properties of the underlying organic compounds. The Wiener index of a connected graph is denoted by W(G) and is defined as, that is W(G) is the sum of distances between all pairs (ordered) of vertices of G. In this paper, we give the algorithmic idea to find the Wiener index of some graphs, like cactus graphs and intersection graphs, viz. interval, circular-arc, permutation, trapezoid graphs.' url='http://arxiv.org/abs/1409.1987v1' relevance_score=0.8 impact_score=0.0",
  "title='The Maximum Wiener Index of Trees with Given Degree Sequences' authors=['Xiao-Dong Zhang', 'Yong Liu', 'Min-Xian Han'] year=2009 venue='arXiv' doi=None arxiv_id='0907.3772' abstract='The Wiener index of a connected graph is the sum of topological distances between all pairs of vertices. Since Wang gave a mistake result on the maximum Wiener index for given tree degree sequence, in this paper, we investigate the maximum Wiener index of trees with given degree sequences and extremal trees which attain the maximum value.' url='http://arxiv.org/abs/0907.3772v1' relevance_score=0.8 impact_score=0.0",
  "title='Wiener index and Harary index on pancyclic graphs' authors=['Huicai Jia', 'Hongye Song'] year=2019 venue='arXiv' doi=None arxiv_id='1906.06814' abstract='Wiener index and Harary index are two classic and well-known topological indices for the characterization of molecular graphs. Recently, Yu et al. \\\\cite{YYSX} established some sufficient conditions for a graph to be pancyclic in terms of the edge number, the spectral radius and the signless Laplacian spectral radius of the graph. In this paper, we give some sufficient conditions for a graph being pancyclic in terms of the Wiener index, the Harary index, the distance spectral radius and the Harary spectral radius of a graph.' url='http://arxiv.org/abs/1906.06814v1' relevance_score=0.8 impact_score=0.0",
  "title='Maximum Wiener index of unicyclic graphs with given bipartition' authors=['Jan Bok', 'Nikola Jedličková', 'Jana Maxová'] year=2019 venue='arXiv' doi=None arxiv_id='1902.10661' abstract='The \\\\emph{Wiener index} is a widely studied topological index of graphs. One of the main problems in the area is to determine which graphs of given properties attain the extremal values of Wiener index.   In this paper we resolve an open problem posed by Du in 2012. To this end we determine the unicyclic bipartite graphs with given size of parts having the maximum Wiener index. This completes the previous research in which the minimum case was solved.' url='http://arxiv.org/abs/1902.10661v3' relevance_score=0.8 impact_score=0.0",
  "title='Minimum Wiener Index of Triangulations and Quadrangulations' authors=['Éva Czabarka', 'Trevor Olsen', 'Stephen Smith', 'László A. Székely'] year=2020 venue='arXiv' doi=None arxiv_id='2003.03873' abstract='The Wiener index of a connected graph is the sum of the distances between all unordered pairs of vertices. We provide formulae for the minimum Wiener index of simple triangulations and quadrangulations with connectivity at least $c$, and provide the extremal structures, which attain those values. Our main tool is setting upper bounds for the maximum degree in highly connected triangulations and quadrangulations.' url='http://arxiv.org/abs/2003.03873v3' relevance_score=0.8 impact_score=0.0",
  "title='The Terminal Wiener Index of Trees with Diameter or Maximum Degree' authors=['Ya-Hong Chen', 'Xiao-Dong Zhang'] year=2015 venue='arXiv' doi=None arxiv_id='1510.03126' abstract='The terminal Wiener index of a tree is the sum of distances for all pairs of pendent vertices, which recently arises in the study of phylogenetic tree reconstruction and the neighborhood of trees. This paper presents a sharp upper and lower bounds for the terminal Wiener index in terms of its order and diameter and characterizes all extremal trees which attain these bounds. In addition, we investigate the properties of extremal trees which attain the maximum terminal Wiener index among all trees of order $n$ with fixed maximum degree.' url='http://arxiv.org/abs/1510.03126v1' relevance_score=0.8 impact_score=0.0",
  "title='Wiener index of graphs with fixed number of pendant or cut vertices' authors=['Dinesh Pandey', 'Kamal Lochan Patra'] year=2019 venue='arXiv' doi=None arxiv_id='1907.13481' abstract='The Wiener index of a connected graph is defined as the sum of the distances between all unordered pair of its vertices. In this paper, we characterize the graphs which extremize the Wiener index among all graphs on $n$ vertices with $k$ pendant vertices. We also characterize the graph which minimizes the Wiener index over the graphs on $n$ vertices with $s$ cut vertices.' url='http://arxiv.org/abs/1907.13481v1' relevance_score=0.8 impact_score=0.0",
  "title='Wiener index, number of subtrees, and tree eccentric sequence' authors=['Peter Dankelmann', 'Audace A. V. Dossou-Olory'] year=2020 venue='arXiv' doi=None arxiv_id='2002.07092' abstract='The eccentricity of a vertex $u$ in a connected graph $G$ is the distance between $u$ and a vertex farthest from it; the eccentric sequence of $G$ is the nondecreasing sequence of the eccentricities of $G$. In this paper, we determine the unique tree that minimises the Wiener index, i.e. the sum of distances between all unordered vertex pairs, among all trees with a given eccentric sequence. We show that the same tree maximises the number of subtrees among all trees with a given eccentric sequence, thus providing another example of negative correlation between the number of subtrees and the Wiener index of trees. Furthermore, we provide formulas for the corresponding extreme values of these two invariants in terms of the eccentric sequence. As a corollary to our results, we determine the unique tree that minimises the edge Wiener index, the vertex-edge Wiener index, the Schulz index (or degree distance), and the Gutman index among all trees with a given eccentric sequence.' url='http://arxiv.org/abs/2002.07092v1' relevance_score=0.8 impact_score=0.0",
  "title='The extremal values of the Wiener index of a tree with given degree sequence' authors=['Hua Wang'] year=2007 venue='arXiv' doi=None arxiv_id='0709.1679' abstract=\"The Wiener index of a graph is the sum of the distances between all pairs of vertices, it has been one of the main descriptors that correlate achemical compound's molecular graph with experimentally gathered data regarding the compound's characteristics. The tree that minimizes the Wiener index among trees of given maximal degree was studied. We characterize trees that achieve the maximum and minimum Wiener index, given the number of vertices and the degree sequence.\" url='http://arxiv.org/abs/0709.1679v1' relevance_score=0.8 impact_score=0.0",
  "title='On the difference between the Szeged and Wiener index' authors=['Marthe Bonamy', 'Martin Knor', 'Borut Lužar', 'Alexandre Pinlou', 'Riste Škrekovski'] year=2016 venue='arXiv' doi=None arxiv_id='1602.05184' abstract='We prove a conjecture of Nadjafi-Arani, Khodashenas and Ashrafi on the difference between the Szeged and Wiener index of a graph. Namely, if $G$ is a 2-connected non-complete graph on $n$ vertices, then $Sz(G)-W(G)\\\\ge 2n-6$. Furthermore, the equality is obtained if and only if $G$ is the complete graph $K_{n-1}$ with an extra vertex attached to either $2$ or $n-2$ vertices of $K_{n-1}$. We apply our method to strengthen some known results on the difference between the Szeged and Wiener index of bipartite graphs, graphs of girth at least five, and the difference between the revised Szeged and Wiener index. We also propose a stronger version of the aforementioned conjecture.' url='http://arxiv.org/abs/1602.05184v1' relevance_score=0.8 impact_score=0.0",
  "title='Wiener index, Harary index and Hamiltonicity of graphs' authors=['Hongbo Hua', 'Bo Ning'] year=2016 venue='arXiv' doi=None arxiv_id='1609.00114' abstract='In this paper, we prove tight sufficient conditions for traceability and Hamiltonicity of connected graphs with given minimum degree, in terms of Wiener index and Harary index. We also prove some result on Hamiltonicity of balanced bipartite graphs in the similar fashion. In two recent papers \\\\cite{LDJ2016,LDJ2017}, Liu et al. corrected some previous work on traceability of connected graphs in terms of Wiener index and Harary index, respectively, such as \\\\cite{HW2013,Y2013}. We generalize these results and give short and unified proofs. All results in this paper are best possible.' url='http://arxiv.org/abs/1609.00114v2' relevance_score=0.8 impact_score=0.0",
  "title='An upper bound on the Wiener Index of a k-connected graph' authors=['Zhongyuan Che', 'Karen L. Collins'] year=2018 venue='arXiv' doi=None arxiv_id='1811.02664' abstract='The Wiener index of a connected graph is the summation of all distances between unordered pairs of vertices of the graph. In this paper, we give an upper bound on the Wiener index of a $k$-connected graph $G$ of order $n$ for integers $n-1>k \\\\ge 1$:   \\\\[W(G) \\\\le \\\\frac{1}{4} n \\\\lfloor \\\\frac{n+k-2}{k} \\\\rfloor (2n+k-2-k\\\\lfloor \\\\frac{n+k-2}{k} \\\\rfloor).\\\\] Moreover, we show that this upper bound is sharp when $k \\\\ge 2$ is even, and can be obtained by the Wiener index of Harary graph $H_{k,n}$.' url='http://arxiv.org/abs/1811.02664v1' relevance_score=0.8 impact_score=0.0",
  "title='The Wiener Index of Unicyclic Graphs with Girth and the Matching Number' authors=['Ya-Hong Chen', 'Xiao-Dong Zhang'] year=2011 venue='arXiv' doi=None arxiv_id='1102.5409' abstract='In this paper, we investigate how the Wiener index of unicyclic graphs varies with graph operations. These results are used to present a sharp lower bound for the Wiener index of unicyclic graphs of order $n$ with girth and the matching number $β\\\\ge \\\\frac{3g}{2}$. Moreover, we characterize all extremal graphs which attain the lower bound.' url='http://arxiv.org/abs/1102.5409v1' relevance_score=0.8 impact_score=0.0",
  "title='Steiner Wiener index of block graphs' authors=['Matjaž Kovše', 'Rasila V A', 'Ambat Vijayakumar'] year=2018 venue='arXiv' doi=None arxiv_id='1805.08143' abstract='Let $S$ be a set of vertices of a connected graph $G$. The Steiner distance of $S$ is the minimum size of a connected subgraph of $G$ containing all the vertices of $S$. The Steiner $k$-Wiener index is the sum of all Steiner distances on sets of $k$ vertices of $G$. Different simple methods for calculating the Steiner $k$-Wiener index of block graphs are presented.' url='http://arxiv.org/abs/1805.08143v2' relevance_score=0.8 impact_score=0.0",
  "title='The Maximum Wiener Index of Maximal Planar Graphs' authors=['Debarun Ghosh', 'Ervin Győri', 'Addisu Paulos', 'Nika Salia', 'Oscar Zamora'] year=2019 venue='arXiv' doi=None arxiv_id='1912.02846' abstract='The Wiener index of a connected graph is the sum of the distances between all pairs of vertices in the graph. It was conjectured that the Wiener index of an $n$-vertex maximal planar graph is at most $\\\\lfloor\\\\frac{1}{18}(n^3+3n^2)\\\\rfloor$. We prove this conjecture and for every $n$, $n \\\\geq 10$, determine the unique $n$-vertex maximal planar graph for which this maximum is attained.' url='http://arxiv.org/abs/1912.02846v1' relevance_score=0.8 impact_score=0.0",
  "title='Maximizing Wiener Index for Trees with Given Vertex Weight and Degree Sequences' authors=['Mikhail Goubko'] year=2017 venue='arXiv' doi=None arxiv_id='1705.04291' abstract='The Wiener index is maximized over the set of trees with the given vertex weight and degree sequences. This model covers the traditional \"unweighed\" Wiener index, the terminal Wiener index, and the vertex distance index. It is shown that there exists an optimal caterpillar. If weights of internal vertices increase in their degrees, then an optimal caterpillar exists with weights of internal vertices on its backbone monotonously increasing from some central point to the ends of the backbone, and the same is true for pendent vertices. A tight upper bound of the Wiener index value is proposed and an efficient greedy heuristics is developed that approximates well the optimal index value. Finally, a branch and bound algorithm is built and tested for the exact solution of this NP-complete problem.' url='http://arxiv.org/abs/1705.04291v1' relevance_score=0.8 impact_score=0.0",
  "title='The structure of graphs with given number of blocks and the maximum Wiener index' authors=['Stéphane Bessy', 'François Dross', 'Katarína Hriňáková', 'Martin Knor', 'Riste Škrekovski'] year=2019 venue='arXiv' doi=None arxiv_id='1905.02633' abstract='The Wiener index (the distance) of a connected graph is the sum of distances between all pairs of vertices. In this paper, we study the maximum possible value of this invariant among graphs on $n$ vertices with fixed number of blocks $p$. It is known that among graphs on $n$ vertices that have just one block, the $n$-cycle has the largest Wiener index. And the $n$-path, which has $n-1$ blocks, has the maximum Wiener index in the class of graphs on $n$ vertices. We show that among all graphs on $n$ vertices which have $p\\\\ge 2$ blocks, the maximum Wiener index is attained by a graph composed of two cycles joined by a path (here we admit that one or both cycles can be replaced by a single edge, as in the case $p=n-1$ for example).' url='http://arxiv.org/abs/1905.02633v1' relevance_score=0.8 impact_score=0.0",
  "title='Wiener index of binomial trees and Fibonacci trees' authors=['K. Viswanathan Iyer', 'K. R. Uday Kumar Reddy'] year=2009 venue='arXiv' doi=None arxiv_id='0910.4432' abstract='We obtain a closed-form expression for the Wiener index of binomial trees. We outline efficient algorithms for computing the Wiener indices of Fibonacci and binary Fibonacci trees.' url='http://arxiv.org/abs/0910.4432v1' relevance_score=0.8 impact_score=0.0",
  "title='The quotients between the (revised) Szeged index and Wiener index of graphs' authors=['Huihui Zhang', 'Jing Chen', 'Shuchao Li'] year=2016 venue='arXiv' doi=None arxiv_id='1606.05950' abstract='Let $Sz(G),Sz^*(G)$ and $W(G)$ be the Szeged index, revised Szeged index and Wiener index of a graph $G.$ In this paper, the graphs with the fourth, fifth, sixth and seventh largest Wiener indices among all unicyclic graphs of order $n\\\\geqslant 10$ are characterized; as well the graphs with the first, second, third, and fourth largest Wiener indices among all bicyclic graphs are identified. Based on these results, further relation on the quotients between the (revised) Szeged index and the Wiener index are studied. Sharp lower bound on $Sz(G)/W(G)$ is determined for all connected graphs each of which contains at least one non-complete block. As well the connected graph with the second smallest value on $Sz^*(G)/W(G)$ is identified for $G$ containing at least one cycle.' url='http://arxiv.org/abs/1606.05950v3' relevance_score=0.8 impact_score=0.0",
  "title='Computing the Wiener index in Sierpinski carpet graphs' authors=[\"Daniele D'Angeli\", 'Alfredo Donno', 'Alessio Monti'] year=2018 venue='arXiv' doi=None arxiv_id='1802.09840' abstract='We describe an algorithm to compute the Wiener index of a sequence of finite graphs approximating the Sierpinski carpet.' url='http://arxiv.org/abs/1802.09840v1' relevance_score=0.8 impact_score=0.0",
  "title='The Steiner Wiener index of trees with a given segment sequence' authors=['Jie Zhang', 'Hua Wang', 'Xiao-Dong Zhang'] year=2020 venue='arXiv' doi=None arxiv_id='2008.02019' abstract='The Steiner distance of vertices in a set $S$ is the minimum size of a connected subgraph that contain these vertices. The sum of the Steiner distances over all sets $S$ of cardinality $k$ is called the Steiner $k$-Wiener index and studied as the natural generalization of the famous Wiener index in chemical graph theory. In this paper we study the extremal structures, among trees with a given segment sequence, that maximize or minimize the Steiner $k$-Wiener index. The same extremal problems are also considered for trees with a given number of segments.' url='http://arxiv.org/abs/2008.02019v1' relevance_score=0.8 impact_score=0.0",
  "title='Mathematical aspects of Wiener index' authors=['Martin Knor', 'Riste Škrekovski', 'Aleksandra Tepeh'] year=2015 venue='arXiv' doi=None arxiv_id='1510.00800' abstract='The Wiener index (i.e., the total distance or the transmission number), defined as the sum of distances between all unordered pairs of vertices in a graph, is one of the most popular molecular descriptors. In this article we summarize some results, conjectures and problems on this molecular descriptor, with emphasis on works we were involved in.' url='http://arxiv.org/abs/1510.00800v1' relevance_score=0.8 impact_score=0.0",
  "title='Wiener Index and Remoteness in Triangulations and Quadrangulations' authors=['Éva Czabarka', 'Peter Dankelmann', 'Trevor Olsen', 'László A. Székely'] year=2019 venue='arXiv' doi=None arxiv_id='1905.06753' abstract='Let $G$ be a a connected graph. The Wiener index of a connected graph is the sum of the distances between all unordered pairs of vertices. We provide asymptotic formulae for the maximum Wiener index of simple triangulations and quadrangulations with given connectivity, as the order increases, and make conjectures for the extremal triangulations and quadrangulations based on computational evidence. If $\\\\overlineσ(v)$ denotes the arithmetic mean of the distances from $v$ to all other vertices of $G$, then the remoteness of $G$ is defined as the largest value of $\\\\overlineσ(v)$ over all vertices $v$ of $G$. We give sharp upper bounds on the remoteness of simple triangulations and quadrangulations of given order and connectivity.' url='http://arxiv.org/abs/1905.06753v4' relevance_score=0.8 impact_score=0.0",
  "title=\"A note on 'A New Approach To Compute Wiener Index'\" authors=['Aleksandar Ilic'] year=2013 venue='arXiv' doi=None arxiv_id='1307.6502' abstract=\"In this note, we discuss the method explained in the recent paper [P. Manuel, I. Rajasingh, B. Rajan, R. Sundara Rajan, A New Approach To Compute Wiener Index, Journal of Computational and Theoretical Nanoscience 10, (2013) 1515-1521.] for computing the Wiener index of special chemical graphs. The method is actually already well-known and equivalent to the 'cut method' introduced in 1995 by Klavzar, Gutman and Mohar, and used in multiple papers for computing various distance based graph invariants.\" url='http://arxiv.org/abs/1307.6502v1' relevance_score=0.8 impact_score=0.0",
  "title='Wiener index in graphs with given minimum degree and maximum degree' authors=['Peter Dankelmann', 'Alex Alochukwu'] year=2020 venue='arXiv' doi=None arxiv_id='2011.13970' abstract='Let $G$ be a connected graph of order $n$.The Wiener index $W(G)$ of $G$ is the sum of the distances between all unordered pairs of vertices of $G$. In this paper we show that the well-known upper bound $\\\\big( \\\\frac{n}{δ+1}+2\\\\big) {n \\\\choose 2}$ on the Wiener index of a graph of order $n$ and minimum degree $δ$ [M. Kouider, P. Winkler, Mean distance and minimum degree. J. Graph Theory 25 no. 1 (1997)] can be improved significantly if the graph contains also a vertex of large degree. Specifically, we give the asymptotically sharp bound $W(G) \\\\leq {n-Δ+δ\\\\choose 2} \\\\frac{n+2Δ}{δ+1}+ 2n(n-1)$ on the Wiener index of a graph $G$ of order $n$, minimum degree $δ$ and maximum degree $Δ$. We prove a similar result for triangle-free graphs, and we determine a bound on the Wiener index of $C_4$-free graphs of given order, minimum and maximum degree and show that it is, in some sense, best possible.' url='http://arxiv.org/abs/2011.13970v3' relevance_score=0.8 impact_score=0.0",
  "title='On the Wiener index, distance cospectrality and transmission regular graphs' authors=['Aida Abiad', 'Boris Brimkov', 'Aysel Erey', 'Lorinda Leshock', 'Xavier Martínez-Rivera', 'Suil O', 'Sung-Yell Song', 'Jason Williford'] year=2016 venue='arXiv' doi=None arxiv_id='1609.06911' abstract='In this paper, we investigate various algebraic and graph theoretic properties of the distance matrix of a graph. Two graphs are $D$-cospectral if their distance matrices have the same spectrum. We construct infinite pairs of $D$-cospectral graphs with different diameter and different Wiener index. A graph is $k$-transmission-regular if its distance matrix has constant row sum equal to $k$. We establish tight upper and lower bounds for the row sum of a $k$-transmission-regular graph in terms of the number of vertices of the graph. Finally, we determine the Wiener index and its complexity for linear $k$-trees, and obtain a closed form for the Wiener index of block-clique graphs in terms of the Laplacian eigenvalues of the graph. The latter leads to a generalization of a result for trees which was proved independently by Mohar and Merris.' url='http://arxiv.org/abs/1609.06911v2' relevance_score=0.8 impact_score=0.0",
  "title='Some Aspects of the Wiener Index for Sun Graphs' authors=['Mohamed Amine Boutiche'] year=2016 venue='arXiv' doi=None arxiv_id='1603.06099' abstract='The Wiener index $W(G)$ is the sum of distances of all pairs of vertices of the graph $G$. The Wiener polarity index $W_{p}(G)$ of a graph $G$ is the number of unordered pairs of vertices $u$ and $v$ of $G$ such that the distance $d_{G}(u,v)$ between $u$ and $v$ is $3$. In this paper the Wiener and the Wiener polarity indices of sun graphs are computed. A relationship between those indices with some other topological indices are presented. Finally, we find the Hosoya (Wiener) polynomial for sun graphs.' url='http://arxiv.org/abs/1603.06099v1' relevance_score=0.8 impact_score=0.0"
]