[
  "id='paper_1769839750.027313' title='A comparison between certain graph parameters of biswapped networks and their maximal twin-preserving subgraphs with applications in determining complexity' authors=['A. Rani', 'Asfand Fahad', 'I. F. Hussain', 'Usman Ali', 'Muhammad Ashraf'] year=2023 venue='Measurement science and technology' doi='10.1088/1361-6501/acffe7' arxiv_id=None abstract='The study of different objects, such as the properties of algebraic structures, the analysis of chemical graph structures without experiment, and understanding networks through topological indices (TIs), is among the modern directions in graph theory. The analysis of different networks, such as the Benes network, butterfly network, hex-derived network and biswapped network, using TIs is one of the modern research fields. The storage and transfer of data carrying certain information has always remained a modern world problem. The optoelectronic technology used in optical transpose interconnection systems (OTIS) is efficient in outcome over an electrical system due to the minimum power consumption and broad bandwidth. By combining the use of wireless and electrical technologies, OTIS has developed into a valuable network and boosted the efficiency of contemporary optoelectronic computers. A special type of OTIS is the biswapped network over the path graph Pn , denoted by B(Pn) . In this article, a maximal twin-preserving subgraph of a biswapped network over the path graph Pn is constructed. Moreover, the biswapped network B(Pn) and its constructed subgraph are compared through ev-degree- and ve-degree-dependent TIs. In addition to this, to analyse the complexity of B(Pn) and MT(B(Pn)) through information functional-based entropies, we define ve-degree- and ev-degree-based information functionals and compute formulae for ve-degree- and ev-degree-based entropies. The analytical formulae, tables and graphical trends are used to describe a comparison between the TIs and entropies of B(Pn) and MT(B(Pn)) . It is shown that the values of TIs and entropies only differ by a constant depending on the value of n.' url='https://www.semanticscholar.org/paper/59b31c36ff9cd3d4e3fcd871ede7a41f5a15f010' relevance_score=1.0 impact_score=1.0",
  "id='paper_1769839750.027313' title='Locating Number of Biswapped Networks' authors=['M. Nadeem', 'Waqar Ali', 'H. M. A. Siddiqui'] year=2022 venue='International Journal of Foundations of Computer Science' doi='10.1142/s0129054122420096' arxiv_id=None abstract='A biswapped network is an interconnection network in multiprocessor systems. These are networks of devices or processors and connections of these devices or processors. Here network can be expressed in the form of a graph. Devices or processors represent vertices, and the connection of devices or processors represents edges. The subset of the nodes set is called the resolving set if all the representations or codes are different w.r.t. this subset gives the information about the complete network. The minimum cardinality of the resolving set is called the locating number. In this article, we find the locating number of biswapped interconnection networks. In this paper, We compute the exact values of locating numbers for biswapped networks generated by different families of underlying basis networks like path, cycle, power of path, and complete. We have also given the bounds of locating number of any biswapped network generated by any underlying basis network that consists of its clusters.' url='https://www.semanticscholar.org/paper/e25c88cb9ee5f729b4667c341f1ba2434a75485c' relevance_score=1.0 impact_score=7.0",
  "id='paper_1769839750.027313' title='Average distance between the processors of biswapped networks' authors=['S. Prabhu', 'M. Anitha', 'N. H. Vidyarth', 'Paul Manuel'] year=2025 venue='Scientific Reports' doi='10.1038/s41598-025-29965-5' arxiv_id=None abstract='Biswapped networks provide an efficient way to interconnect nodes through transpose like operations that balance both connectivity and performance. A biswapped network is constructed by systematically biswapping edges within a base graph \\\\documentclass[12pt]{minimal} \\\\usepackage{amsmath} \\\\usepackage{wasysym} \\\\usepackage{amsfonts} \\\\usepackage{amssymb} \\\\usepackage{amsbsy} \\\\usepackage{mathrsfs} \\\\usepackage{upgreek} \\\\setlength{\\\\oddsidemargin}{-69pt} \\\\begin{document}$$G$$\\\\end{document}, thereby preserving essential connectivity properties while enhancing structural symmetry. This improved symmetry contributes to fault tolerance and energy efficiency, making biswapped networks a promising model for robust network design. In this study, we investigate the sum of distances from a particular node to all others, the transmission of a node in a biswapped network, which is a key indicator of communication cost which helps to compute the novel distance based descriptor Wiener index. Furthermore, we analyze transmission values of biswapped networks derived from various base graphs. Finally, the average distance between the nodes of biswapped networks constructed by various base graphs were investigated.' url='https://www.semanticscholar.org/paper/afb294bb244996564b9a11bc3c46ea6b51315e24' relevance_score=0.9 impact_score=0.0",
  "id='paper_1769839750.027313' title='A Multipath Analysis of Biswapped Networks' authors=['Y. Xiang', 'I. A. Stewart'] year=2011 venue='Computer/law journal' doi='10.1093/comjnl/bxq083' arxiv_id=None abstract='Biswapped networks of the form Bsw(G) have recently been proposed as interconnection networks to be implemented as optical transpose interconnection systems. We provide a systematic construction of κ+1 vertex-disjoint paths joining any two distinct vertices in Bsw(G), where κ≥1 is the connectivity of G. In doing so, we obtain an upper bound of max{2Δ(G)+5, Δκ(G)+Δ(G)+2} on the (κ+1)-diameter of Bsw(G), where Δ(G) is the diameter of G and Δκ(G) the κ-diameter. Suppose that we have a deterministic multipath source routing algorithm in an interconnection network G that finds κ mutually vertex-disjoint paths in G joining any two distinct vertices and does this in time polynomial in Δκ(G), Δ(G) and κ (and independently of the number of vertices of G). Our constructions yield an analogous deterministic multipath source routing algorithm in the interconnection network Bsw(G) that finds κ+1 mutually vertex-disjoint paths joining any two distinct vertices in Bsw(G) so that these paths, all have length bounded as above. Moreover, our algorithm has time complexity polynomial in Δκ(G), Δ(G) and κ. We also show that if G is Hamiltonian, then Bsw (G) is Hamiltonian, and that if G is a Cayley graph, then Bsw(G) is a Cayley graph.' url='https://www.semanticscholar.org/paper/bef8dfb0989f8b9d5b21bb4ecf4c7e96bee9e727' relevance_score=0.88 impact_score=8.0",
  "id='paper_1769839750.026314' title='ON VE-DEGREE AND EV-DEGREE BASED TOPOLOGICAL INDICES OF CERTAIN OTIS BISWAPPED NETWORK' authors=['N. Zahra', 'M. Ibrahim'] year=2021 venue='Advances in Mathematics: Scientific Journal' doi='10.37418/amsj.10.6.15' arxiv_id=None abstract='The optical transpose interconnection system (OTIS) arrange has numerous application in designed for equal just as in conveyed arrange. Distinctive interconnection networks has contemplated identified with topological descriptors in [\\\\cite{25,26}]. The present article is a contribution to Ve-degree and Ev-degree base topological indices of biswapped network with premise diagram as path and complete graph. In addition, some delicated recipes are too gotten for various kinds of topological records for the OTIS biswapped network by taking the path and complete graph on $n$ vertices as premise of diagram.' url='https://www.semanticscholar.org/paper/0417a2a8bd077e2cdb447fa2b3db9aa0a62b88f9' relevance_score=0.8600000000000001 impact_score=4.0",
  "id='paper_1769839750.026314' title='Parallel Prefix Sum Algorithm on Optoelectronic Biswapped Network Hyper Hexa-cell' authors=['Ashish Gupta', 'B. K. Sarkar'] year=2018 venue='International Journal of Computer Network and Information Security' doi='10.5815/IJCNIS.2018.08.03' arxiv_id=None abstract='— The biswapped network hyper hexa-cell is recently reported optoelectronic network architecture for delivering excellent performance especially for mapping numerical problems which demands frequent routing and broadcasting. This network contains some important benefits such as smaller diameter, higher bisection width, and lower network’s total and optical cost as compared to counter-part OTIS hyper hexa-cell network. It is also advantageous as compared to the traditional biswapped network mesh containing smaller diameter and higher minimum node degree. In this paper, we present a parallel algorithm for mapping prefix sum of 𝟐 × (𝟔 × 𝟐 𝐝 𝐡 −𝟏 ) 𝟐 data elements on a d h -dimensional biswapped network hyper hexa-cell of 𝟐 × (𝟔 × 𝟐 𝒅 𝒉 −𝟏 ) 𝟐' url='https://www.semanticscholar.org/paper/cd7c4d44cf23d2df71f28b53fffe3bc15b1df11a' relevance_score=0.8200000000000001 impact_score=2.0",
  "id='paper_1769839750.026314' title='The Recursive and Symmetrical Optoelectronic Network Architecture: Biswapped Network Hyper Hexa-Cell' authors=['Ashish Gupta', 'B. K. Sarkar'] year=2018 venue='The Arabian journal for science and engineering' doi='10.1007/s13369-018-3135-0' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/99751838fc6be2e6b21da7cb36c71ff450c29ee4' relevance_score=0.77 impact_score=7.0",
  "id='paper_1769839750.027313' title='Parallel Sorting on the Biswapped Network' authors=['Wenhong Wei', 'W. Xiao', 'Zhen Zhang'] year=2008 venue='International Conference on Interaction Sciences' doi='10.1109/ICIS.2008.62' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/878b68da3696cf1192f18cdeccf2a9e7e0fb024b' relevance_score=0.72 impact_score=2.0",
  "id='paper_1769839750.027313' title='Biswapped Networks and Their Topological Properties' authors=['W. Xiao', 'Weidong Chen', 'Mingxin He', 'Wenhong Wei', 'B. Parhami'] year=2007 venue='Software Engineering, Artificial Intelligence, Networking and Parallel/Distributed Computing' doi='10.1109/SNPD.2007.217' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/237a8105baebb5bf1f12e77779c5f4ec36af0cc7' relevance_score=0.7 impact_score=39.0",
  "id='paper_1769839751.402096' title='Fault isolation and identification in general biswapped networks under the PMC diagnostic model' authors=['Chang-Hsiung Tsai', 'Jheng-Cheng Chen'] year=2013 venue='Theoretical Computer Science' doi='10.1016/j.tcs.2013.06.002' arxiv_id=None abstract='' url='https://doi.org/10.1016/j.tcs.2013.06.002' relevance_score=0.7 impact_score=0.0",
  "id='paper_1769839750.027313' title='Biswapped networks: a family of interconnection architectures with advantages over swapped or OTIS networks' authors=['W. Xiao', 'B. Parhami', 'Weidong Chen', 'Mingxin He', 'Wenhong Wei'] year=2011 venue='International Journal of Computational Mathematics' doi='10.1080/00207160.2011.562893' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/e8bcec2c489ac9fafbf2ee921a9084884938d587' relevance_score=0.69 impact_score=19.0",
  "id='paper_1769839750.026314' title='Biswapped Networks and Their Maximal Twin-Preserving Subgraphs With a Motivation on Connection Number in Network-Based Approaches' authors=['K. Alhulwah', 'Ali N. A. Koam', 'Nasreen Almohanna', 'Ali Ahmad', 'M. Azeem'] year=2024 venue='IEEE Access' doi='10.1109/ACCESS.2024.3409420' arxiv_id=None abstract='The use of optoelectronic technology in Optical Transposition Interconnection Systems (OTIS) offers an effective solution to the ongoing problem of storing and sending data with comprehensive information. This is due to the reduced power requirements and broad bandwidth capabilities of optoelectronic systems, which make them well-suited for this task. The integration of radio communication and electrical technology has transformed OTIS into a highly valued network, enhancing the efficiency of existing optoelectronic computers. OTIS is characterized by the swapped network that is formed with the help of path graph <inline-formula> <tex-math notation=\"LaTeX\">$\\\\mathfrak {P}_{m}$ </tex-math></inline-formula> and denoted as <inline-formula> <tex-math notation=\"LaTeX\">$B(\\\\mathfrak {P}_{m})$ </tex-math></inline-formula>. This research work focused on certain topological invariants (TIs) about the number of connections between nodes of the graph <inline-formula> <tex-math notation=\"LaTeX\">$B(\\\\mathfrak {P}_{m})$ </tex-math></inline-formula> and its largest subgraph that preserves twin nodes (<inline-formula> <tex-math notation=\"LaTeX\">$M(B(\\\\mathfrak {P}_{m}))$ </tex-math></inline-formula>). First Zagreb connection index, geometric-arithmetic connection index, Randić connection index, reduced reciprocal Randić connection index, sum-connectivity connection index, first, second and third redefined Zagreb connection indices are considered in this work two types of biswapped and OTIS networks.' url='https://www.semanticscholar.org/paper/f294d940156dc6d88d24a30fd32a016190c2ae87' relevance_score=0.68 impact_score=0.0",
  "id='paper_1769839750.027313' title='S3: Social-network Simulation System with Large Language Model-Empowered Agents' authors=['Chen Gao', 'Xiaochong Lan', 'Zhi-jie Lu', 'Jinzhu Mao', 'J. Piao', 'Huandong Wang', 'Depeng Jin', 'Yong Li'] year=2023 venue='Social Science Research Network' doi='10.48550/arXiv.2307.14984' arxiv_id=None abstract=\"Social network simulation plays a crucial role in addressing various challenges within social science. It offers extensive applications such as state prediction, phenomena explanation, and policy-making support, among others. In this work, we harness the formidable human-like capabilities exhibited by large language models (LLMs) in sensing, reasoning, and behaving, and utilize these qualities to construct the S$^3$ system (short for $\\\\textbf{S}$ocial network $\\\\textbf{S}$imulation $\\\\textbf{S}$ystem). Adhering to the widely employed agent-based simulation paradigm, we employ prompt engineering and prompt tuning techniques to ensure that the agent's behavior closely emulates that of a genuine human within the social network. Specifically, we simulate three pivotal aspects: emotion, attitude, and interaction behaviors. By endowing the agent in the system with the ability to perceive the informational environment and emulate human actions, we observe the emergence of population-level phenomena, including the propagation of information, attitudes, and emotions. We conduct an evaluation encompassing two levels of simulation, employing real-world social network data. Encouragingly, the results demonstrate promising accuracy. This work represents an initial step in the realm of social network simulation empowered by LLM-based agents. We anticipate that our endeavors will serve as a source of inspiration for the development of simulation systems within, but not limited to, social science.\" url='https://www.semanticscholar.org/paper/221a72a3631ebf8b555c27bc864338390611feb1' relevance_score=0.6100000000000001 impact_score=250.0",
  "id='paper_1769839750.027313' title='Controversies and progress on standardization of large-scale brain network nomenclature' authors=['L. Uddin', 'Richard F. Betzel', 'Jessica R. Cohen', 'J. Damoiseaux', 'F. Brigard', 'S. Eickhoff', 'A. Fornito', 'C. Gratton', 'Evan M. Gordon', 'A. Laird', 'L. Larson-Prior', 'A. Mcintosh', 'L. Nickerson', 'L. Pessoa', 'Ana Luísa Pinho', 'R. Poldrack', 'Adeel Razi', 'Sepideh Sadaghiani', 'J. Shine', 'A. Yendiki', 'B. T. T. Yeo', 'R. N. Spreng', 'Network Neuroscience'] year=2023 venue='Network Neuroscience' doi='10.1162/netn_a_00323' arxiv_id=None abstract='Abstract Progress in scientific disciplines is accompanied by standardization of terminology. Network neuroscience, at the level of macroscale organization of the brain, is beginning to confront the challenges associated with developing a taxonomy of its fundamental explanatory constructs. The Workgroup for HArmonized Taxonomy of NETworks (WHATNET) was formed in 2020 as an Organization for Human Brain Mapping (OHBM)–endorsed best practices committee to provide recommendations on points of consensus, identify open questions, and highlight areas of ongoing debate in the service of moving the field toward standardized reporting of network neuroscience results. The committee conducted a survey to catalog current practices in large-scale brain network nomenclature. A few well-known network names (e.g., default mode network) dominated responses to the survey, and a number of illuminating points of disagreement emerged. We summarize survey results and provide initial considerations and recommendations from the workgroup. This perspective piece includes a selective review of challenges to this enterprise, including (1) network scale, resolution, and hierarchies; (2) interindividual variability of networks; (3) dynamics and nonstationarity of networks; (4) consideration of network affiliations of subcortical structures; and (5) consideration of multimodal information. We close with minimal reporting guidelines for the cognitive and network neuroscience communities to adopt.' url='https://www.semanticscholar.org/paper/4643b85499f94b4e6e21f145f1965d66729ab6df' relevance_score=0.6100000000000001 impact_score=70.0",
  "id='paper_1769839750.027313' title='Algorithms of Basic Communication Operation on the Biswapped Network' authors=['Wenhong Wei', 'W. Xiao'] year=2008 venue='International Conference on Conceptual Structures' doi='10.1007/978-3-540-69384-0_40' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/08803e3c1df4e66d075ef7c6fb6ff7a9b21c12ef' relevance_score=0.61 impact_score=11.0",
  "id='paper_1769839750.027313' title='The “limbic network,” comprising orbitofrontal and anterior temporal cortex, is part of an extended default network: Evidence from multi-echo fMRI' authors=['M. Girn', 'Roni Setton', 'G. R. Turner', 'R. N. Spreng', 'Network Neuroscience'] year=2024 venue='Network Neuroscience' doi='10.1162/netn_a_00385' arxiv_id=None abstract='Abstract Resting-state functional magnetic resonance imaging (fMRI) investigations have provided a view of the default network (DN) as composed of a specific set of frontal, parietal, and temporal cortical regions. This spatial topography is typically defined with reference to an influential network parcellation scheme that designated the DN as one of seven large-scale networks (Yeo et al., 2011). However, the precise functional organization of the DN is still under debate, with studies arguing for varying subnetwork configurations and the inclusion of subcortical regions. In this vein, the so-called limbic network—defined as a distinct large-scale network comprising the bilateral temporal poles, ventral anterior temporal lobes, and orbitofrontal cortex—is of particular interest. A large multi-modal and multi-species literature on the anatomical, functional, and cognitive properties of these regions suggests a close relationship to the DN. Notably, these regions have poor signal quality with conventional fMRI acquisition, likely obscuring their network affiliation in most studies. Here, we leverage a multi-echo fMRI dataset with high temporal signal-to-noise and whole-brain coverage, including orbitofrontal and anterior temporal regions, to examine the large-scale network resting-state functional connectivity of these regions and assess their associations with the DN. Consistent with our hypotheses, our results support the inclusion of the majority of the orbitofrontal and anterior temporal cortex as part of the DN and reveal significant heterogeneity in their functional connectivity. We observed that left-lateralized regions within the temporal poles and ventral anterior temporal lobes, as well as medial orbitofrontal regions, exhibited the greatest resting-state functional connectivity with the DN, with heterogeneity across DN subnetworks. Overall, our findings suggest that, rather than being a functionally distinct network, the orbitofrontal and anterior temporal regions comprise part of a larger, extended default network.' url='https://www.semanticscholar.org/paper/6c1cd3c25fc9cf0e83dbf37f4e6ff35a86b20891' relevance_score=0.6000000000000001 impact_score=17.0",
  "id='paper_1769839750.027313' title='Calculating topological indices of certain OTIS interconnection networks' authors=['A. Aslam', 'Safyan Ahmad', 'M. Binyamin', 'Wei Gao'] year=2019 venue='Open Chemistry' doi='10.1515/chem-2019-0029' arxiv_id=None abstract='Abstract Recently, increasing attention has been paid to The Optical Transpose Interconnection System (OTIS) network because of its prospective applications in architectures for parallel as well as distributed systems [27, 28]. Different interconnection networks in the context of topological indices are researched recently in [25, 26]. This article includes the computions of the general Randi´c, first and second Zagreb, general sum connectivity, first and second multiple zagreb, hyper zagreb, ABC and GA indices for OTIS (swapped and biswapped) networks by taking path and k-regular graph on n vertices as a base graphs. In addition, some delicated formulas are also obtained for the ABC4 and GA5 indices for the OTIS biswapped networks by considering basis graph as a path and k-regular graph of order n.' url='https://www.semanticscholar.org/paper/0a1da03ca0376e696d0c2ec40baa49a5d37e8e73' relevance_score=0.6 impact_score=25.0",
  "id='paper_1769839750.027313' title='Fault Tolerance in the Biswapped Network' authors=['Wenhong Wei', 'W. Xiao'] year=2008 venue='International Conference on Algorithms and Architectures for Parallel Processing' doi='10.1007/978-3-540-69501-1_10' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/cff23d4b3e48483755ffab098f7f1dfbbc42f2c1' relevance_score=0.59 impact_score=9.0",
  "id='paper_1769839750.026314' title='Load Balancing on Heterogeneous Biswapped Network' authors=['Wenhong Wei', 'Yong Li'] year=2010 venue='2010 Third International Symposium on Electronic Commerce and Security' doi='10.1109/ISECS.2010.62' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/10f006518226e3af8869695a0571381e6672e538' relevance_score=0.58 impact_score=8.0",
  "id='paper_1769839750.027313' title='Load Balancing on the Biswapped Network' authors=['Yulian Yu', 'Wenhong Wei'] year=2009 venue='2009 Second International Conference on Intelligent Networks and Intelligent Systems' doi='10.1109/ICINIS.2009.46' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/9840dcb5ff5296619f42c67fa4d8427f8f44205c' relevance_score=0.58 impact_score=8.0",
  "id='paper_1769839750.027313' title='Efficient load balancing on biswapped networks' authors=['Chenggui Zhao'] year=2014 venue='Cluster Computing' doi='10.1007/s10586-012-0241-8' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/0862a676933b41ed38d02b1560049e932582a821' relevance_score=0.58 impact_score=8.0",
  "id='paper_1769839750.027313' title='CANintelliIDS: Detecting In-Vehicle Intrusion Attacks on a Controller Area Network Using CNN and Attention-Based GRU' authors=['Aziz Ur Rehman', 'S. Rehman', 'M. Khan', 'M. Alazab', 'G. ThippaReddy'] year=2021 venue='IEEE Transactions on Network Science and Engineering' doi='10.1109/TNSE.2021.3059881' arxiv_id=None abstract='Controller area network (CAN) is a communication protocol that provides reliable and productive transmission between in-vehicle nodes continuously. CAN bus protocol is broadly utilized standard channel to deliver sequential communications between electronic control units (ECUs) due to simple and reliable in-vehicle communication. Existing studies report how easily an attack can be performed on the CAN bus of in-vehicle due to weak security mechanisms that could lead to system malfunctions. Hence the security of communications inside a vehicle is a latent problem. In this paper, we propose a novel approach named CANintelliIDS, for vehicle intrusion attack detection on the CAN bus. CANintelliIDS is based on a combination of convolutional neural network (CNN) and attention-based gated recurrent unit (GRU) model to detect single intrusion attacks as well as mixed intrusion attacks on a CAN bus. The proposed CANintelliIDS model is evaluated extensively and it achieved a performance gain of 10.79% on test intrusion attacks over existing approaches.' url='https://www.semanticscholar.org/paper/9a5d5a1b827276f73dbd7209c4022e694a8be1ea' relevance_score=0.5700000000000001 impact_score=240.0",
  "id='paper_1769839750.027313' title='General Biswapped Networks and Their Topological Properties' authors=['Mingxin He', 'W. Xiao', 'Weidong Chen', 'Wenhong Wei', 'Zhen Zhang'] year=2007 venue='Advanced Parallel Programming Technologies' doi='10.1007/978-3-540-76837-1_45' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/2e60c9f5840aca3941c71c8deaea39f984fae6cb' relevance_score=0.56 impact_score=6.0",
  "id='paper_1769839750.027313' title='Study of Topological Behavior of Some Computer Related Graphs' authors=['Xiaohui Ren', 'I. Ahmed', 'Rui Liu'] year=2023 venue='Journal of Combinatorial Mathematics and Combinatorial Computing' doi='10.61091/jcmcc117-01' arxiv_id=None abstract='Network theory is the study of graphs such as representing equilibrium relationships or unequal relationships between different objects. A network can be defined as a graph where nodes and / or margins have attributes (e.g. words). Topological index of a graph is a number that helps to understand its topology and a topological index is known as irregularity index if it is greater than zero and topological index of graph is equal to zero if and only if graph is regular. The irregularity indices are used for computational analysis of nonregular graph topological composition. In this paper, we aim to compute topological invariants of some computer related graph networks. We computed various irregularities indices for the graphs of OTIS swapped network \\\\(OP_a\\\\) and Biswapped Networks \\\\(Bsw(Pa).\\\\)' url='https://www.semanticscholar.org/paper/2e882cc1f010b35e0c234c56583677cd2c80e2ca' relevance_score=0.56 impact_score=21.0",
  "id='paper_1769839751.401103' title='Reliability Assessment of Data Center Network Based on Expanded Biswapped Network' authors=['Qing Xiong', 'Weibei Fan', 'Mengjie Lv', 'Xueli Sun', 'Guijuan Wang'] year=2023 venue='' doi='10.2139/ssrn.5383138' arxiv_id=None abstract='' url='https://doi.org/10.2139/ssrn.5383138' relevance_score=0.56 impact_score=0.0",
  "id='paper_1769839750.027313' title='Topological Properties of Biswapped Networks(BSNs):Node Symmetry and Maximal Fault Tolerance' authors=['Chen Wei'] year=2010 venue='' doi='10.3724/sp.j.1016.2010.00822' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/289e0e6ad1abd1e59d8b7fc2ca3dd27d5b4fa6cc' relevance_score=0.54 impact_score=4.0",
  "id='paper_1769839750.027313' title='Efficient scheme for load balancing on heterogeneous Biswapped Networks' authors=['Liting Sun', 'Chao-nan Tong'] year=2013 venue='IEEE Symposium on Computational Intelligence for Communication Systems and Networks' doi='10.1109/CICommS.2013.6582849' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/c8cdec856208653315e02fce592a318024d67adc' relevance_score=0.51 impact_score=1.0",
  "id='paper_1769839750.027313' title='Constructing Node-Disjoint Paths in Biswapped Networks (BSNs)' authors=['Weidong Chen', 'W. Xiao'] year=2008 venue='2008 The 3rd International Conference on Grid and Pervasive Computing - Workshops' doi='10.1109/GPC.WORKSHOPS.2008.69' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/3d05a23699dd0da360f75a51fbace5f78f122c39' relevance_score=0.51 impact_score=1.0",
  "id='paper_1769839750.026314' title='A Hybrid Efficient Load Balancing Algorithm on Biswapped Network' authors=['SU Li-ting'] year=2013 venue='' doi=None arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/c6f5adba2c4f2f7c1d3c73b15b21a9960bfe3635' relevance_score=0.5 impact_score=0.0",
  "id='paper_1769839750.027313' title='Parallel algorithm of matrix multiplication based on Biswapped network' authors=['Wei Wen-hong'] year=2009 venue='' doi='10.3724/sp.j.1087.2009.03218' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/ea38c5194dccc2a37455d33b3d880059926a467d' relevance_score=0.5 impact_score=0.0",
  "id='paper_1769839750.027313' title='Parallel algorithm of matrix multiplication based on Biswapped network: Parallel algorithm of matrix multiplication based on Biswapped network' authors=['Wenhong Wei', 'Qing-xia Li', 'Wen-feng Wang'] year=2010 venue='' doi='10.3724/SP.J.1087.2009.03218' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/2c671a56b8289ea415c8e684d10db45f111663b9' relevance_score=0.5 impact_score=0.0",
  "id='paper_1769839750.027313' title='What is network science?' authors=['U. Brandes', 'G. Robins', 'Ann McCranie', 'S. Wasserman'] year=2013 venue='Network Science' doi='10.1017/nws.2013.2' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/fbc980c37cb34a8275621a496ac49a39f5a333b6' relevance_score=0.5 impact_score=3008.0",
  "id='paper_1769839751.402096' title='Node-to-Set Disjoint Paths in Biswapped Networks' authors=['S. Ling', 'W. Chen'] year=2014 venue='The Computer Journal' doi='10.1093/comjnl/bxt034' arxiv_id=None abstract='' url='https://doi.org/10.1093/comjnl/bxt034' relevance_score=0.5 impact_score=0.0",
  "id='paper_1769839751.402096' title='Node-Pancyclic Properties of Biswapped Networks Based on Cycles in Their Factor Networks' authors=['Weidong Chen', 'Shan Ling'] year=2017 venue='The Computer Journal' doi='10.1093/comjnl/bxw050' arxiv_id=None abstract='' url='https://doi.org/10.1093/comjnl/bxw050' relevance_score=0.5 impact_score=0.0",
  "id='paper_1769839750.027313' title='Biswapped–Torus Network: A New Efficient Node-Symmetrical Optoelectronic Network' authors=['Ashish Gupta', 'B. K. Sarkar'] year=2020 venue='National academy science letters' doi='10.1007/s40009-020-00942-y' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/ed114428bf3afa2a16c2ddff4fb99baaef07d0c5' relevance_score=0.43000000000000005 impact_score=3.0",
  "id='paper_1769839750.027313' title='NetGPT: An AI-Native Network Architecture for Provisioning Beyond Personalized Generative Services' authors=['Yuxuan Chen', 'Rongpeng Li', 'Zhifeng Zhao', 'Chenghui Peng', 'Jianjun Wu', 'E. Hossain', 'Honggang Zhang'] year=2024 venue='IEEE Network' doi='10.1109/MNET.2024.3376419' arxiv_id=None abstract='Large language models (LLMs) have triggered tremendous success to empower our daily life by generative information. The personalization of LLMs could further contribute to their applications due to better alignment with human intents. Towards personalized generative services, a collaborative cloud-edge methodology is promising, as it facilitates the effective orchestration of heterogeneous distributed communication and computing resources. In this article, we put forward NetGPT to capably synergize appropriate LLMs at the edge and the cloud based on their computing capacity. In addition, edge LLMs could efficiently leverage location-based information for personalized prompt completion, thus benefiting the interaction with the cloud LLM. In particular, we present the feasibility of NetGPT by leveraging low-rank adaptation-based fine-tuning of open-source LLMs (i.e., GPT-2-base model and LLaMA model), and conduct comprehensive numerical comparisons with alternative cloudedge collaboration or cloud-only techniques, so as to demonstrate the superiority of NetGPT. Subsequently, we highlight the essential changes required for an artificial intelligence (AI)-native network architecture towards NetGPT, with emphasis on deeper integration of communications and computing resources and careful calibration of logical AI workflows. Furthermore, we demonstrate several benefits of NetGPT, which come as by-products, as the edge LLMs’ capability to predict trends and infer intents promises a unified solution for intelligent network management & orchestration. We argue that NetGPT is a promising Al-native network architecture for provisioning beyond personalized generative services.' url='https://www.semanticscholar.org/paper/631a96188809597a98cae246b679c45d60f3fb26' relevance_score=0.43000000000000005 impact_score=62.0",
  "id='paper_1769839750.027313' title='Molecular descriptors of certain OTIS interconnection networks' authors=['M. Cancan', 'Iftikhar Ahmad', 'Sarfarz Ahmad'] year=2020 venue='' doi='10.22199/issn.0717-6279-2020-04-0048' arxiv_id=None abstract='Network theory as an important role in the field of electronic and electrical engineering, for example, in signal processing, networking, communication theory, etc. The branch of mathematics known as Graph theory found remarkable applications in this area of study. A topological index (TI) is a real number attached with graph networks and correlates the chemical networks with many physical and chemical properties and chemical reactivity. The Optical Transpose Interconnection System (OTIS) network has received considerable attention in recent years and has a special place among real world architectures for parallel and distributed systems. In this report, we compute redefined first, second and third Zagreb indices of OTIS swapped and OTIS biswapped networks. We also compute some Zagreb polynomials of understudy Networks.' url='https://www.semanticscholar.org/paper/f9dd1bbb0a67007ecc204783c3746ab658a67ee7' relevance_score=0.42999999999999994 impact_score=3.0",
  "id='paper_1769839750.027313' title='Optimized Parallel Prefix Sum Algorithm on Optoelectronic Biswapped-Torus Architecture' authors=['Ashish Gupta'] year=2020 venue='Vietnam Journal of Computer Science' doi='10.1142/s2196888821500159' arxiv_id=None abstract='The Biswapped-Torus is a recently reported optoelectronic node-symmetrical member of Biswapped-framework family. In this paper,optimized parallel approach is presented for prefix sum computation on [Formula: see text] Biswapped-Torus. The proposed parallel algorithm demands total 7[Formula: see text] electronic and three optical moves on odd network size or 7[Formula: see text] electronic and three optical moves on even network size. The algorithmic performance of the suggested parallel algorithm is also compared with the performances of recently reported optimal prefix sum algorithms on [Formula: see text] Biswapped-Mesh and [Formula: see text]-dimensional Biswapped Hyper Hexa-cell. Based on the comparative analysis, Biswapped-Torus claims to map prefix sum faster that require fewer communication moves compared to the Grid-based traditional architecture of biswapped family named Biswapped-Mesh. Moreover, the former also has architectural benefit of node-symmetry that leads to advantages such as easy embedding, mapping and designing of routing algorithms. Compared to symmetrical counter-part of biswapped family named Biswapped-Hyper Hexa-Cell, Biswapped-Torus is cost-efficient, but requires comparatively more communication moves for mapping prefix sum.' url='https://www.semanticscholar.org/paper/eaa23c840225534f59f85245e7ce15d5b3af7200' relevance_score=0.4 impact_score=0.0",
  "id='paper_1769839750.027313' title='Swarm of UAVs for Network Management in 6G: A Technical Review' authors=['Muhammad Asghar Khan', 'Neeraj Kumar', 'S. Mohsan', 'Wali Ullah Khan', 'Moustafa M. Nasralla', 'Mohammed H. Alsharif', 'Justyna ywioek', 'Insaf Ullah'] year=2022 venue='IEEE Transactions on Network and Service Management' doi='10.1109/TNSM.2022.3213370' arxiv_id=None abstract='Fifth-generation (5G) cellular networks have led to the implementation of beyond 5G (B5G) networks, which are capable of incorporating autonomous services to swarm of unmanned aerial vehicles (UAVs). They provide capacity expansion strategies to address massive connectivity issues and guarantee ultra-high throughput and low latency, especially in extreme or emergency situations where network density, bandwidth, and traffic patterns fluctuate. On the one hand, 6G technology integrates AI/ML, IoT, and blockchain to establish ultra-reliable, intelligent, secure, and ubiquitous UAV networks. 6G networks, on the other hand, rely on new enabling technologies such as air interface and transmission technologies, as well as a unique network design, posing new challenges for the swarm of UAVs.Keeping these challenges in mind, this article focuses on the security and privacy, intelligence, and energy-efficiency issues faced by swarms of UAVs operating in 6G mobile network. In this state-of-the-art review, we integrated blockchain and AI/ML with UAV networks utilizing the 6G ecosystem. The key findings are then presented, and potential research challenges are identified. We conclude the review by shedding light on future research in this emerging field of research.' url='https://www.semanticscholar.org/paper/bcd75bc37f2f742ac32e3ff1876e91c1b0a1f62e' relevance_score=0.39 impact_score=184.0",
  "id='paper_1769839750.027313' title='E-GraphSAGE: A Graph Neural Network based Intrusion Detection System for IoT' authors=['Wai Weng Lo', 'Siamak Layeghy', 'Mohanad Sarhan', 'M. Gallagher', 'M. Portmann'] year=2021 venue='IEEE/IFIP Network Operations and Management Symposium' doi='10.1109/NOMS54207.2022.9789878' arxiv_id=None abstract='This paper presents a new Network Intrusion Detection System (NIDS) based on Graph Neural Networks (GNNs). GNNs are a relatively new sub-field of deep neural networks, which can leverage the inherent structure of graph-based data. Training and evaluation data for NIDSs are typically represented as flow records, which can naturally be represented in a graph format. In this paper, we propose E-GraphSAGE, a GNN approach that allows capturing both the edge features of a graph as well as the topological information for network intrusion detection in IoT networks. To the best of our knowledge, our proposal is the first successful, practical, and extensively evaluated approach of applying GNNs on the problem of network intrusion detection for IoT using flow-based data. Our extensive experimental evaluation on four recent NIDS benchmark datasets shows that our approach outperforms the state-of-the-art in terms of key classification metrics, which demonstrates the potential of GNNs in network intrusion detection, and provides motivation for further research.' url='https://www.semanticscholar.org/paper/49f202fb16bb2897d4866844d4d8624a4dfa506d' relevance_score=0.37 impact_score=308.0",
  "id='paper_1769839750.027313' title='Multi-Agent DRL for Task Offloading and Resource Allocation in Multi-UAV Enabled IoT Edge Network' authors=['A. M. Seid', 'Gordon Owusu Boateng', 'B. Mareri', 'Guolin Sun', 'W. Jiang'] year=2021 venue='IEEE Transactions on Network and Service Management' doi='10.1109/tnsm.2021.3096673' arxiv_id=None abstract='The Internet of Things (IoT) edge network has connected lots of heterogeneous smart devices, thanks to unmanned aerial vehicles (UAVs) and their groundbreaking emerging applications. Limited computational capacity and energy availability have been major factors hindering the performance of edge user equipment (UE) and IoT devices in IoT edge networks. Besides, the edge base station (BS) with the computation server is allowed massive traffic and is vulnerable to disasters. The UAV is a promising technology that provides aerial base stations (ABSs) to assist the edge network in enhancing the ground network performance, extending network coverage, and offloading computationally intensive tasks from UEs or IoT devices. In this paper, we deploy a clustered multi-UAV to provide computing task offloading and resource allocation services to IoT devices. We propose a multi-agent deep reinforcement learning (MADRL)-based approach to minimize the overall network computation cost while ensuring the quality of service (QoS) requirements of IoT devices or UEs in the IoT network. We formulate our problem as a natural extension of the Markov decision process (MDP) concerning stochastic game, to minimize the long-term computation cost in terms of energy and delay. We consider the stochastic time-varying UAVs’ channel strength and dynamic resource requests to obtain optimal resource allocation policies and computation offloading in aerial to ground (A2G) network infrastructure. Simulation results show that our proposed MADRL method reduces the average costs by 38.643%, and 55.621% and increases the reward by 58.289% and 85.289% compared with the different single agent DRL and heuristic schemes, respectively.' url='https://www.semanticscholar.org/paper/fefd92e8a1ace7192e5a10b25c36f23b5d6a9ab4' relevance_score=0.37 impact_score=207.0",
  "id='paper_1769839750.027313' title='Fault-tolerance in biswapped multiprocessor interconnection networks' authors=['Basem Assiri', 'Muhammad Faisal Nadeem', 'Waqar Ali', 'Ali Ahmad'] year=2025 venue='J. Parallel Distributed Comput.' doi='10.1016/j.jpdc.2024.105009' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/a2ac6f0b3b2f12d526b92dfa39ed2e03320cf477' relevance_score=0.36000000000000004 impact_score=6.0",
  "id='paper_1769839750.027313' title='Kitsune: An Ensemble of Autoencoders for Online Network Intrusion Detection' authors=['Yisroel Mirsky', 'Tomer Doitshman', 'Y. Elovici', 'A. Shabtai'] year=2018 venue='Network and Distributed System Security Symposium' doi='10.14722/ndss.2018.23211' arxiv_id=None abstract=\"Neural networks have become an increasingly popular solution for network intrusion detection systems (NIDS). Their capability of learning complex patterns and behaviors make them a suitable solution for differentiating between normal traffic and network attacks. However, a drawback of neural networks is the amount of resources needed to train them. Many network gateways and routers devices, which could potentially host an NIDS, simply do not have the memory or processing power to train and sometimes even execute such models. More importantly, the existing neural network solutions are trained in a supervised manner. Meaning that an expert must label the network traffic and update the model manually from time to time. \\nIn this paper, we present Kitsune: a plug and play NIDS which can learn to detect attacks on the local network, without supervision, and in an efficient online manner. Kitsune's core algorithm (KitNET) uses an ensemble of neural networks called autoencoders to collectively differentiate between normal and abnormal traffic patterns. KitNET is supported by a feature extraction framework which efficiently tracks the patterns of every network channel. Our evaluations show that Kitsune can detect various attacks with a performance comparable to offline anomaly detectors, even on a Raspberry PI. This demonstrates that Kitsune can be a practical and economic NIDS.\" url='https://www.semanticscholar.org/paper/fa11df1157486731afe86af7d6d9254a82d4dbd6' relevance_score=0.35000000000000003 impact_score=901.0",
  "id='paper_1769839750.027313' title='Matrix Multiplication on the Biswapped-Mesh Network' authors=['Wenhong Wei', 'W. Xiao'] year=2007 venue='Software Engineering, Artificial Intelligence, Networking and Parallel/Distributed Computing' doi='10.1109/SNPD.2007.51' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/9770ab7f8e3e6a1ebb990bf9c3b7b98b3466976d' relevance_score=0.33 impact_score=13.0",
  "id='paper_1769839750.027313' title='Broadcasting on the BSN-Hypercube Network' authors=['He-ping Ye', 'W. Xiao', 'Jiao-yu Wu'] year=2009 venue='2009 Second International Conference on Information and Computing Science' doi='10.1109/ICIC.2009.49' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/d20beb6f7bda55252553befc91acb822a3c8becd' relevance_score=0.33 impact_score=3.0",
  "id='paper_1769839750.027313' title='Optimized Parallel Counting Sort Algorithm for Distinct Numeric Values on Biswapped Hyper Hexa-Cell Optoelectronic Network' authors=['Ashish Gupta'] year=2021 venue='International Journal of Computer Network and Information Security' doi='10.5815/ijcnis.2022.01.06' arxiv_id=None abstract='The optoelectronic Biswapped-Hyper Hexa-Cell is a recently reported recursive and a symmetrical architecture of Biswapped Family. This symmetrical network has claimed and proved to be advantageous in terms of network diameter, bisection width, minimum node-degree and network cost compared to its counterpart architecture of OTIS family named ‘OTIS Hyper Hexa-Cell’ and traditional grid-based architecture of Biswapped family named ‘Biswapped-Mesh’. In this paper, we present a novel and efficient parallel algorithm for counting sort for sorting distinct numeric values on dh-dimensional Biswapped-Hyper Hexa-Cell optoelectronic network. The parallel algorithm demands 10d_h+12+ log_2\\u2061〖S_A 〗 electronic and 10 optical moves, where SA is the size of count array: Acip[SA], and SA equals to maximal minus minimal numeric value plus one. On the basis of analysis, it is concluded that proposed algorithm delivers better performance since speedup and efficiency improved for worst case scenario (difference between maximal and minimal data values becomes larger) with the increase of only few communication moves required for sorting.' url='https://www.semanticscholar.org/paper/f769876cab5d81cd03d01b6c1150bb387500ed00' relevance_score=0.32 impact_score=0.0",
  "id='paper_1769839750.027313' title='Social Network Analysis' authors=['Tracy M. Sweet'] year=2018 venue='Encyclopedia of Social Network Analysis and Mining. 2nd Ed.' doi='10.1007/978-1-4939-7131-2_101152' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/a9e5b61738fdcc0a9233aae2ad5ac3dd9d088f08' relevance_score=0.30000000000000004 impact_score=4682.0",
  "id='paper_1769839750.027313' title='Network Analysis' authors=['Natalie Lambert'] year=2018 venue='Encyclopedia of Social Network Analysis and Mining. 2nd Ed.' doi='10.1007/978-1-4939-7131-2_100721' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/bf1a38628c53b6d06a575d43fba612ad394c5798' relevance_score=0.30000000000000004 impact_score=753.0",
  "id='paper_1769839751.402096' title='Multimedia home network. Network interfaces for network adapter' authors=[] year=2023 venue='' doi='10.3403/30168736u' arxiv_id=None abstract='' url='https://doi.org/10.3403/30168736u' relevance_score=0.16000000000000003 impact_score=0.0",
  "id='paper_1769839751.402096' title='Business network : network marketing : analysis of network marketing using business network theories' authors=['Pui-kuen Tang'] year=2023 venue='' doi='10.5353/th_b3126831' arxiv_id=None abstract='' url='https://doi.org/10.5353/th_b3126831' relevance_score=0.16000000000000003 impact_score=0.0",
  "id='paper_1769839751.402096' title='Network Calculus and Mu2e event building Network' authors=['Hiu kao'] year=2023 venue='Network Calculus and Mu2e event building Network' doi='10.2172/2005192' arxiv_id=None abstract='' url='https://doi.org/10.2172/2005192' relevance_score=0.16000000000000003 impact_score=0.0",
  "id='paper_1769839751.402096' title='network-network interface' authors=[] year=2023 venue='SpringerReference' doi='10.1007/springerreference_19661' arxiv_id=None abstract='' url='https://doi.org/10.1007/springerreference_19661' relevance_score=0.16000000000000003 impact_score=0.0",
  "id='paper_1769839751.402096' title='Acknowledgment to the Reviewers of Network in 2022' authors=[] year=2023 venue='Network' doi='10.3390/network3010004' arxiv_id=None abstract='<jats:p>High-quality academic publishing is built on rigorous peer review [...]</jats:p>' url='https://doi.org/10.3390/network3010004' relevance_score=0.16000000000000003 impact_score=0.0",
  "id='paper_1769839751.402096' title='Acknowledgment to Reviewers of Network in 2021' authors=[] year=2022 venue='Network' doi='10.3390/network2010006' arxiv_id=None abstract='<jats:p>Rigorous peer-reviews are the basis of high-quality academic publishing [...]</jats:p>' url='https://doi.org/10.3390/network2010006' relevance_score=0.14 impact_score=0.0",
  "id='paper_1769839750.027313' title='BSN MOT: A Fast and Cost-efficient Optoelectronic Architecture' authors=['Ashish Gupta', 'B. K. Sarkar'] year=2020 venue='IETE Technical Review' doi='10.1080/02564602.2020.1823251' arxiv_id=None abstract='Recently, an efficient recursive and symmetrical optoelectronic interconnection network based on biswapped framework named “Biswapped-Hyper Hexa-Cell (BSN HHC)” is reported. In spite of containing a prime advantage concerning network diameter compared to its competitive Biswapped-Mesh (BSN Mesh) optoelectronic architecture; a major limitation of the network is its high cost. In a search for a competitive alternative variation of this network, a fast and a cost-efficient member of biswapped family named “Biswapped-Mesh of Trees (BSN MOT)” is proposed here. The suggested BSN MOT optoelectronic network claims to be a better alternative of counter-part OTIS-Mesh of Trees (OTIS MOT) optoelectronic network, claims advantages concerning diameter, minimum node degree, and network total and optical cost (total cost drops about 10–30% and optical cost drops about 50%). More specifically, compared to competitive Biswapped-Mesh and BSN HHC optoelectronic networks, the proposed network has a major advantage concerning network diameter. Moreover, BSN MOT is a cost-efficient architecture, where total network cost drops about 30–45% than that of BSN HHC. Besides, it is a better alternative for processing numerical problems that require network with “low static maximum node degree”. Thus, on the basis of above-mentioned properties, the proposed network claims to be the most economical and the fastest variation of biswapped framework.' url='https://www.semanticscholar.org/paper/55a72b8e04275a3bd81e9d218e502e7f203e7421' relevance_score=0.12000000000000001 impact_score=2.0",
  "id='paper_1769839750.027313' title='Principle of Symmetry for Network Topology with Applications to Some Networks' authors=['Zhaoquan Cai', 'W. Xiao', 'Qin Zhang', 'Yanxia Liu'] year=2010 venue='J. Networks' doi='10.4304/jnw.5.9.994-1000' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/4fd0630545977ca6b5f16737dec1e8702d55ffb7' relevance_score=0.11 impact_score=1.0",
  "id='paper_1769839750.027313' title='BSN-mesh and its basic parallel algorithms' authors=['Wenhong Wei', 'Qingxia Li', 'Ming Tao'] year=2015 venue='International Journal of Grid and Utility Computing' doi='10.1504/IJGUC.2015.070684' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/58edb103b28f0435661c2ff02244a22433b2bc8c' relevance_score=0.1 impact_score=10.0",
  "id='paper_1769839751.402096' title='Preliminary End-of-Season Estimates of 2014/15 Influenza Vaccine Effectiveness in Preventing Laboratory-Confirmed Influenza-Related Hospitalization From the Serious Outcomes Surveillance (SOS) Network of the Canadian Immunization Research Network (CIRN)' authors=['Shelly Mcneil', 'Ardith Ambrose', 'Melissa K. Andrew', 'Guy Boivin', 'William Bowie', 'Gael Dos Santos', 'May Elsherif', 'Karen Green', 'Francois Haguinet', 'Todd Hatchette', 'Kevin Katz', 'Jason Leblanc', 'Mark Loeb', 'Donna Mackinnon-Cameron', 'Anne E. Mccarthy', 'Janet E. Mcelhaney', 'Allison Mcgeer', 'Jeff Powis', 'David Richardson', 'Makeda Semret', 'Rohita Sharma', 'Vivek Shinde', 'Daniel Smyth', 'Sylvie Trottier', 'Louis Valiquette', 'Duncan Webster', 'Lingyun Ye'] year=2015 venue='Open Forum Infectious Diseases' doi='10.1093/ofid/ofv133.1465' arxiv_id=None abstract='' url='https://doi.org/10.1093/ofid/ofv133.1465' relevance_score=0.1 impact_score=0.0",
  "id='paper_1769839751.402096' title='IEEE Network [cover]' authors=[] year=2012 venue='IEEE Network' doi='10.1109/mnet.2012.6308064' arxiv_id=None abstract='' url='https://doi.org/10.1109/mnet.2012.6308064' relevance_score=0.1 impact_score=0.0",
  "id='paper_1769839751.402096' title='Managing network security: Simulating network security' authors=['Fred Cohen'] year=1999 venue='Network Security' doi='10.1016/s1353-4858(00)80009-4' arxiv_id=None abstract='' url='https://doi.org/10.1016/s1353-4858(00)80009-4' relevance_score=0.1 impact_score=0.0",
  "id='paper_1769839751.402096' title='Network (Genetic Network, Metabolic Network, Molecular Network)' authors=['Denis Thieffry'] year=2004 venue='Dictionary of Bioinformatics and Computational Biology' doi='10.1002/0471650129.dob0482' arxiv_id=None abstract='' url='https://doi.org/10.1002/0471650129.dob0482' relevance_score=0.1 impact_score=0.0",
  "id='paper_1769839751.402096' title='IEEE Network' authors=[] year=2011 venue='IEEE Network' doi='10.1109/mnet.2011.5772051' arxiv_id=None abstract='' url='https://doi.org/10.1109/mnet.2011.5772051' relevance_score=0.1 impact_score=0.0",
  "id='paper_1769839751.402096' title='IEEE Network Magazine Call For Papers Advances In Network Systems Architecture' authors=[] year=2006 venue='IEEE Network' doi='10.1109/mnet.2006.273117' arxiv_id=None abstract='' url='https://doi.org/10.1109/mnet.2006.273117' relevance_score=0.1 impact_score=0.0",
  "id='paper_1769839751.402096' title='IEEE Network - Cover' authors=[] year=2011 venue='IEEE Network' doi='10.1109/mnet.2011.6085633' arxiv_id=None abstract='' url='https://doi.org/10.1109/mnet.2011.6085633' relevance_score=0.1 impact_score=0.0",
  "id='paper_1769839748.464139' title='PubMed Paper 41331308' authors=['Unknown'] year=2023 venue='PubMed' doi=None arxiv_id=None abstract='Abstract would be fetched from additional API call' url='https://pubmed.ncbi.nlm.nih.gov/41331308/' relevance_score=0.06000000000000001 impact_score=0.0",
  "id='paper_1769839750.027313' title='Parallel Prefix Algorithm on BSN-Mesh' authors=['Wenhong Wei', 'Qingxia Li', 'Ming Tao'] year=2013 venue='2013 Fourth International Conference on Emerging Intelligent Data and Web Technologies' doi='10.1109/EIDWT.2013.12' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/02a963720789a0e9594efb2bc0ac10f6163b9316' relevance_score=0.04 impact_score=4.0",
  "id='paper_1769839750.027313' title='Algorithms and architectures for parallel processing : 8th international conference, ICA3PP 2008, Cyprus, June 9-11, 2008 : proceedings' authors=['Anu G. Bourgeois', 'S. Q. Zheng'] year=2008 venue='' doi=None arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/edfe11d8ed261e41c569bef1a6ba7370d01e41b3' relevance_score=0.0 impact_score=0.0"
]