[
  "title='Graph Entropy Based on Wiener Polarity Index Under Four Kinds of Graph Operations' authors=['Chen Yang', 'Chongmin Li'] year=2025 venue='Mathematics and Computer Science' doi='10.11648/j.mcs.20251001.13' arxiv_id=None abstract='<jats:p xml:lang=\"en\">The Wiener polarity index of a graph &amp;lt;i&amp;gt;G&amp;lt;/i&amp;gt;, is the number of unordered pairs of vertices that are at distance 3 in &amp;lt;i&amp;gt;G&amp;lt;/i&amp;gt;. This index can reflect the specific distance relation between vertices in the graph, and provides a new way for the study of graph structure. In this paper, the graph entropy based on Wiener polarity index defined. Based on the above definition of graph entropy, it compares the graph entropy of path and balanced double star graphs based on Wiener polarity index. The expressions of graph entropy based on Wiener polarity index for trees with diameter &amp;lt;i&amp;gt;d ≥ 3&amp;lt;/i&amp;gt; are studied under four graph operations: tensor product, strong product, Cartesian product and composite graph.</jats:p>' url='https://doi.org/10.11648/j.mcs.20251001.13' relevance_score=1.0 impact_score=0.0",
  "title='On Wiener Polarity Index and Wiener Index of Certain Triangular Networks' authors=['Mr. Adnan', 'Syed Ahtsham Ul Haq Bokhary', 'Muhammad Imran'] year=2021 venue='Journal of Chemistry' doi='10.1155/2021/2757925' arxiv_id=None abstract='<jats:p>A topological index of graph <jats:inline-formula>\\n                     <a:math xmlns:a=\"http://www.w3.org/1998/Math/MathML\" id=\"M1\">\\n                        <a:mi>G</a:mi>\\n                     </a:math>\\n                  </jats:inline-formula> is a numerical quantity which describes its topology. If it is applied to the molecular structure of chemical compounds, it reflects the theoretical properties of the chemical compounds. A number of topological indices have been introduced so far by different researchers. The Wiener index is one of the oldest molecular topological indices defined by Wiener. The Wiener index number reflects the index boiling points of alkane molecules. Quantitative structure activity relationships (QSAR) showed that they also describe other quantities including the parameters of its critical point, density, surface tension, viscosity of its liquid phase, and the van der Waals surface area of the molecule. The Wiener polarity index has been introduced by Wiener and known to be related to the cluster coefficient of networks. In this paper, the Wiener polarity index <jats:inline-formula>\\n                     <c:math xmlns:c=\"http://www.w3.org/1998/Math/MathML\" id=\"M2\">\\n                        <c:msub>\\n                           <c:mrow>\\n                              <c:mi>W</c:mi>\\n                           </c:mrow>\\n                           <c:mrow>\\n                              <c:mi>p</c:mi>\\n                           </c:mrow>\\n                        </c:msub>\\n                        <c:mfenced open=\"(\" close=\")\" separators=\"|\">\\n                           <c:mrow>\\n                              <c:mi>G</c:mi>\\n                           </c:mrow>\\n                        </c:mfenced>\\n                     </c:math>\\n                  </jats:inline-formula> and Wiener index <jats:inline-formula>\\n                     <h:math xmlns:h=\"http://www.w3.org/1998/Math/MathML\" id=\"M3\">\\n                        <h:mi>W</h:mi>\\n                        <h:mfenced open=\"(\" close=\")\" separators=\"|\">\\n                           <h:mrow>\\n                              <h:mi>G</h:mi>\\n                           </h:mrow>\\n                        </h:mfenced>\\n                     </h:math>\\n                  </jats:inline-formula> of certain triangular networks are computed by using graph-theoretic analysis, combinatorial computing, and vertex-dividing technology.</jats:p>' url='https://doi.org/10.1155/2021/2757925' relevance_score=0.9700000000000001 impact_score=0.0",
  "title='Wiener polarity index and related molecular topological descriptors of titanium oxide nanotubes' authors=['Muhammad Imran', 'Mehar Ali Malik', 'Ramsha Javed'] year=2021 venue='International Journal of Quantum Chemistry' doi='10.1002/qua.26627' arxiv_id=None abstract='<jats:title>Abstract</jats:title><jats:p>The relations between the physico‐chemical properties of a chemical compounds its molecular structure properties are used in quantitative structure activity and property relationship studies by using graph‐theoretical techniques. The Wiener polarity index is the number of unordered pairs of vertices lying at distance<jats:styled-content>3</jats:styled-content>in a graph. This index is correlated to the cluster coefficient of chemical networks. The Wiener polarity index has been used to exhibit quantitative structure–property relationships in a series of acyclic and cycle‐containing hydrocarbons. In this paper, we consider three variants of the graph of titanium oxide<jats:styled-content>TiO<jats:sub>2</jats:sub></jats:styled-content>, that is, two‐dimensional lattice, nanotubes and nanotorus. For all these graphs, we compute the number of pairs of vertices lying at distance one, two and three. Using this information, we compute the Wiener polarity index and leap Zagreb indices of these graphs.</jats:p>' url='https://doi.org/10.1002/qua.26627' relevance_score=0.9700000000000001 impact_score=0.0",
  "title='Wiener Polarity Index Calculation of Square-Free Graphs and Its Implementation to Certain Complex Materials' authors=['Lin Zhang', 'Tian-Le Sun', 'Micheal Arockiaraj', 'M. Arulperumjothi', 'S. Prabhu'] year=2021 venue='Mathematical Problems in Engineering' doi='10.1155/2021/6686352' arxiv_id=None abstract='<jats:p>Molecular topology is a portion of mathematical chemistry managing the logarithmic portrayal of chemical materials, permitting a tremendous yet straightforward characterization of the compounds. Concerning the traditional physical-chemical descriptors, it is conceivable to set up direct quantitative structure-activity relationship methods to associate with such descriptors termed topological indices. In this study, we have developed the mathematical technique to study the Wiener polarity index of chemical materials without squares. We have taken the cancer treatment drugs such as lenvatinib and cabozantinib to illustrate our approach. In addition, we explored the inherent property of silicate, Sierpiński, and octahedral-related complex materials that the edge set can be decomposed in such a way that any edge in the same part of the decomposition has an equal number of neighboring vertices and applied the technique to derive the formulae for these materials.</jats:p>' url='https://doi.org/10.1155/2021/6686352' relevance_score=0.9700000000000001 impact_score=0.0",
  "title='On the second maximum Wiener polarity index of chemical trees of a fixed order' authors=['Akbar Ali', 'Zhibin Du', 'Syeda Sifwa Zaineb', 'Tariq Alraqad'] year=2021 venue='International Journal of Quantum Chemistry' doi='10.1002/qua.26631' arxiv_id=None abstract='<jats:title>Abstract</jats:title><jats:p>The Wiener polarity index<jats:styled-content><jats:italic>W</jats:italic><jats:sub>p</jats:sub></jats:styled-content>of a graph is defined as the number of unordered pairs of its vertices at distance 3. The problem of finding trees attaining the maximum<jats:styled-content><jats:italic>W</jats:italic><jats:sub>p</jats:sub></jats:styled-content>value, among all chemical trees of a fixed order<jats:styled-content><jats:italic>n</jats:italic></jats:styled-content>, was solved in the paper (<jats:italic>Mol</jats:italic>.<jats:italic>Inf</jats:italic>.<jats:bold>2019</jats:bold>,<jats:italic>38</jats:italic>, 1800076) for<jats:styled-content><jats:italic>n</jats:italic>\\u2009≥\\u20098</jats:styled-content>. Motivated by the usage of<jats:styled-content><jats:italic>W</jats:italic><jats:sub>p</jats:sub></jats:styled-content>in a recent publication (<jats:italic>J</jats:italic>.<jats:italic>Chem</jats:italic>.<jats:italic>Inf</jats:italic>.<jats:italic>Model</jats:italic>.<jats:bold>2020</jats:bold>,<jats:italic>60</jats:italic>, 1224–1234), in this article we extend the work done in the aforementioned paper by giving a further ordering of chemical trees with respect to the maximum value of<jats:styled-content><jats:italic>W</jats:italic><jats:sub>p</jats:sub></jats:styled-content>. More precisely, we characterize the trees having the second maximum<jats:styled-content><jats:italic>W</jats:italic><jats:sub>p</jats:sub></jats:styled-content>value (which is<jats:styled-content>3<jats:italic>n</jats:italic>\\u2009−\\u200916</jats:styled-content>) from the class of all chemical trees of a fixed order<jats:styled-content><jats:italic>n</jats:italic></jats:styled-content>, for<jats:styled-content><jats:italic>n</jats:italic>\\u2009≥\\u20099</jats:styled-content>.</jats:p>' url='https://doi.org/10.1002/qua.26631' relevance_score=0.9700000000000001 impact_score=0.0",
  "title='Generalizations of Wiener polarity index and terminal Wiener index' authors=['Aleksandar Ilic', 'Milovan Ilic'] year=2011 venue='arXiv' doi=None arxiv_id='1106.2986' abstract='In theoretical chemistry, distance-based molecular structure descriptors are used for modeling physical, pharmacologic, biological and other properties of chemical compounds. We introduce a generalized Wiener polarity index $W_k (G)$ as the number of unordered pairs of vertices ${u, v}$ of $G$ such that the shortest distance $d (u, v)$ between $u$ and $v$ is $k$ (this is actually the $k$-th coefficient in the Wiener polynomial). For $k = 3$, we get standard Wiener polarity index. Furthermore, we generalize the terminal Wiener index $TW_k (G)$ as the sum of distances between all pairs of vertices of degree $k$. For $k = 1$, we get standard terminal Wiener index. In this paper we describe a linear time algorithm for computing these indices for trees and partial cubes, and characterize extremal trees maximizing the generalized Wiener polarity index and generalized terminal Wiener index among all trees of given order $n$.' url='http://arxiv.org/abs/1106.2986v2' relevance_score=0.9500000000000001 impact_score=0.0",
  "title='On Wiener polarity index of cactus graphs' authors=['Nan Chen', 'Wen-Xue Du', 'Yi-Zheng Fan'] year=2012 venue='arXiv' doi=None arxiv_id='1211.3513' abstract='The Wiener polarity index of a graph G is the number of unordered pairs of vertices u, v such that the distance between u and v is 3. In this paper we give an explicit formula for the Wiener polarity index of cactus graphs. We also deduce formulas for some special cactus graphs.' url='http://arxiv.org/abs/1211.3513v1' relevance_score=0.9500000000000001 impact_score=0.0",
  "title='The Wiener polarity index of benzenoid systems and nanotubes' authors=['Niko Tratnik'] year=2017 venue='arXiv' doi=None arxiv_id='1711.03600' abstract='In this paper, we consider a molecular descriptor called the Wiener polarity index, which is defined as the number of unordered pairs of vertices at distance three in a graph. Molecular descriptors play a fundamental role in chemistry, materials engineering, and in drug design since they can be correlated with a large number of physico-chemical properties of molecules. As the main result, we develop a method for computing the Wiener polarity index for two basic and most commonly studied families of molecular graphs, benzenoid systems and carbon nanotubes. The obtained method is then used to find a closed formula for the Wiener polarity index of any benzenoid system. Moreover, we also compute this index for zig-zag and armchair nanotubes.' url='http://arxiv.org/abs/1711.03600v1' relevance_score=0.9500000000000001 impact_score=0.0",
  "title='Formula for calculating the Wiener polarity index with applications to benzenoid graphs and phenylenes' authors=['Niko Tratnik'] year=2018 venue='arXiv' doi=None arxiv_id='1801.05963' abstract='The Wiener polarity index of a graph is defined as the number of unordered pairs of vertices at distance three. In recent years, this topological index was extensively studied since it has many known applications in chemistry and also in network theory. In this paper, we generalize the result of Behmaram, Yousefi-Azari, and Ashrafi proved in 2012 for calculating the Wiener polarity index of a graph. An important advantage of our generalization is that it can be used for graphs that contain $4$-cycles and also for graphs whose different cycles have more than one common edge. In addition, using the main result a closed formula for the Wiener polarity index is derived for phenylenes and recalculated for catacondensed benzenoid graphs. The catacondensed benzenoid graphs and phenylenes attaining the extremal values with respect to the Wiener polarity index are also characterized.' url='http://arxiv.org/abs/1801.05963v2' relevance_score=0.9500000000000001 impact_score=0.0",
  "title='Towards the Solution of an Extremal Problem Concerning the Wiener Polarity Index of Alkanes' authors=['Sadia Noureen', 'Akhlaq Ahmad Bhatti', 'Akbar Ali'] year=2020 venue='arXiv' doi=None arxiv_id='2007.12930' abstract='The Wiener polarity index $W_p$, one of the most studied molecular structure descriptors, was devised by the chemist Harold Wiener for predicting the boiling points of alkanes. The index $W_p$ for chemical trees (chemical graphs representing alkanes) is defined as the number of unordered pairs of vertices at distance 3. A vertex of a chemical tree with the degree at least 3 is called a branching vertex. A segment of a chemical tree $T$ is a path-subtree $S$ whose terminal vertices have degrees different from 2 in $T$ and every internal vertex (if exists) of $S$ has degree 2 in $T$. In this paper, the best possible sharp upper and lower bounds on the Wiener polarity index $W_p$ are derived for the chemical trees of order $n$ with a given number of branching vertices or segments, and the corresponding extremal chemical trees are characterized. As a consequence of the derived results, an open problem concerning the maximal $W_p$ value of chemical trees with a fixed number of segments or branching vertices is solved.' url='http://arxiv.org/abs/2007.12930v1' relevance_score=0.9500000000000001 impact_score=0.0",
  "title='On Wiener polarity index of bicyclic networks' authors=['Jing Ma', 'Yongtang Shi', 'Zhen Wang', 'Jun Yue'] year=2016 venue='Scientific Reports' doi='10.1038/srep19066' arxiv_id=None abstract='<jats:title>Abstract</jats:title><jats:p>Complex networks are ubiquitous in biological, physical and social sciences. Network robustness research aims at finding a measure to quantify network robustness. A number of Wiener type indices have recently been incorporated as distance-based descriptors of complex networks. Wiener type indices are known to depend both on the network’s number of nodes and topology. The Wiener polarity index is also related to the cluster coefficient of networks. In this paper, based on some graph transformations, we determine the sharp upper bound of the Wiener polarity index among all bicyclic networks. These bounds help to understand the underlying quantitative graph measures in depth.</jats:p>' url='https://doi.org/10.1038/srep19066' relevance_score=0.9500000000000001 impact_score=0.0",
  "title='The Alkanes with Maximum Wiener Polarity Index' authors=['Zhibin Du', 'Akbar Ali'] year=2019 venue='Molecular Informatics' doi='10.1002/minf.201800076' arxiv_id=None abstract='<jats:title>Abstract</jats:title><jats:p>The Wiener polarity index (usually denoted by <jats:inline-graphic xmlns:xlink=\"http://www.w3.org/1999/xlink\" xlink:href=\"graphic/minf201800076-math-0001.png\" xlink:title=\"urn:x-wiley:18681743:media:minf201800076:minf201800076-math-0001\"/>\\n) of an alkane is the number of unordered pairs of carbon atoms which are separated by three carbon–carbon bonds. This topological index <jats:inline-graphic xmlns:xlink=\"http://www.w3.org/1999/xlink\" xlink:href=\"graphic/minf201800076-math-0002.png\" xlink:title=\"urn:x-wiley:18681743:media:minf201800076:minf201800076-math-0002\"/>\\n is useful for predicting the boiling points of alkanes. Deng [MATCH Commun. Math. Comput. Chem. 66 (2011) 305] proved that the maximum <jats:inline-graphic xmlns:xlink=\"http://www.w3.org/1999/xlink\" xlink:href=\"graphic/minf201800076-math-0003.png\" xlink:title=\"urn:x-wiley:18681743:media:minf201800076:minf201800076-math-0003\"/>\\n value among all alkanes, with <jats:italic>n</jats:italic> carbon atoms, is <jats:inline-graphic xmlns:xlink=\"http://www.w3.org/1999/xlink\" xlink:href=\"graphic/minf201800076-math-0004.png\" xlink:title=\"urn:x-wiley:18681743:media:minf201800076:minf201800076-math-0004\"/>\\n. The main purpose of present paper is to find all those alkanes with <jats:italic>n</jats:italic> carbon atoms, which attain the maximum value of <jats:inline-graphic xmlns:xlink=\"http://www.w3.org/1999/xlink\" xlink:href=\"graphic/minf201800076-math-0005.png\" xlink:title=\"urn:x-wiley:18681743:media:minf201800076:minf201800076-math-0005\"/>\\n.</jats:p>' url='https://doi.org/10.1002/minf.201800076' relevance_score=0.9500000000000001 impact_score=0.0",
  "title='Ordering chemical unicyclic graphs by Wiener polarity index' authors=['Ali Ghalavand', 'Ali R. Ashrafi'] year=2019 venue='International Journal of Quantum Chemistry' doi='10.1002/qua.25973' arxiv_id=None abstract='<jats:title>Abstract</jats:title><jats:p>Suppose <jats:italic>G</jats:italic> is a chemical graph with vertex set <jats:italic>V</jats:italic>(<jats:italic>G</jats:italic>). Define <jats:italic>D</jats:italic>(<jats:italic>G</jats:italic>) = {{<jats:italic>u</jats:italic>, <jats:italic>v</jats:italic>}\\u2009⊆\\u2009<jats:italic>V</jats:italic> (<jats:italic>G</jats:italic>) | <jats:italic>d</jats:italic><jats:sub>\\n<jats:italic>G</jats:italic>\\n</jats:sub>(<jats:italic>u</jats:italic>, <jats:italic>v</jats:italic>) = 3}, where <jats:italic>d</jats:italic><jats:sub>\\n<jats:italic>G</jats:italic>\\n</jats:sub>(<jats:italic>u</jats:italic>, <jats:italic>v</jats:italic>) denotes the length of the shortest path between <jats:italic>u</jats:italic> and <jats:italic>v</jats:italic>. The Wiener polarity index of <jats:italic>G</jats:italic>, <jats:italic>W</jats:italic><jats:sub>\\n<jats:italic>p</jats:italic>\\n</jats:sub>(<jats:italic>G</jats:italic>), is defined as the size of <jats:italic>D</jats:italic>(<jats:italic>G</jats:italic>). In this article, an ordering of chemical unicyclic graphs of order <jats:italic>n</jats:italic> with respect to the Wiener polarity index is given.</jats:p>' url='https://doi.org/10.1002/qua.25973' relevance_score=0.9500000000000001 impact_score=0.0",
  "title='Wiener Polarity Index of Cycle-Block Graphs' authors=['Zhen Jia', 'Fuyi Wei', 'Yang Wu'] year=2014 venue='Chinese Journal of Mathematics' doi='10.1155/2014/476705' arxiv_id=None abstract='<jats:p>The Wiener polarity index <mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"M1\"><mml:mrow><mml:msub><mml:mrow><mml:mi>W</mml:mi></mml:mrow><mml:mrow><mml:mi>P</mml:mi></mml:mrow></mml:msub></mml:mrow></mml:math> of a graph <mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"M2\"><mml:mrow><mml:mi>G</mml:mi></mml:mrow></mml:math> is the number of unordered pairs of vertices <mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"M3\"><mml:mi>u</mml:mi><mml:mo>,</mml:mo><mml:mi>v</mml:mi></mml:math> of <mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"M4\"><mml:mrow><mml:mi>G</mml:mi></mml:mrow></mml:math> such that the distance <mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"M5\"><mml:msub><mml:mrow><mml:mi>d</mml:mi></mml:mrow><mml:mrow><mml:mi>G</mml:mi></mml:mrow></mml:msub><mml:mo stretchy=\"false\">(</mml:mo><mml:mi>u</mml:mi><mml:mo>,</mml:mo><mml:mi>\\xa0</mml:mi><mml:mi>v</mml:mi><mml:mo stretchy=\"false\">)</mml:mo></mml:math> between <mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"M6\"><mml:mrow><mml:mi>u</mml:mi></mml:mrow></mml:math> and <mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"M7\"><mml:mrow><mml:mi>v</mml:mi></mml:mrow></mml:math> is 3. Cycle-block graph is a connected graph in which every block is a cycle. In this paper, we determine the maximum and minimum Wiener polarity index of cycle-block graphs and describe their extremal graphs; the extremal graphs of 4-<jats:italic>uniform</jats:italic> cactus with respect to Wiener polarity index are also discussed.</jats:p>' url='https://doi.org/10.1155/2014/476705' relevance_score=0.9500000000000001 impact_score=0.0",
  "title='The Wiener polarity index of molecular graphs of alkanes with a given number of methyl groups' authors=['Hanyuan Deng', 'Hui Xiao'] year=2010 venue='Journal of the Serbian Chemical Society' doi='10.2298/jsc100320114d' arxiv_id=None abstract='<jats:p>The Wiener polarity index of a graph G is the number of unordered pairs of\\n   vertices {u, v} of G such that the distance between u and v is equal to 3. In\\n   this paper, the maximum Wiener polarity index of molecular graphs of alkanes\\n   with a given number of methyl groups is studied.</jats:p>' url='https://doi.org/10.2298/jsc100320114d' relevance_score=0.9500000000000001 impact_score=0.0",
  "title='On the Extremal Wiener Polarity Index of Hückel Graphs' authors=['Hongzhuan Wang'] year=2016 venue='Computational and Mathematical Methods in Medicine' doi='10.1155/2016/3873597' arxiv_id=None abstract='<jats:p>Graphs are used to model chemical compounds and drugs. In the graphs, each vertex represents an atom of molecule and edges between the corresponding vertices are used to represent covalent bounds between atoms. The<jats:italic>Wiener polarity index</jats:italic><mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"M1\"><mml:msub><mml:mrow><mml:mi>W</mml:mi></mml:mrow><mml:mrow><mml:mi>p</mml:mi></mml:mrow></mml:msub><mml:mo stretchy=\"false\">(</mml:mo><mml:mi>G</mml:mi><mml:mo stretchy=\"false\">)</mml:mo></mml:math>of a graph<mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"M2\"><mml:mrow><mml:mi>G</mml:mi></mml:mrow></mml:math>is the number of unordered pairs of vertices<mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"M3\"><mml:mi>u</mml:mi><mml:mo>,</mml:mo><mml:mi>v</mml:mi></mml:math>of<mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"M4\"><mml:mrow><mml:mi>G</mml:mi></mml:mrow></mml:math>such that the distance between<mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"M5\"><mml:mrow><mml:mi>u</mml:mi></mml:mrow></mml:math>and<mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"M6\"><mml:mrow><mml:mi>v</mml:mi></mml:mrow></mml:math>is equal to 3. The trees and unicyclic graphs with perfect matching, of which all vertices have degrees not greater than three, are referred to as the<jats:italic>Hückel trees</jats:italic>and<jats:italic>unicyclic Hückel graphs</jats:italic>, respectively. In this paper, we first consider the smallest and the largest Wiener polarity index among all Hückel trees on<mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"M7\"><mml:mn mathvariant=\"normal\">2</mml:mn><mml:mi>n</mml:mi></mml:math>vertices and characterize the corresponding extremal graphs. Then we obtain an upper and lower bound for the Wiener polarity index of unicyclic Hückel graphs on<mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"M8\"><mml:mn mathvariant=\"normal\">2</mml:mn><mml:mi>n</mml:mi></mml:math>vertices.</jats:p>' url='https://doi.org/10.1155/2016/3873597' relevance_score=0.9500000000000001 impact_score=0.0",
  "title='On <i>k</i>-total distance degrees and <i>k</i>-total Wiener polarity index' authors=['Süleyman Ediz', 'İdris Çiftçi', 'Murat Cancan', 'Mohammad Reza Farahani'] year=2021 venue='Journal of Information and Optimization Sciences' doi='10.1080/02522667.2021.1896652' arxiv_id=None abstract='' url='https://doi.org/10.1080/02522667.2021.1896652' relevance_score=0.8200000000000001 impact_score=0.0",
  "title='On Wiener index and Wiener polarity index of some polyomino chains' authors=['Sarfraz Ahmad', 'Hafiz Muhammad Afzal Siddiqui', 'Arfan Ali', 'Mohammad R. Farahani', 'Muhammad Imran', 'Ismail Naci Cangul'] year=2019 venue='Journal of Discrete Mathematical Sciences and Cryptography' doi='10.1080/09720529.2019.1688965' arxiv_id=None abstract='' url='https://doi.org/10.1080/09720529.2019.1688965' relevance_score=0.8 impact_score=0.0",
  "title='On the generalized Wiener polarity index for some classes of graphs' authors=['Halina Bielak', 'Kinga Dąbrowska', 'Katarzyna Wolska'] year=2015 venue='Annals of Computer Science and Information Systems' doi='10.15439/2015f340' arxiv_id=None abstract='' url='https://doi.org/10.15439/2015f340' relevance_score=0.8 impact_score=0.0",
  "title='An exact formulas for the Wiener polarity index of nanostar dendrimers' authors=['Mehdi Alaeiyan', 'Farkhanda Afzal', 'Mohammad R. Farahani', 'Mohammad Ali Rostami'] year=2020 venue='Journal of Information and Optimization Sciences' doi='10.1080/02522667.2020.1748274' arxiv_id=None abstract='' url='https://doi.org/10.1080/02522667.2020.1748274' relevance_score=0.8 impact_score=0.0",
  "title='Sufficient Conditions for Wiener Index, Hyper-Wiener Index and Harary Index of the Hamilton Graph' authors=['Jiangyi Liu'] year=2025 venue='Mathematics and Computer Science' doi='10.11648/j.mcs.20251001.12' arxiv_id=None abstract='<jats:p xml:lang=\"en\">The topological index can be used to depict the structural properties of graphs, and the Hamiltonian problem of graphs has always been a classical problem in graph theory. In this work, we use some known conditions to give some sufficient conditions for Hamilton graphs by the Wiener index, Hyper-Wiener index and Harary index of a graph.</jats:p>' url='https://doi.org/10.11648/j.mcs.20251001.12' relevance_score=0.6000000000000001 impact_score=0.0",
  "title='Wiener polarity index of dendrimers' authors=['Guoliang Liu', 'Guodong Liu'] year=2018 venue='Applied Mathematics and Computation' doi='10.1016/j.amc.2017.11.038' arxiv_id=None abstract='' url='https://doi.org/10.1016/j.amc.2017.11.038' relevance_score=0.6 impact_score=0.0",
  "title='The Nordhaus–Gaddum-type inequality for the Wiener polarity index' authors=['Yanhong Zhang', 'Yumei Hu'] year=2016 venue='Applied Mathematics and Computation' doi='10.1016/j.amc.2015.10.045' arxiv_id=None abstract='' url='https://doi.org/10.1016/j.amc.2015.10.045' relevance_score=0.6 impact_score=0.0",
  "title='Wiener polarity index of fullerenes and hexagonal systems' authors=['A. Behmaram', 'H. Yousefi-Azari', 'A.R. Ashrafi'] year=2012 venue='Applied Mathematics Letters' doi='10.1016/j.aml.2012.01.006' arxiv_id=None abstract='' url='https://doi.org/10.1016/j.aml.2012.01.006' relevance_score=0.6 impact_score=0.0",
  "title='The inverse Wiener polarity index problem for chemical trees' authors=['Zhibin Du', 'Akbar Ali'] year=2018 venue='PLOS ONE' doi='10.1371/journal.pone.0197142' arxiv_id=None abstract='' url='https://doi.org/10.1371/journal.pone.0197142' relevance_score=0.6 impact_score=0.0",
  "title='Ordering chemical trees by Wiener polarity index' authors=['Ali Reza Ashrafi', 'Ali Ghalavand'] year=2017 venue='Applied Mathematics and Computation' doi='10.1016/j.amc.2017.06.005' arxiv_id=None abstract='' url='https://doi.org/10.1016/j.amc.2017.06.005' relevance_score=0.6 impact_score=0.0",
  "title='The maximum Wiener polarity index of unicyclic graphs' authors=['Huoquan Hou', 'Bolian Liu', 'Yufei Huang'] year=2012 venue='Applied Mathematics and Computation' doi='10.1016/j.amc.2012.03.090' arxiv_id=None abstract='' url='https://doi.org/10.1016/j.amc.2012.03.090' relevance_score=0.6 impact_score=0.0",
  "title='A note on chemical trees with minimum Wiener polarity index' authors=['Akbar Ali', 'Zhibin Du', 'Muhammad Ali'] year=2018 venue='Applied Mathematics and Computation' doi='10.1016/j.amc.2018.04.051' arxiv_id=None abstract='' url='https://doi.org/10.1016/j.amc.2018.04.051' relevance_score=0.6 impact_score=0.0",
  "title='On the Wiener polarity index of trees with maximum degree or given number of leaves' authors=['Bolian Liu', 'Huoquan Hou', 'Yufei Huang'] year=2010 venue='Computers &amp; Mathematics with Applications' doi='10.1016/j.camwa.2010.07.045' arxiv_id=None abstract='' url='https://doi.org/10.1016/j.camwa.2010.07.045' relevance_score=0.6 impact_score=0.0",
  "title='Determination of wiener polarity index from reduced distance matrix and molecular structure of drugs-A theoretical approach' authors=['M. Yamuna', 'T. Divya'] year=2018 venue='Research Journal of Pharmacy and Technology' doi='10.5958/0974-360x.2018.00392.x' arxiv_id=None abstract='' url='https://doi.org/10.5958/0974-360x.2018.00392.x' relevance_score=0.6 impact_score=0.0",
  "title='The maximum Wiener polarity index of trees with <mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" altimg=\"si2.gif\" display=\"inline\" overflow=\"scroll\"><mml:mi>k</mml:mi></mml:math> pendants' authors=['Hanyuan Deng', 'Hui Xiao'] year=2010 venue='Applied Mathematics Letters' doi='10.1016/j.aml.2010.02.013' arxiv_id=None abstract='' url='https://doi.org/10.1016/j.aml.2010.02.013' relevance_score=0.6 impact_score=0.0",
  "title='On the Wiener polarity index of graphs' authors=['Hongbo Hua', 'Kinkar Ch. Das'] year=2016 venue='Applied Mathematics and Computation' doi='10.1016/j.amc.2016.01.043' arxiv_id=None abstract='' url='https://doi.org/10.1016/j.amc.2016.01.043' relevance_score=0.6 impact_score=0.0",
  "title='Third Smallest Wiener Polarity Index of Unicyclic Graphs' authors=['Wei Fang', 'Muhan Ma', 'FuYuan Chen', 'Hufeng Dong'] year=2020 venue='Frontiers in Physics' doi='10.3389/fphy.2020.553261' arxiv_id=None abstract='' url='https://doi.org/10.3389/fphy.2020.553261' relevance_score=0.6 impact_score=0.0",
  "title='On the Wiener Polarity Index of Lattice Networks' authors=['Lin Chen', 'Tao Li', 'Jinfeng Liu', 'Yongtang Shi', 'Hua Wang'] year=2016 venue='PLOS ONE' doi='10.1371/journal.pone.0167075' arxiv_id=None abstract='' url='https://doi.org/10.1371/journal.pone.0167075' relevance_score=0.6 impact_score=0.0",
  "title='Wiener polarity and Wiener index of double generalized Petersen graph' authors=['Tanveer Iqbal', 'Syed Ahtsham Ul Haq Bokhary', 'Ghulam Abbas', 'Jamel Baili', 'Hijaz Ahmad', 'Hafsah Tabassum', 'Saqib Murtaza', 'Zubair Ahmad', 'Xiao-Zhong Zhang'] year=2023 venue='Journal of King Saud University - Science' doi='10.1016/j.jksus.2023.102680' arxiv_id=None abstract='' url='https://doi.org/10.1016/j.jksus.2023.102680' relevance_score=0.56 impact_score=0.0",
  "title='Some Aspects of the Wiener Index for Sun Graphs' authors=['Mohamed Amine Boutiche'] year=2016 venue='arXiv' doi=None arxiv_id='1603.06099' abstract='The Wiener index $W(G)$ is the sum of distances of all pairs of vertices of the graph $G$. The Wiener polarity index $W_{p}(G)$ of a graph $G$ is the number of unordered pairs of vertices $u$ and $v$ of $G$ such that the distance $d_{G}(u,v)$ between $u$ and $v$ is $3$. In this paper the Wiener and the Wiener polarity indices of sun graphs are computed. A relationship between those indices with some other topological indices are presented. Finally, we find the Hosoya (Wiener) polynomial for sun graphs.' url='http://arxiv.org/abs/1603.06099v1' relevance_score=0.55 impact_score=0.0",
  "title='COMPUTATION OF WIENER INDEX, RECIPROCAL WIENER INDEX AND PERIPHERAL WIENER INDEX USING ADJACENCY MATRIX' authors=['R. Rajendra', 'P. Siva Kota Reddy', 'M. Prabhavathi'] year=2022 venue='South East Asian J. of Mathematics and Mathematical Sciences' doi='10.56827/seajmms.2022.1803.23' arxiv_id=None abstract='<jats:p>In this short paper, we establish formulae to compute Wiener index, reciprocal Wiener index and peripheral Wiener index of graphs using adjacency matrix. Further, we present algorithms for the same</jats:p>' url='https://doi.org/10.56827/seajmms.2022.1803.23' relevance_score=0.54 impact_score=0.0",
  "title='Algorithms for Computing Wiener Indices of Acyclic and Unicyclic Graphs' authors=['Bo Bi', 'Muhammad Kamran Jamil', 'Khawaja Muhammad Fahd', 'Tian-Le Sun', 'Imran Ahmad', 'Lei Ding'] year=2018 venue='arXiv' doi=None arxiv_id='1801.05146' abstract='Let $G=(V(G),E(G))$ be a molecular graph, where $V(G)$ and $E(G)$ are the sets of vertices (atoms) and edges (bonds). A topological index of a molecular graph is a numerical quantity which helps to predict the chemical/physical properties of the molecules. The Wiener, Wiener polarity and the terminal Wiener indices are the distance based topological indices. In this paper, we described a linear time algorithm {\\\\bf(LTA)} that computes the Wiener index for acyclic graphs and extended this algorithm for unicyclic graphs. The same algorithms are modified to compute the terminal Wiener index and the Wiener polarity index. All these algorithms compute the indices in time $O(n)$.' url='http://arxiv.org/abs/1801.05146v2' relevance_score=0.45 impact_score=0.0",
  "title='Wiener Index of Some Thorn Graphs' authors=[] year=2015 venue='International Journal of Science and Research (IJSR)' doi='10.21275/v4i11.nov151680' arxiv_id=None abstract='' url='https://doi.org/10.21275/v4i11.nov151680' relevance_score=0.4 impact_score=0.0",
  "title='The Wiener index, the hyper-Wiener index and the degree distance index of the corona Cm.Cn' authors=['Mohamed Essalih', 'Mohamed El Marraki', 'Abd Errahmane Atmani'] year=2014 venue='Applied Mathematical Sciences' doi='10.12988/ams.2014.43202' arxiv_id=None abstract='' url='https://doi.org/10.12988/ams.2014.43202' relevance_score=0.4 impact_score=0.0",
  "title='On the Wiener index and the hyper-Wiener index of the Kragujevac trees' authors=['Abbas Heydari'] year=2023 venue='Proyecciones (Antofagasta)' doi='10.22199/issn.0717-6279-4804' arxiv_id=None abstract='<jats:p>In this paper, the Wiener index and the hyper-Wiener index of the Kragujevac trees is computed in term of its vertex degrees. As application, we obtain an upper bond and a lower bound for the Wiener index and the hyper-Wiener index of these trees.</jats:p>' url='https://doi.org/10.22199/issn.0717-6279-4804' relevance_score=0.36 impact_score=0.0",
  "title='Predominant polarity, polarity index, and treatment selection in bipolar disorder' authors=['Sabrina C. da Costa', 'Joao L. de Quevedo', 'André F. Carvalho'] year=2017 venue='Oxford Medicine Online' doi='10.1093/med/9780198748625.003.0015' arxiv_id=None abstract='<p>Bipolar disorder (BD) is a chronic and disabling illness, with lifetime prevalence of 2.4% worldwide. Predominant polarity (PP), ie, depressive versus manic, may influence illness characteristics, treatment selection, and outcomes in BD. PP has been proposed as a course specifier for BD, although not included in the <italic>Diagnostic and Statistical Manual of Mental Disorders</italic> (5th edn) (DSM-5). The polarity index (PI), a metric algorithm that reflects antimanic versus antidepressant maintenance efficacy of available treatments for BD, is calculated as the ratio of number needed to treat (NNT) for prevention of depression and NNT for prevention of mania. Evidence indicates that the net PI of ongoing maintenance-treatment regimens for BD is related to the patient’s PP. Additionatlly, PP and PI may aid in treatment selection and outcome prediction in BD. Therefore, this chapter provides an overview of putative roles of PP and PI in the course and treatment selection for BD.</p>' url='https://doi.org/10.1093/med/9780198748625.003.0015' relevance_score=0.3 impact_score=0.0",
  "title='Figure 6: Shannon–Wiener index of river fauna diversity.' authors=[] year=2023 venue='' doi='10.7717/peerj.12224/fig-6' arxiv_id=None abstract='' url='https://doi.org/10.7717/peerj.12224/fig-6' relevance_score=0.26 impact_score=0.0",
  "title='Figure 4: The Shannon-Wiener index (A) and the Simpson index of different repair types (B).' authors=[] year=2023 venue='' doi='10.7717/peerj.19854/fig-4' arxiv_id=None abstract='' url='https://doi.org/10.7717/peerj.19854/fig-4' relevance_score=0.26 impact_score=0.0",
  "title='Corrigendum on Wiener Index, Zagreb Indices and Harary Index of Eulerian Graphs' authors=['Stijn Cambie'] year=2023 venue='' doi='10.2139/ssrn.4578445' arxiv_id=None abstract='' url='https://doi.org/10.2139/ssrn.4578445' relevance_score=0.26 impact_score=0.0",
  "title='The Wiener Index and the Wiener Complexity of the Zero-Divisor Graph of a Finite Semisimple Ring' authors=['David Dolzan'] year=2023 venue='' doi='10.2139/ssrn.4346337' arxiv_id=None abstract='' url='https://doi.org/10.2139/ssrn.4346337' relevance_score=0.26 impact_score=0.0",
  "title='Polarity Index Method' authors=[] year=2016 venue='Polarity Index in Proteins - A Bioinformatics Tool' doi='10.2174/9781681082691116010007' arxiv_id=None abstract='' url='https://doi.org/10.2174/9781681082691116010007' relevance_score=0.2 impact_score=0.0",
  "title='Hyper-Wiener Index vs. Wiener Index. Two Highly Correlated Structure-Descriptors' authors=['Ivan Gutman', 'Boris Furtula'] year=2003 venue='Monatshefte für Chemie - Chemical Monthly' doi='10.1007/s00706-003-0003-7' arxiv_id=None abstract='' url='https://doi.org/10.1007/s00706-003-0003-7' relevance_score=0.2 impact_score=0.0",
  "title='Polarity Index in Proteins - A Bioinformatics Tool' authors=[] year=2016 venue='' doi='10.2174/97816810826911160101' arxiv_id=None abstract='' url='https://doi.org/10.2174/97816810826911160101' relevance_score=0.2 impact_score=0.0",
  "title='Computing Wiener Polynomial, Wiener Index and Hyper Wiener Index of C<sub>80</sub>Fullerene by GAP Program' authors=['Ali Iranmanesh', 'Y. Alizadeh', 'S. Mirzaie'] year=2009 venue='Fullerenes, Nanotubes and Carbon Nanostructures' doi='10.1080/15363830903133204' arxiv_id=None abstract='' url='https://doi.org/10.1080/15363830903133204' relevance_score=0.2 impact_score=0.0",
  "title='Subject Index' authors=[] year=2016 venue='Polarity Index in Proteins - A Bioinformatics Tool' doi='10.2174/9781681082691116010019' arxiv_id=None abstract='' url='https://doi.org/10.2174/9781681082691116010019' relevance_score=0.1 impact_score=0.0",
  "title='Index' authors=[] year=1944 venue='Process and Polarity' doi='10.7312/shel92432-007' arxiv_id=None abstract='' url='https://doi.org/10.7312/shel92432-007' relevance_score=0.1 impact_score=0.0",
  "title='PubMed Paper 30091531' authors=['Unknown'] year=2023 venue='PubMed' doi=None arxiv_id=None abstract='Abstract would be fetched from additional API call' url='https://pubmed.ncbi.nlm.nih.gov/30091531/' relevance_score=0.06000000000000001 impact_score=0.0",
  "title='PubMed Paper 29750800' authors=['Unknown'] year=2023 venue='PubMed' doi=None arxiv_id=None abstract='Abstract would be fetched from additional API call' url='https://pubmed.ncbi.nlm.nih.gov/29750800/' relevance_score=0.06000000000000001 impact_score=0.0",
  "title='PubMed Paper 27930705' authors=['Unknown'] year=2023 venue='PubMed' doi=None arxiv_id=None abstract='Abstract would be fetched from additional API call' url='https://pubmed.ncbi.nlm.nih.gov/27930705/' relevance_score=0.06000000000000001 impact_score=0.0",
  "title='PubMed Paper 27247613' authors=['Unknown'] year=2023 venue='PubMed' doi=None arxiv_id=None abstract='Abstract would be fetched from additional API call' url='https://pubmed.ncbi.nlm.nih.gov/27247613/' relevance_score=0.06000000000000001 impact_score=0.0",
  "title='PubMed Paper 26750820' authors=['Unknown'] year=2023 venue='PubMed' doi=None arxiv_id=None abstract='Abstract would be fetched from additional API call' url='https://pubmed.ncbi.nlm.nih.gov/26750820/' relevance_score=0.06000000000000001 impact_score=0.0"
]