[
  "title='Computing the edge metric dimension of convex polytopes related graphs' authors=['M. Ahsan', 'Zohaib Zahid', 'Sohail Zafar', 'A. Rafiq', 'M. Sindhu', 'M. Umar'] year=2020 venue='Journal of Mathematics and Computer Science' doi='10.22436/jmcs.022.02.08' arxiv_id=None abstract='Let G = ( V ( G ) , E ( G )) be a connected graph and d ( f , y ) denotes the distance between edge f and vertex y , which is deﬁned as d ( f , y ) = min { d ( p , y ) , d ( q , y ) } , where f = pq . A subset W E ⊆ V ( G ) is called an edge metric generator for graph G if for every two distinct edges f 1 , f 2 ∈ E ( G ) , there exists a vertex y ∈ W E such that d ( f 1 , y ) (cid:54) = d ( f 2 , y ) . An edge metric generator with minimum number of vertices is called an edge metric basis for graph G and the cardinality of an edge metric basis is called the edge metric dimension represented by edim ( G ) . In this paper, we study the edge metric dimension of ﬂower graph f n × 3 and also calculate the edge metric dimension of the prism related graphs D (cid:48) n and D tn . It has been concluded that the edge metric dimension of D (cid:48) n is bounded, while of f n × 3 and D tn is unbounded.' url='https://www.semanticscholar.org/paper/4c96a6ca83f5a2ec2f078090051efa1c027d24b2' relevance_score=0.95 impact_score=41.0",
  "title='Fault-tolerant edge metric dimension of certain families of graphs' authors=['Xiaogang Liu', 'M. Ahsan', 'Zohaib Zahid', 'Shuili Ren'] year=2021 venue='AIMS Mathematics' doi='10.3934/math.2021069' arxiv_id=None abstract='Let $W_E=\\\\{w_1,w_2, \\\\ldots,w_k\\\\}$ be an ordered set of vertices of graph $G$ and let $e$ be an edge of $G$. Suppose $d(x,e)$ denotes distance between edge $e$ and vertex $x$ of $G$, defined as $d(e,x) = d(x,e) = \\\\min \\\\{d(x,a),d(x,b)\\\\}$, where $e=ab$. A vertex $x$ distinguishes two edges $e_1$ and $e_2$, if $d(e_1,x)\\\\neq d(e_2,x)$. The representation $r(e\\\\mid W_E)$ of $e$ with respect to $W_E$ is the k-tuple $(d(e,w_1),d(e,w_2), \\\\ldots,d(e,w_k))$. If distinct edges of $G$ have distinct representation with respect to $W_E$, then $W_E$ is called edge metric generator for $G$. An edge metric generator of minimum cardinality is an edge metric basis for $G$, and its cardinality is called edge metric dimension of $G$, denoted by $(G)$. In this paper, we initiate the study of fault-tolerant edge metric dimension. Let $\\\\acute{W}_E$ be edge metric generator of graph $G$, then $\\\\acute{W}_E$ is called fault-tolerant edge metric generator of $G$ if $\\\\acute{W}_E \\\\setminus \\\\{v \\\\}$ is also an edge metric generator of graph $G$ for every $v \\\\in \\\\acute{W}_E$. A fault-tolerant edge metric generator of minimum cardinality is a fault-tolerant edge metric basis for graph $G$, and its cardinality is called fault-tolerant edge metric dimension of $G$. We also computed the fault-tolerant edge metric dimension of path, cycle, complete graph, cycle with chord graph, tadpole graph and kayak paddle graph.' url='https://www.semanticscholar.org/paper/86c2bdab5729d698c60db8e6a1a0f1202406179f' relevance_score=0.77 impact_score=28.0",
  "title='Edge Metric Dimension and Edge Basis of One-Heptagonal Carbon Nanocone Networks' authors=['Karnika Sharma', 'V. K. Bhat', 'S. Sharma'] year=2022 venue='IEEE Access' doi='10.1109/ACCESS.2022.3158982' arxiv_id=None abstract='A molecular (chemical) graph is a simple connected graph, where the vertices represent the compound’s atoms and the edges represent bonds between the atoms, and the degree (valence) of every vertex (atom) is not more than four. In this paper, we determine the edge metric basis and edge metric dimension (EMD) of the complex molecular graph of a one-heptagonal carbon nanocone (<inline-formula> <tex-math notation=\"LaTeX\">$HCN_{7}(q)$ </tex-math></inline-formula>). We prove that only three non-adjacent vertices are the minimum requirement for the identification of all the edges in <inline-formula> <tex-math notation=\"LaTeX\">$HCN_{7}(q)$ </tex-math></inline-formula>, uniquely.' url='https://www.semanticscholar.org/paper/a2c8c9f3a5e8d036afcf0e5d93b17db83813d23b' relevance_score=0.7600000000000002 impact_score=7.0",
  "title='Edge metric basis and its fault tolerance over certain interconnection networks' authors=['S. Prabhu', 'T. J. Janany', 'M. Arulperumjothi', 'I.G. Yero'] year=2025 venue='J. Parallel Distributed Comput.' doi='10.1016/j.jpdc.2025.105141' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/09ae949612b61e8d0b0880faeb3ce87278bf3da9' relevance_score=0.74 impact_score=4.0",
  "title='Computing Edge Metric Dimension of One-Pentagonal Carbon Nanocone' authors=['S. Sharma', 'H. Raza', 'V. K. Bhat'] year=2021 venue='Frontiers of Physics' doi='10.3389/fphy.2021.749166' arxiv_id=None abstract='Minimum resolving sets (edge or vertex) have become an integral part of molecular topology and combinatorial chemistry. Resolving sets for a specific network provide crucial information required for the identification of each item contained in the network, uniquely. The distance between an edge e = cz and a vertex u is defined by d(e, u) = min{d(c, u), d(z, u)}. If d(e 1, u) ≠ d(e 2, u), then we say that the vertex u resolves (distinguishes) two edges e 1 and e 2 in a connected graph G. A subset of vertices R E in G is said to be an edge resolving set for G, if for every two distinct edges e 1 and e 2 in G we have d(e 1, u) ≠ d(e 2, u) for at least one vertex u ∈ R E . An edge metric basis for G is an edge resolving set with minimum cardinality and this cardinality is called the edge metric dimension edim(G) of G. In this article, we determine the edge metric dimension of one-pentagonal carbon nanocone (1-PCNC). We also show that the edge resolving set for 1-PCNC is independent.' url='https://www.semanticscholar.org/paper/25d60388ef4bccaea373ab6885eac941a5670fb2' relevance_score=0.7300000000000001 impact_score=16.0",
  "title='COVID antiviral drug structures and their edge metric dimension' authors=['Ibtisam Masmali', 'Muhammad Tanzeel Ali Kanwal', 'Muhammad Kamran Jamil', 'Ali Ahmad', 'M. Azeem', 'Ali N. A. Koam'] year=2023 venue='Molecular Physics' doi='10.1080/00268976.2023.2259508' arxiv_id=None abstract=\"The study of the characteristics and topologies of networks, including social, computer and biological networks, is known as graph theory. Numerous disciplines, such as epidemiology, which is the study of the transmission and management of infectious diseases like Covid-19, can benefit from the study of graph theory. Like, the first case of COVID-19 (Coronavirus) was reported in November of 2019; by the third week of April, 1,116,643 verified positive cases had been reported, with around 59,158 fatalities. All the meditational structures are symmetric, if we label to change the labels of graphs in either way the graph becomes symmetric and will be no change to it. So, there are many graph theoretical parameters to study the symmetric meditational structures, like metric and edge metric dimension. A notion known as edge metric dimension or edge metric basis states that with a chosen subset from the vertex set, known as the edge resolving set, the whole edge set of a structure uniquely recognised. This idea of vertices resolvability allows for the distinct identification of COVID antiviral medication structures and aids in the research of the structure's structural characteristics. The chosen resolving set and the computed edge metric dimension will be invariant due to the symmetry of the graphs. Arbidol, malaria, carboxylic, thalidomide and theaflavin are the names of these compounds which are discussed in this work. GRAPHICAL ABSTRACT\" url='https://www.semanticscholar.org/paper/a8193db0c9b7c3076d717f9ab044e98854bd3b44' relevance_score=0.6700000000000002 impact_score=6.0",
  "title='Fault-tolerant metric dimension of two-fold heptagonal-nonagonal circular ladder' authors=['S. Sharma', 'V. K. Bhat'] year=2021 venue='Discret. Math. Algorithms Appl.' doi='10.1142/S1793830921501329' arxiv_id=None abstract='The problem of characterizing the classes of plane graphs with the bounded metric dimension, edge metric dimension, and fault-tolerant metric dimension is of great interest nowadays. In this paper, we study the metric dimension, the fault-tolerant metric dimension, and the edge metric dimension of a two-fold heptagonal-nonagonal circular ladder (denoted by [Formula: see text]). We show that the metric dimension and the edge metric dimension of [Formula: see text] are the same. We also study its fault-tolerant metric dimension and prove that the metric basis and the edge metric basis sets are independent.' url='https://www.semanticscholar.org/paper/d2340629e49db997e91f2cc855c30bfba85e8867' relevance_score=0.67 impact_score=21.0",
  "title='Investigating Metric and Edge Metric Resolvability in Molecular Structures of Breast Cancer Therapeutics' authors=['E. Pandeeswari', 'J. Ravi Sankar'] year=2025 venue='Malaysian Journal of Mathematical Sciences' doi='10.47836/mjms.19.3.16' arxiv_id=None abstract='<jats:p>Using graph theory as a conceptual framework, chemical graph theory investigates chemical structures and phenomena. Chemical graphs, with edges and vertices representing bonds and atoms, respectively, are used in chemical graph theory to represent molecular structures. The investigation of various pharmacological substances and complex molecular structures is made easier by the application of chemical graph theory. The resolvability parameter, a measure derived from graph theory, is a fundamental idea in this discipline. It requires every vertex in a structure to have a unique representation through chosen vertices, which are referred to as a metric basis, locating set, or resolving set in various scientific contexts. A key factor in describing the structural characteristics of chemical graphs is the metric dimension, which is the smallest number of vertices in the resolving set. In this work, we looked at the vertex and edge metric dimensions of the drug structures for the treatment of breast cancer, including Toremifene, Ribociclib, Tucatinib, Olaparib, and Abemaciclib and also we estimated the dimensions of the vertex and edge metrics while treating various drug structures as chemical graphs. This can make it easier to comprehend the chemical structure of different anti-breast cancer medications and create formulations more effectively.</jats:p>' url='https://doi.org/10.47836/mjms.19.3.16' relevance_score=0.6500000000000001 impact_score=0.0",
  "title='Edge metric dimension of some classes of circulant graphs' authors=['M. Ahsan', 'Zohaib Zahid', 'Sohail Zafar'] year=2020 venue='' doi='10.2478/auom-2020-0032' arxiv_id=None abstract='Abstract Let G = (V (G), E(G)) be a connected graph and x, y ∈ V (G), d(x, y) = min{ length of x − y path } and for e ∈ E(G), d(x, e) = min{d(x, a), d(x, b)}, where e = ab. A vertex x distinguishes two edges e1 and e2, if d(e1, x) ≠ d(e2, x). Let WE = {w1, w2, . . ., wk} be an ordered set in V (G) and let e ∈ E(G). The representation r(e | WE) of e with respect to WE is the k-tuple (d(e, w1), d(e, w2), . . ., d(e, wk)). If distinct edges of G have distinct representation with respect to WE, then WE is called an edge metric generator for G. An edge metric generator of minimum cardinality is an edge metric basis for G, and its cardinality is called edge metric dimension of G, denoted by edim(G). The circulant graph Cn(1, m) has vertex set {v1, v2, . . ., vn} and edge set {vivi+1 : 1 ≤ i ≤ n−1}∪{vnv1}∪{vivi+m : 1 ≤ i ≤ n−m}∪{vn−m+ivi : 1 ≤ i ≤ m}. In this paper, it is shown that the edge metric dimension of circulant graphs Cn(1, 2) and Cn(1, 3) is constant.' url='https://www.semanticscholar.org/paper/cdcc0acd614a3f7756cd6d37a4546e8e0f05ca13' relevance_score=0.64 impact_score=9.0",
  "title='On Symmetrical Convex Polytopes and their Edge Resolvability' authors=['S. Sharma'] year=2024 venue='Journal of Combinatorial Mathematics and Combinatorial Computing' doi='10.61091/jcmcc122-19' arxiv_id=None abstract='The \\\\textit{metric dimension} of a graph Γ = ( V , E ) , denoted by dim ( Γ ) , is the least cardinality of a set of vertices in Γ such that each vertex in Γ is determined uniquely by its vector of distances to the vertices of the chosen set. The topological distance between an edge ε = y z ∈ E and a vertex k ∈ V is defined as d ( ε , k ) = min { d ( z , k ) , d ( y , k ) } . A subset of vertices R Γ in V is called an edge resolving set for Γ if for each pair of different edges e 1 and e 2 in E , there is a vertex j ∈ R Γ such that d ( e 1 , j ) ≠ d ( e 2 , j ) . An edge resolving set with minimum cardinality is called the edge metric basis for Γ and this cardinality is the edge metric dimension of Γ , denoted by dim E ( Γ ) . In this article, we show that the cardinality of the minimum edge resolving set is three or four for two classes of convex polytopes ( S n and T n ) that exist in the literature.' url='https://www.semanticscholar.org/paper/775a7e88e4a9916934406bb81a37aff83fe0805b' relevance_score=0.63 impact_score=0.0",
  "title='The dominant edge metric dimension of graphs' authors=['M. Tavakoli', 'M. Korivand', 'A. Erfanian', 'Gholamreza Abrishami', 'E. Baskoro'] year=2023 venue='Electronic Journal of Graph Theory and Applications' doi='10.5614/ejgta.2023.11.1.16' arxiv_id=None abstract='For an ordered subset S = { v 1 , . . . , v k } of vertices in a connected graph G and an edge e ′ of G , the edge metric S -representation of e ′ = ab is the vector r eG ( e ′ | S ) = ( d G ( e ′ , v 1 ) , . . . , d G ( e ′ , v k )) , where d G ( e ′ , v i ) = min { d G ( a, v i ) , d G ( b, v i ) } . A dominant edge metric generator for G is a vertex cover S of G such that the edges of G have pairwise different edge metric S -representations. A dominant edge metric generator of smallest size of G is called a dominant edge metric basis for G . The size of a dominant edge metric basis of G is denoted by Ddim e ( G ) and is called the dominant edge metric dimension. In this paper, the concept of dominant edge metric dimension (DEMD for short) is introduced and its basic properties are studied. Moreover, NP-hardness of computing DEMD of connected graphs is proved. Furthermore, this invariant is investigated under some graph operations at the end of the paper.' url='https://www.semanticscholar.org/paper/12b9184b6000235ed015342cd8c4ac4e163f6e4f' relevance_score=0.6200000000000001 impact_score=1.0",
  "title='Edge metric dimensions of neighbourhood corona graph containing dominant vertices' authors=['N. M. Rosyidah', 'Rinurwati'] year=2021 venue='' doi='10.1088/1742-6596/1821/1/012017' arxiv_id=None abstract='Connected graph G = (V(G), E(G)) with V(G) = {υ1, υ2,..υ n } and a graph H and an ordered set Z = {z 1,z 2,…,z k} £ V( G) are given. The set Z, for which the representations of every two distinct edges e1, e2£E (G) with respect to Z are distinct, is called edge resolving set. The edge resolving set with minimum cardinality is called edge metric basis for G, its cardinality is called edge metric dimension of G, and is denoted by e d im( G). Let H 1, H 2,…,H n be copies of graph H. The neighbourhood corona between G and H, G*H, is obtained by taking G and |V(G)| copies of H, then making all vertices in the ith copy of H adjacent to all neighbours of v i £ V(G), with i £ { 1, 2,…,n}. In this paper, we determine and analyze edge metric dimensions of neighbourhood corona between G and H, edim(G*H), where G is a graph containing dominant vertices, that is G £ {K n , S n , F n , W n } and is graph k 1.' url='https://www.semanticscholar.org/paper/0d69dc8a67eb4d2951efce04984c497e529988d9' relevance_score=0.5900000000000001 impact_score=2.0",
  "title='Metric and Edge Metric Dimension of Zigzag Edge Coronoid Fused with Starphene' authors=['Sunny Kumar Sharma', 'Vijay Kumar Bhat', 'Hassan Raza', 'Karnika Sharma'] year=2021 venue='arXiv' doi=None arxiv_id='2107.14484' abstract='Let $Γ=(V,E)$ be a simple connected graph. $d(α,ε)=min\\\\{d(α, w), d(α, d\\\\}$ computes the distance between a vertex $α\\\\in V(Γ)$ and an edge $ε=wd\\\\in E(Γ)$. A single vertex $α$ is said to recognize (resolve) two different edges $ε_{1}$ and $ε_{2}$ from $E(Γ)$ if $d(α, ε_{2})\\\\neq d(α, ε_{1}\\\\}$. A subset of distinct ordered vertices $U_{E}\\\\subseteq V(Γ)$ is said to be an edge metric generator for $Γ$ if every pair of distinct edges from $Γ$ are recognized by some element of $U_{E}$. An edge metric generator with a minimum number of elements in it, is called an edge metric basis for $Γ$. Then, the cardinality of this edge metric basis of $Γ$, is called the edge metric dimension of $Γ$, denoted by $edim(Γ)$. The concept of studying chemical structures using graph theory terminologies is both appealing and practical. It enables chemical researchers to more precisely and easily examine various chemical topologies and networks. In this article, we investigate a fascinating cluster of organic chemistry as a result of this motivation. We consider a zigzag edge coronoid fused with starphene and find its minimum vertex and edge metric generators.' url='http://arxiv.org/abs/2107.14484v1' relevance_score=0.5700000000000001 impact_score=0.0",
  "title='The Nonlocal Metric Dimension of Some Convex Polytopes' authors=['Jinxia Liang', 'Chenxu Yang', 'Guixian Liu', 'Hongluan Zhao'] year=2025 venue='International Journal of Foundations of Computer Science' doi='10.1142/s0129054125500285' arxiv_id=None abstract='Let [Formula: see text] be a graph with the vertex set [Formula: see text] and the edge set [Formula: see text]. A vertex subset [Formula: see text] is called a nonlocal resolving set if and only if [Formula: see text] for [Formula: see text] and any [Formula: see text]. The nonlocal metric basis of [Formula: see text] is a nonlocal resolving set with minimum cardinality, and its cardinality is called the nonlocal metric dimension, denoted by [Formula: see text]. In this paper, we characterize the graphs with [Formula: see text], as a by-product, we study the nonlocal metric dimension of some convex polytope graphs.' url='https://www.semanticscholar.org/paper/79cef35c416eb9028b3a2ea09749a69654207960' relevance_score=0.55 impact_score=0.0",
  "title='Neural basis of topographical disorientation in the primate posterior cingulate gyrus based on a labeled graph' authors=['Yang Yu', 'Tsuyoshi Setogawa', 'Jumpei Matsumoto', 'Hiroshi Nishimaru', 'H. Nishijo'] year=2022 venue='AIMS Neuroscience' doi='10.3934/neuroscience.2022021' arxiv_id=None abstract='Patients with lesions in the posterior cingulate gyrus (PCG), including the retrosplenial cortex (RSC) and posterior cingulate cortex (PCC), cannot navigate in familiar environments, nor draw routes on a 2D map of the familiar environments. This suggests that the topographical knowledge of the environments (i.e., cognitive map) to find the right route to a goal is represented in the PCG, and the patients lack such knowledge. However, theoretical backgrounds in neuronal levels for these symptoms in primates are unclear. Recent behavioral studies suggest that human spatial knowledge is constructed based on a labeled graph that consists of topological connections (edges) between places (nodes), where local metric information, such as distances between nodes (edge weights) and angles between edges (node labels), are incorporated. We hypothesize that the population neural activity in the PCG may represent such knowledge based on a labeled graph to encode routes in both 3D environments and 2D maps. Since no previous data are available to test the hypothesis, we recorded PCG neuronal activity from a monkey during performance of virtual navigation and map drawing-like tasks. The results indicated that most PCG neurons responded differentially to spatial parameters of the environments, including the place, head direction, and reward delivery at specific reward areas. The labeled graph-based analyses of the data suggest that the population activity of the PCG neurons represents the distance traveled, locations, movement direction, and navigation routes in the 3D and 2D virtual environments. These results support the hypothesis and provide a neuronal basis for the labeled graph-based representation of a familiar environment, consistent with PCG functions inferred from the human clinicopathological studies.' url='https://www.semanticscholar.org/paper/ae153721b12c77fe94fdb1c01aad2188429d1f81' relevance_score=0.5 impact_score=1.0",
  "title='Bi-Edge Metric Dimension of Graphs' authors=['Rinurwati Rinurwati', 'Fadillah Dian Maharani'] year=2024 venue='International Journal of Computing Science and Applied Mathematics' doi='10.12962/j24775401.v10i1.20267' arxiv_id=None abstract='' url='https://doi.org/10.12962/j24775401.v10i1.20267' relevance_score=0.48000000000000004 impact_score=0.0",
  "title='Multiset and Mixed Metric Dimension for Starphene and Zigzag-Edge Coronoid' authors=['Jia-bao Liu', 'S. Sharma', 'V. K. Bhat', 'H. Raza'] year=2021 venue='Polycyclic aromatic compounds (Print)' doi='10.1080/10406638.2021.2019066' arxiv_id=None abstract='Abstract Let be a simple connected graph. A vertex a is said to recognize (resolve) two different elements b 1 and b 2 from if A subset of distinct ordered vertices is said to be a mixed metric generator for Γ if each pair of distinct elements from are recognized by some element of UM . The mixed metric generator with a minimum number of elements is called a mixed metric basis of Γ. Then, the cardinality of this mixed metric basis for Γ is called the mixed metric dimension of Γ, denoted by The concept of studying chemical structures using graph theory terminologies is both appealing and practical. It enables researchers to more precisely and easily examines various chemical topologies and networks. In this paper, we consider two well-known chemical structures; starphene and six-sided hollow coronoid and respectively compute their multiset dimension and mixed metric dimension.' url='https://www.semanticscholar.org/paper/0817cedef534d9cf73a0077dd5849f087f334485' relevance_score=0.46 impact_score=14.0",
  "title='Computing a metric basis of a bipartite distance-hereditary graph' authors=['Marina Moscarini'] year=2022 venue='Theoretical Computer Science' doi='10.1016/j.tcs.2021.11.015' arxiv_id=None abstract='' url='https://doi.org/10.1016/j.tcs.2021.11.015' relevance_score=0.44000000000000006 impact_score=0.0",
  "title='Adaptive Edge and Defect Detection as a basis for Automated Lumber Classification and Optimisation' authors=['Roman Louban'] year=2009 venue='Springer Series in Materials Science' doi='10.1007/978-3-642-00683-8_7' arxiv_id=None abstract='' url='https://doi.org/10.1007/978-3-642-00683-8_7' relevance_score=0.4 impact_score=0.0",
  "title='Kolmogorov–Smirnov-Based Edge Centrality Measure for Metric Graphs' authors=['Christina Durón', 'Hannah Kravitz', 'Moysey Brio'] year=2025 venue='Dynamics' doi='10.3390/dynamics5020016' arxiv_id=None abstract='<jats:p>In this work, we introduce an edge centrality measure for the Helmholtz equation on metric graphs, a particular flow network, based on spectral edge energy density. This measure identifies influential edges whose removal significantly changes the energy flow on the network, as indicated by statistically significant p-values from the two-sample Kolmogorov–Smirnov test comparing edge energy densities in the original network to those with a single edge removed. We compare the proposed measure with eight vertex centrality measures applied to a line graph representation of each metric graph, as well as with two edge centrality measures applied directly to each metric graph. Both methods are evaluated on two undirected and weighted metric graphs—a power grid network adapted from the IEEE 14-bus system and an approximation of Poland’s road network—both of which are multigraphs. Two experiments evaluate how each measure’s edge ranking impacts the energy flow on the network. The results demonstrate that the proposed measure effectively identifies influential edges in metric graphs that significantly change the energy distribution.</jats:p>' url='https://doi.org/10.3390/dynamics5020016' relevance_score=0.4 impact_score=0.0",
  "title='ON METRIC DIMENSION OF EDGE-CORONA GRAPHS' authors=['Rinurwati', 'Herry Suprajitno', 'Slamin'] year=2017 venue='Far East Journal of Mathematical Sciences (FJMS)' doi='10.17654/ms102050965' arxiv_id=None abstract='' url='https://doi.org/10.17654/ms102050965' relevance_score=0.4 impact_score=0.0",
  "title='Metric and edge-metric dimensions of bobble-neighbourhood-corona graphs' authors=['Rinurwati', 'R. Nabila'] year=2021 venue='' doi='10.1088/1742-6596/1836/1/012010' arxiv_id=None abstract='Resolving set in a graphG =(V(G), E(G)) is an ordered subset W of V(G) such that every vertex in V(G) has distinct representation with respect to W. Resolving set of G of minimum cardinality is called basis of G.Cardinality of basis of G is called metric dimension of G, dim(G). An ordered set W is called edge resolving set of G if every edge in E(G) has distinct edge-representation with respect to W. Edge-resolving sets in a graph Gof minimum cardinality is called edge-metric basis of G. Cardinality of edge-basis of G is called as edge-metric dimension of G, edim(G). Neighbourhood corona of G and H, G*H, is agraph obtained by taking graph G and |V (G)| graph Hi with Hi i = 1,2,…, |7(G)| is copy of H, then all vertices in H¡ are connected with neighbouring vertex of vertex v¡ in V (G). In this paper, we determine and analyse metric and edge-metric dimension of bobble-neighbourhood-corona, that is metric and edge-metric dimension of neighbourhood-corona of G and H, G*H, with H is trivial graph K1, and G £ {Cn,Kn}.' url='https://www.semanticscholar.org/paper/8dc3cf4ebf677a7cc33aa0d8f5acb5f149562627' relevance_score=0.39000000000000007 impact_score=2.0",
  "title='Mathematical analysis of the structure of one-heptagonal carbon nanocone in terms of its basis and dimension' authors=['Yousef Al-Qudah', 'Ali Jaradat', 'S. Sharma', 'Vijay Kumar Bhat'] year=2024 venue='Physica Scripta' doi='10.1088/1402-4896/ad3add' arxiv_id=None abstract='For an undirected connected graph G = G(V, E) with vertex set V(G) and edge set E(G), a subset R of V is said to be a resolving in G, if each pair of vertices (say a and b; a ≠ b) in G satisfy the relation d(a, k) ≠ d(b, k), for at least one member k in R. The minimum set R with this resolving property is said to be a metric basis for G, and the cardinality of such set R, is referred to as the metric dimension of G, denoted by dim v (G). In this manuscript, we consider a complex molecular graph of one-heptagonal carbon nanocone (represented by HCN s ) and investigate its metric basis as well as metric dimension. We prove that just three specifically chosen vertices are enough to resolve the molecular graph of HCN s . Moreover, several theoretical as well as applicative properties including comparison have also been incorporated.' url='https://www.semanticscholar.org/paper/384bd123aed81a2bedf83f55d7f64527980cc399' relevance_score=0.39 impact_score=6.0",
  "title='Constant Time Calculation of the Metric Dimension of the Join of Path Graphs' authors=['Chuanjun Zhang', 'Ghulam Haidar', 'Murad-ul-Islam Khan', 'Faisal Yousafzai', 'K. Hila', 'A. Khan'] year=2023 venue='Symmetry' doi='10.3390/sym15030708' arxiv_id=None abstract='The distance between two vertices of a simple connected graph G, denoted as d(u,v), is the length of the shortest path from u to v and is always symmetrical. An ordered subset W=w1,w2,w3,⋯,wk of V(G) is a resolving set for G, if for ∀u,v∈V(G), there exists wi∈W ∋ d(u,wi)≠d(v,wi). A resolving set with minimal cardinality is called the metric basis. The metric dimension of G is the cardinality of metric basis of G and is denoted as dim(G). For the graph G1=(V1,E1,) and G2=(V2,E2), their join is denoted by G1+G2. The vertex set of G1+G2 is V1∪V2 and the edge set is E=E1∪E2∪uv,u∈V1,v∈V2. In this article, we show that the metric dimension of the join of two path graphs is unbounded because of its dependence on the size of the paths. We also provide a general formula to determine this metric dimension. We also develop algorithms to obtain metric dimensions and a metric basis for the join of path graphs, with respect to its symmetries.' url='https://www.semanticscholar.org/paper/8d48400f3faa28fbb61dccdd4cdd37f58faf1d94' relevance_score=0.39 impact_score=8.0",
  "title='Explainable and Energy-Efficient Selective Ensemble Learning in Mobile Edge Computing Systems' authors=['Lei Feng', 'Chaorui Liao', 'Yingji Shi', 'F. Zhou'] year=2025 venue='IEEE Transactions on Network and Service Management' doi='10.1109/TNSM.2025.3539830' arxiv_id=None abstract='Explainable ensemble learning combines explainable artificial intelligence (XAI) and ensemble learning (EL) to solve the closed-box problem of EL and provide a clear and transparent explanation of the decision-making process in the model. As a distributed machine learning architecture, EL deploys base learners trained with local data at edge node and infers on target tasks, then combines the inference results of the participating base learners. However, selecting all base learners into EL may result in wasting more computing resources and not obtain better performance. To address this issue, we put forward the definition of confidence level (ConfLevel) on the basis of XAI and verify its effectiveness as the metric of selecting the base learner. Then, we take the joint optimization model of considering high ConfLevel and low computing power to determine the participating base learners for selective ensemble learning (SEL). Due to the non-convex and combinatorial nature of the problem, we propose a node selection and power control algorithm on the premise of Benders’ Decomposition (referred to BD-NSPC) to obtain the global optimal solution efficiently. In addition, simulation results show that BD-NSPC consumes about 30% less energy per EN on average and improves accuracy by 1-2% compared to other SEL algorithms. Besides, compared with federated learning (FL) framework, BD-NSPC reduces the energy consumption by about 25% and the latency by about 28%, achieving comparable accuracy in the edge computing system.' url='https://www.semanticscholar.org/paper/3a56be071dd958ffec0a1450cde88ac3f58825a1' relevance_score=0.38999999999999996 impact_score=4.0",
  "title='The Edge Version of Metric Dimension for the Family of Circulant Graphs Cₙ(1, 2)' authors=['Junya Lv', 'Xiao-Yan Lv', 'R. Nasir', 'Zohaib Zahids'] year=2021 venue='IEEE Access' doi='10.1109/ACCESS.2021.3083182' arxiv_id=None abstract='Graph theory is widely used to analyze the structure models in chemistry, biology, computer science, operations research and sociology. Molecular bonds, species movement between regions, development of computer algorithms, shortest spanning trees in weighted graphs, aircraft scheduling and exploration of diffusion mechanisms are some of these structure models. Let <inline-formula> <tex-math notation=\"LaTeX\">$G = (V_{G}, E_{G})$ </tex-math></inline-formula> be a connected graph, where <inline-formula> <tex-math notation=\"LaTeX\">$V_{G}$ </tex-math></inline-formula> and <inline-formula> <tex-math notation=\"LaTeX\">$E_{G}$ </tex-math></inline-formula> represent the set of vertices and the set of edges respectively. The idea of the edge version of metric dimension is based on the distance of edges in a graph. Let <inline-formula> <tex-math notation=\"LaTeX\">$R_{E_{G}}$ </tex-math></inline-formula> be the smallest set of edges in a connected graph <inline-formula> <tex-math notation=\"LaTeX\">$G$ </tex-math></inline-formula> that forms a basis such that for every pair of edges <inline-formula> <tex-math notation=\"LaTeX\">$e_{1},e_{2}~\\\\in ~E_{G}$ </tex-math></inline-formula>, there exists an edge <inline-formula> <tex-math notation=\"LaTeX\">$e~\\\\in ~R_{E_{G}}$ </tex-math></inline-formula> for which <inline-formula> <tex-math notation=\"LaTeX\">$d_{E_{G}}(e_{1}, e)~\\\\neq ~d_{E_{G}}(e_{2}, e)$ </tex-math></inline-formula> holds. In this paper, we show that the family of circulant graphs <inline-formula> <tex-math notation=\"LaTeX\">$C_{n}(1,2)$ </tex-math></inline-formula> is the family of graphs with constant edge version of metric dimension.' url='https://www.semanticscholar.org/paper/c6be28559aa0f6ddbfbe7d08e9b754ee9efc98ee' relevance_score=0.38000000000000006 impact_score=1.0",
  "title='The local metric dimension of generalized broken fan graph and edge corona product of star graph and path graph' authors=['Silfiatul Khoiriah', 'Tri Atmojo Kusmayadi'] year=2019 venue='Journal of Physics: Conference Series' doi='10.1088/1742-6596/1306/1/012015' arxiv_id=None abstract='Let G be a connected nontrivial graph. The distance between two vertices u and v in G is the length of the shortest u-v path, denoted by d(u, v). For an ordered set W = {w1, w2, …, wn} of n vertices on G, the representation of a vertex v with respect to W is ordered pair r(v|W ) = (d(v, w1), d(v, w2), …, d(v, wn)). W is local metric set of G if r(u|W ) ≠ r(v|W ) for every pair of adjacent vertices u and v in G. The local metric set W with minimum cardinality is called local metric basis and its cardinality is the local metric dimension of G, denoted by diml(G). In this paper, we determine the local metric dimension of generalized broken fan graph and edge corona product K1,m ◊ Pn graph. We obtained the local metric dimension of generalized broken fan graph is diml(BF(a1,a2,…,an))=∑i=1n⌈ n−14 ⌉. The local metric dimension of edge corona graph K1,m ◊ Pn is diml(K1.m⋄Pn)=⌊ n+104 ⌋ for m = 1 and 1 ≤ n ≤ 5, diml(K1.m⋄Pn)=⌊ n+64 ⌋ for m = 1 and n ≥ 6, diml(K1.m⋄Pn)=⌊ n+34 ⌋m for m ≥ 2 and 1 ≤ n ≤ 5, and diml(K1.m⋄Pn)=⌊ n−14 ⌋m for m ≥ 2 and n ≥ 6.' url='https://www.semanticscholar.org/paper/e254b51aae76fc9a7d522ce16af5ca2610def123' relevance_score=0.38 impact_score=3.0",
  "title='Metric basis and metric dimension of some infinite planar graphs' authors=['S. Vidya', 'Sunny Kumar Sharma', 'Prasanna Poojary', 'G. R. Vadiraja Bhatta'] year=2024 venue='Discrete Mathematics, Algorithms and Applications' doi='10.1142/s1793830924500769' arxiv_id=None abstract='<jats:p> Let [Formula: see text] be a nontrivial connected simple graph and [Formula: see text] be the distance between the vertices [Formula: see text] and [Formula: see text] in [Formula: see text]. The metric dimension of a graph [Formula: see text], denoted by dim([Formula: see text]), refers to the smallest set of vertices required to uniquely identify every vertex in the graph [Formula: see text]. A family of simple connected graphs say [Formula: see text], where [Formula: see text] has a constant metric dimension, if dim[Formula: see text] is finite and does not depend on the choice of [Formula: see text] in [Formula: see text]. In this paper, we consider two infinite families of planar graphs, say [Formula: see text], where [Formula: see text] and [Formula: see text], where [Formula: see text], and investigate their metric basis as well as the metric dimension. Additionally, we prove that the metric basis for these two graphs are independent. </jats:p>' url='https://doi.org/10.1142/s1793830924500769' relevance_score=0.38 impact_score=0.0",
  "title='Investigating Metric Dimension and Edge Metric Dimension of Hexagonal Boron Nitride and Carbon Nanotubes' authors=['Waseem Abbas', 'Faryal Chudhary', 'Umar Farooq', 'Muhammad Azeem', 'Yilun Shang'] year=2024 venue='European Journal of Pure and Applied Mathematics' doi='10.29020/nybg.ejpam.v17i3.5295' arxiv_id=None abstract=\"<jats:p>When there is a difference in the distance between two vertices in a simple linked graph, then a vertex $x$ resolves both $u$ and $v$. If at least one vertex in $S$ distinguishes each pair of distinct vertices in $G$, then a set $S$ of vertices in $G$ is referred to as a resolving set. $G$'s metric dimension is the minimum number of vertices required in a resolving set. A subset $S$ of vertices in a simple connected graph is called an edge metric generator if each vertex can tell any two distinct edges $e_1$ and $e_2$ apart by their respective distances from each other. The edge metric dimension (EMD), denoted as $\\\\mathrm{dim}_e(G)$, is the smallest cardinality of such a subset $S$ that serves as an edge metric generator for $G$. The primary objective of this study is to investigate the edge metric dimension (EMD) of hexagonal boron nitride and carbon nanotube structures.</jats:p>\" url='https://doi.org/10.29020/nybg.ejpam.v17i3.5295' relevance_score=0.38 impact_score=0.0",
  "title='Reaction-diffusion equations on metric graphs with edge noise' authors=['E. Sikolya'] year=2024 venue='Analysis Mathematica' doi='10.1007/s10476-024-00006-z' arxiv_id=None abstract='<jats:title>Abstract</jats:title><jats:p>We investigate stochastic reaction-diffusion equations on finite metric graphs. On each edge in the graph a multiplicative cylindrical Gaussian noise driven reaction-diffusion equation is given.  The vertex conditions are the standard continuity and generalized, non-local Neumann-Kirchhoff-type law in each vertex. The reaction term on each edge is assumed to be an odd degree polynomial, not necessarily of the same degree on each edge, with possibly stochastic coefficients and negative leading term. The model is a generalization of the problem in \\n[14] where polynomials with much more restrictive assumptions are considered and no first order differential operator is involved. We utilize the semigroup approach from \\n[15] to obtain existence and uniqueness of solutions with sample paths in the space of continuous functions on the graph. </jats:p>' url='https://doi.org/10.1007/s10476-024-00006-z' relevance_score=0.38 impact_score=0.0",
  "title='Edge version of metric dimension for the families of grid graphs and generalized prism graphs' authors=['R. Nasir', 'Zohaib Zahid', 'Sohail Zafar'] year=2020 venue='Discret. Math. Algorithms Appl.' doi='10.1142/s1793830920500378' arxiv_id=None abstract='The minimum edge version of metric basis is the smallest set [Formula: see text] of edges in a connected graph [Formula: see text] such that for every pair of edges [Formula: see text] [Formula: see text][Formula: see text] there exists an edge [Formula: see text] [Formula: see text][Formula: see text] for which [Formula: see text] [Formula: see text] [Formula: see text] holds. In this paper, the families of grid graphs and generalized prism graphs have been studied for edge version of metric dimension. Edge version of metric dimension is found to be constant for both families of graphs.' url='https://www.semanticscholar.org/paper/2c6fbbb925f32463abd59b61c1bd0ee441d2cbd4' relevance_score=0.37000000000000005 impact_score=2.0",
  "title='Load balance -aware dynamic cloud-edge-end collaborative offloading strategy' authors=['Yueqi Fan'] year=2024 venue='PLoS ONE' doi='10.1371/journal.pone.0296897' arxiv_id=None abstract='Cloud-edge-end (CEE) computing is a hybrid computing paradigm that converges the principles of edge and cloud computing. In the design of CEE systems, a crucial challenge is to develop efficient offloading strategies to achieve the collaboration of edge and cloud offloading. Although CEE offloading problems have been widely studied under various backgrounds and methodologies, load balance, which is an indispensable scheme in CEE systems to ensure the full utilization of edge resources, is still a factor that has not yet been accounted for. To fill this research gap, we are devoted to developing a dynamic load balance -aware CEE offloading strategy. First, we propose a load evolution model to characterize the influences of offloading strategies on the system load dynamics and, on this basis, establish a latency model as a performance metric of different offloading strategies. Then, we formulate an optimal control model to seek the optimal offloading strategy that minimizes the latency. Second, we analyze the feasibility of typical optimal control numerical methods in solving our proposed model, and develop a numerical method based on the framework of genetic algorithm. Third, through a series of numerical experiments, we verify our proposed method. Results show that our method is effective.' url='https://www.semanticscholar.org/paper/dc6f0a92cd5613ec139e670066c82c9eeaa7cfb2' relevance_score=0.37 impact_score=4.0",
  "title='On the strong metric dimension of crossed prism graph and edge corona of cycle with path graph' authors=['Astri Yunitasari', 'Tri Atmojo Kusmayadi'] year=2019 venue='Journal of Physics: Conference Series' doi='10.1088/1742-6596/1306/1/012018' arxiv_id=None abstract='Let G be a connected graph with vertex set V(G) and edge set E(G). The interval I[u, v] between u and v is defined as the collection of all vertices that belong to some shortest u − v path. A vertex s ∈ V(G) strongly resolves two vertices u and v if u belongs to a shortest v −s path, denoted by u ∈ I[v, s], or v belongs to a shortest u−s path, denoted by v ∈ I[u, s]. A set S ∈ V(G) is a strong resolving set if every two distinct vertices of G are strongly resolved by some vertex of S. The strong metric basis of G is a strong resolving set with minimal cardinality. The strong metric dimension of G, denoted by sdim(G), is defined as the cardinality of the strong metric basis. In this research, we determine the strong metric dimension of crossed prism graph and edge corona graph Cm ◊ Pn. We obtain the strong metric dimension of crossed prism graph with n ≥ 4 is n for n even. The strong metric dimension of edge corona graph Cm ◊ Pn is sdim(Cm⋄Pn)=m(n+1)−m2−1 for m ≥ 4, n = 2, m even; sdim(Cm⋄Pn)=m(n+1)−m2−2for m ≥ 4, n = 3, m even; sdim(Cm⋄Pn)=m(n+1)−m2−2 for m ≥ 4, n ≥ 3, m even; sdim(Cm ◊Pn)=mn for m ≥ 3, n = 2, m odd; sdim(Cm ◊Pn) = mn−1 for m ≥ 3, n ≥ 3, m odd.' url='https://www.semanticscholar.org/paper/c67656d6c56094aae463beaf967c67f39f011cad' relevance_score=0.36000000000000004 impact_score=1.0",
  "title='Multi-Source Peak Age of Information Optimization in Mobile Edge Computing Systems' authors=['Jianhang Zhu', 'Jie Gong'] year=2025 venue='IEEE Transactions on Networking' doi='10.1109/TON.2025.3601104' arxiv_id=None abstract='Age of Information (AoI) is emerging as a novel metric for measuring information freshness in real-time monitoring systems. For computation-intensive status data, the information is not revealed until being processed. We consider a status update problem in a multi-source single-server system where the sources are scheduled to generate and transmit status data which are received and processed at the edge server. Generate-at-will sources with both random transmission time and process time are considered, introducing the joint optimization of source scheduling and status sampling on the basis of transmission-computation balancing. We show that a random scheduler is optimal for both non-preemptive and preemptive server settings, and the optimal sampler depends on the scheduling result and its structure remains consistent with the single-source system, i.e., threshold-based sampler for non-preemptive case and transmission-aware deterministic sampler for preemptive case. Then, the problem can be transformed to jointly optimizing the scheduling frequencies and the sampling thresholds/functions, which is non-convex. We proposed an alternation optimization algorithm to solve it. Numerical experiments show that the proposed algorithm can achieve the optimal in a wide range of settings.' url='https://www.semanticscholar.org/paper/82f5d11dd5b8b71525ab0c493dbf1f7969999f68' relevance_score=0.36 impact_score=1.0",
  "title='Dominant Mixed Metric Dimension of Graph' authors=['R. Alfarisi', 'S. Husain', 'L. Susilowati', 'A. I. Kristiana'] year=2024 venue='Statistics, Optimization &amp; Information Computing' doi='10.19139/soic-2310-5070-1925' arxiv_id=None abstract='For $k-$ordered set $W=\\\\{s_1, s_2,\\\\dots, s_k \\\\}$ of vertex set $G$, the representation of a vertex or edge $a$ of $G$ with respect to $W$ is $r(a|W)=(d(a,s_1), d(a,s_2),\\\\dots, d(a,s_k))$ where $a$ is vertex so that $d(a,s_i)$ is a distance between of the vertex $v$ and the vertices in $W$ and $a=uv$ is edge so that $d(a,s_i)=min\\\\{d(u,s_i),d(v,s_i)\\\\}$. The set $W$ is a mixed resolving set of $G$ if $r(a|W)\\\\neq r(b|W)$ for every pair $a,b$ of distinct vertices or edge of $G$. The minimum mixed resolving set $W$ is a mixed basis of $G$. If $G$ has a mixed basis, then its cardinality is called mixed metric dimension, denoted by $dim_m(G)$. A set $W$ of vertices in $G$ is a dominating set for $G$ if every vertex of $G$ that is not in $W$ is adjacent to some vertex of $W$. The minimum cardinality of dominating set is domination number , denoted by $\\\\gamma(G)$. A vertex set of some vertices in $G$ that is both mixed resolving and dominating set is a mixed resolving dominating set. The minimum cardinality of mixed resolving dominating set is called dominant mixed metric dimension, denoted by $\\\\gamma_{mr}(G)$. In our paper, we will investigated the establish sharp bounds of the dominant mixed metric dimension of $G$ and determine the exact value of some family graphs.' url='https://www.semanticscholar.org/paper/bba5b0885d9a66ff41ea3abaf4a5f4a563f43356' relevance_score=0.36 impact_score=3.0",
  "title='Linear Simple Cycle Reservoirs at the edge of stability perform Fourier decomposition of the input driving signals' authors=['Robert Simon Fong', 'Boyu Li', 'Peter Tino'] year=2024 venue='Chaos' doi='10.48550/arXiv.2412.00295' arxiv_id=None abstract='This paper explores the representational structure of linear Simple Cycle Reservoirs (SCRs) operating at the edge of stability. We view SCR as providing in their state-space feature representations of the input-driving time series. By endowing the state space with the canonical dot-product, we \"reverse engineer\" the corresponding kernel (inner product) operating in the original time series space. The action of this time series kernel is fully characterized by the eigenspace of the corresponding metric tensor. We demonstrate that when linear SCRs are constructed at the edge of stability, the eigenvectors of the time series kernel align with the Fourier basis. This theoretical insight is supported by numerical experiments.' url='https://www.semanticscholar.org/paper/ffeae8282b2a5cdf952712ac6705a22756e353ea' relevance_score=0.36 impact_score=3.0",
  "title='Fault-Tolerant Metric Dimension (FTMD) of M-polynomial of Zigzag Edge Coronoid Fused by Starphene' authors=['Umar Farooq', 'Faryal Chudhary', 'Deeba Afzal', 'Waseem Abbas'] year=2023 venue='' doi='10.21203/rs.3.rs-3783303/v1' arxiv_id=None abstract='<jats:title>Abstract</jats:title>\\n        <jats:p>The application of graph invariants serves as a valuable tool for analyzing the complex structures of molecular graphs, attracting researchers across various fields. Graph theory has played a pivotal role in explaining chemical structures and finding practical applications. Representing chemical compounds as graphs enable theoretical exploration and yield meaningful insights. Among graph parameters, metric dimension stands out as a key metric, quantifying the minimum vertices needed for unique identification within a graph. The concept of fault-tolerant metric dimensions extends this idea, considering identification robustness in the face of faulty vertices or edges. This research applies metric dimension and fault-tolerant metric dimension to molecular graphs and networks, with a focus on the unique structural properties of the \"M-polynomial of zigzag edge coronoid fused by starphene\" molecule. Through graph theory, we deepen our understanding of this compound\\'s intricate molecular architecture.\\nMathematics Subject Classification 2023: 05C12</jats:p>' url='https://doi.org/10.21203/rs.3.rs-3783303/v1' relevance_score=0.36 impact_score=0.0",
  "title='The local metric dimension of edge corona and corona product of cycle graph and path graph' authors=['Elis Dyah Wulancar', 'Tri Atmojo Kusmayadi'] year=2019 venue='' doi='10.1088/1742-6596/1306/1/012014' arxiv_id=None abstract='Let G be a nontrivial connected graph with vertex set V(G). For an ordered set W = {w1, w2, …, wn} of n distinct vertices in G, the representation of a vertex v ∈ V(G) with respect to W is an ordered value of distance between v and every vertex of W . The set W is a local metric set of G if the representations of every pair of adjacent vertices with respect to W are different. The local metric set with minimum cardinality is called local metric basis and its cardinality is the local metric dimension of G and denoted by diml(G). The edge corona product of cycle graph and path graph denoted by Cm ʘ Pn, this graph is obtained from a cycle graph Cm and m copies of path graph Pn, and then joining two end-vertices of ith edge of Cm to every vertex in the ith copy of Pn, where 1 ≤ i ≤ m. The corona product of cycle graph and path graph denoted by Cm ◊ Pn, this graph is obtained from a cycle graph Cm and m copies of path graph Pn, and then joining by an edge each vertex from the ith copy of Pn with ith vertex of Cm. In this paper, we determine the local metric dimension of edge corona and corona product of cycle graph and path graph for positive integer m ≥ 3 and n ≥ 1. We obtain the local metric dimension of edge corona product of cycle and path graphs is diml(Cm ◊ Pn)=2 for n = 1 and diml(Cm⋄Pn)=m⌈ n−14 ⌉for\\u2009n≥2 for n ≥ 2. The local metric dimension of corona product of cycle and path graphs is diml(Cm ◊ Pn)=1 for n = 1 and even positive integer m ≥ 3, diml(Cm ʘ Pn)=2 for n = 1 and odd positive integer m ≥ 3, and diml(Cm⊙Pn)=m⌈ n−14 ⌉for\\u2009n≥2 for n ≥ 2.' url='https://www.semanticscholar.org/paper/09bb0e3a7c56ab57716bf7a0bd49b5ca5bca5161' relevance_score=0.35000000000000003 impact_score=0.0",
  "title='On the metric dimension of generalized broken fan graph and edge corona product of path with star graph' authors=['Makarima Sabila', 'Tri Atmojo Kusmayadi'] year=2019 venue='Journal of Physics: Conference Series' doi='10.1088/1742-6596/1306/1/012017' arxiv_id=None abstract='Let G be a connected nontrivial graph with vertex set V(G) and edge set E(G). The distance d(u, v) between two vertices u, v∈V (G) is shortest path from u to v. For an ordered set W = {w1, w2, …, wk}, the representation r(v | W ) of v with respect to W is ordered pair r(v | W ) = (d(v, w1), d(v, w2), …, d(v, wk)). A set W is resolving set of G if r(u | W ) ≠ r(v | W ) for two distinct vertices u, v in G. A resolving set with minimum cardinality is called metric basis of G. The metric dimension of a graph G, denoted by dim(G) is defined as the cardinality of metric basis. In this paper we determine the metric dimension of generalized broken fan BF (a1, a2, …, an) graph and edge corona graph Pm ◊ Sn. We obtained the metric dimension of generalized broken fan graph is dim(BF(a1,a2,…,an))=⌊ 2a1+25 ⌋+∑i=2n⌊ 2ai+2+xi5 ⌋ for xi = 0 if ∀aj ≡ 0, 2, 4 (mod 5), j < i, and xi = 2 if ∃aj ≡ 1, 3 (mod 5), j < i. The metric dimension of edge corona graph Pm ◊ Sn is dim(Pm ◊ Sn) = n + 1 for m = 2 and 1 ≤ n ≤ 2, dim(Pm ◊ Sn) = 2 for m ≥ 3 and n = 1, dim(Pm ◊ Sn) = m + 1 for m ≥ 3 and n = 2, and dim(Pm ◊ Sn) = n + (m − 2)(n − 2) for m ≥ 2 and n ≥ 3.' url='https://www.semanticscholar.org/paper/2bf02a88650fd702b1baa8c6b8b68a99323a2506' relevance_score=0.35000000000000003 impact_score=0.0",
  "title='Metric based resolvability of cycle related graphs' authors=['Ali N. A. Koam'] year=2024 venue='AIMS Mathematics' doi='10.3934/math.2024485' arxiv_id=None abstract='If a subset of vertices of a graph, designed in such a way that the remaining vertices have unique identification (usually called representations) with respect to the selected subset, then this subset is named as a metric basis (or resolving set). The minimum count of the elements of this subset is called as metric dimension. This concept opens the gate for different new parameters, like fault-tolerant metric dimension, in which the failure of any member of the designed subset is tolerated and the remaining subset fulfills the requirements of the resolving set. In the pattern of the resolving sets, a concept was introduced where the representations of edges must be unique instead of vertices. This concept was called the edge metric dimension, and this as well as the previously mentioned concepts belong to the idea of resolvability parameters in graph theory. In this paper, we find all the above resolving parametric sets of a convex polytope $ {F}_{♃} $ and compare their cardinalities.' url='https://www.semanticscholar.org/paper/59d1f8d37b2c132e57f7f73b1517acce9d261ce9' relevance_score=0.35000000000000003 impact_score=2.0",
  "title='Deep Learning Model Compression Techniques Performance on Edge Devices' authors=['Rakandhiya D. Rachmanto', 'Ahmad N. L. Nabhaan', 'Arief Setyanto'] year=2024 venue='Matrik' doi='10.30812/matrik.v23i3.3961' arxiv_id=None abstract='Artificial intelligence at the edge can help solve complex tasks faced by various sectors such as automotive, healthcare and surveillance. However, challenged by the lack of computational power from the edge devices, artificial intelligence models are forced to adapt. Many have developed and quantified model compres-sion approaches over the years to tackle this problem. However, not many have considered the overhead of on-device model compression, even though model compression can take a considerable amount of time. With the added metric, we provide a more complete view on the efficiency of model compression on the edge. The objective of this research is identifying the benefit of compression methods and it’s tradeoff between size and latency reduction versus the accuracy loss as well as compression time in edge devices. In this work, quantitative method is used to analyze and rank three common ways of model compression: post-training quantization, unstructured pruning and knowledge distillation on the basis of accuracy, latency, model size and time to compress overhead. We concluded that knowledge distillation is the best, with potential of up to 11.4x model size reduction, and 78.67% latency speed up, with moderate loss of accura-cy and compression time.' url='https://www.semanticscholar.org/paper/cfa4477b85bd9a48cad2181d6044745d187e698d' relevance_score=0.35000000000000003 impact_score=2.0",
  "title='Improved Edge Folding Algorithm for 3D Building Models Taking into Account the Visual Features' authors=['Haoyuan Bai', 'Tao Shen', 'Liang Huo', 'Xiaoyu Wang', 'Xinyu Liu'] year=2023 venue='Buildings' doi='10.3390/buildings13112739' arxiv_id=None abstract='Simplifying 3D building models, effectively reducing model complexity and improving mapping efficiency, is an important part of 3D GIS. In order to address the problem that the simplification basis considered by most 3D building model data compression algorithms is mainly based on geometric features and fails to retain the visual features of the model, this paper proposed a half-folding simplification algorithm for 3D building models that took the visual features into account. The algorithm incorporated regional boundary constraints in the pre-processing stage to focus on preserving the boundary features of the model, and incorporated visual constraints, such as the vertex importance, edge length, and texture, in the calculation of the edge folding cost to construct a new error metric model. The simplification order was changed by redefining the edge folding cost, and a trade-off between compression rate and retention rate was made by using half-edge folding to maximise the retention of the visual features of the building. The experimental results showed that the algorithm could effectively reduce the number of elements drawn by the system and achieve a high level of detail information retention in the visual feature region of the model with a good visual representation.' url='https://www.semanticscholar.org/paper/7edc9c1ab0da199c274c24b51cfd6dacd2172033' relevance_score=0.35 impact_score=4.0",
  "title='Partition dimension and strong metric dimension of chain cycle' authors=['Talmeez U. R. Rehman', 'N. Mehreen'] year=2020 venue='' doi=None arxiv_id=None abstract='Let $G$ be a connected graph with vertex set $V(G)$ and edge set $E(G)$. For an ordered $k$-partition $\\\\Pi=\\\\{Q_1,\\\\ldots,Q_k\\\\}$ of $V(G)$, the representation of a vertex $v \\\\in V(G)$ with respect to $\\\\Pi$ is the $k$-vectors $r(v|\\\\Pi)=(d(v,Q_1),\\\\ldots,d(v,Q_k))$, where $d(v,Q_i)$ is the distance between $v$ and $Q_i$. The partition $\\\\Pi$ is a resolving partition if $r(u|\\\\Pi)\\\\neq r(v|\\\\Pi)$, for each pair of distinct vertices $u,v \\\\in V(G)$. The minimum $k$ for which there is a resolving $k$-partition of $V(G)$ is the partition dimension of $G$. A vertex $w\\\\in V(G)$ strongly resolves two distinct vertices $u,v \\\\in V(G)$ if $u$ belongs to a shortest $v-w$ path or $v$ belongs to a shortest $u-w$ path. An ordered set $W=\\\\{w_{1},\\\\ldots, w_{t}\\\\}\\\\subseteq V(G)$ is a strong resolving set for $G$ if for every two distinct vertices $u$ and $v$ of $G$ there exists a vertex $w\\\\in W$ which strongly resolves $u$ and $v$. A strong metric basis of $G$ is a strong resolving set of minimal cardinality. The cardinality of a strong metric basis is called strong metric dimension of $G$. In this paper, we determine the partition dimension and strong metric dimension of a chain cycle constructed by even cycles and a chain cycle constructed by odd cycles.' url='https://www.semanticscholar.org/paper/d0ac6764614f6f9b3235e5859199576954fecd33' relevance_score=0.35 impact_score=10.0",
  "title='The metric basis for assessing corporate sustainability' authors=['Sergei V. PETROV'] year=2025 venue='Economic Analysis: Theory and Practice' doi='10.24891/ea.24.1.172' arxiv_id=None abstract=\"<jats:p>Subject. The article addresses corporate sustainability assessment.\\nObjectives. The purpose is to propose a system of indicators of company's activity, enabling to identify the degree of its environmental, social, and economic sustainability.\\nMethods. The study rests on modeling various metric systems in the field of synthesis of financial and non-financial reporting data.\\nResults. The paper offers a list of social, environmental, and economic analytical business parameters sufficient to diagnose the degree of sustainable development of the company, and the format and principles of non-financial reporting presentation, contributing to increasing its applied usefulness, formalizes the method of obtaining this data, defines the role of model proposed by A.D. Sheremet in the metric pool formation of the economic direction, and the logic of connection between the metrics of social, environmental, and economic directions.\\nConclusions. The proposed principle of relationship between the parameters allows the developed system of indicators to be integrated into the concept of stability based on the application of the Euler–Venn diagram.</jats:p>\" url='https://doi.org/10.24891/ea.24.1.172' relevance_score=0.35 impact_score=0.0",
  "title='General results of local metric dimensions of edge-corona of graphs' authors=['Rinurwati', 'Slamin', 'H. Suprajitno'] year=2016 venue='' doi='10.12988/IMF.2016.67102' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/c53391a49a76596a59a9878d48f7fb36c6fe9022' relevance_score=0.34 impact_score=14.0",
  "title='Edge dependent fault-tolerance in certain carbon-based crystal structures' authors=['Malkesh Singh', 'Sohan Lal', 'S. Sharma', 'Vijay Kumar Bhat'] year=2024 venue='Physica Scripta' doi='10.1088/1402-4896/ad5fcb' arxiv_id=None abstract='The field of chemical graph theory encompasses interdisciplinary studies that utilize mathematical methods in exploring the attributes and arrangement of chemical compounds. Chemical graphs, in which atoms are vertices and bonds are edges, offer influential mathematical representations for portraying the molecular structures of chemical compounds. A smallest subset of vertices of a graph from which the vector of distances to each vertex of the graph is unique is known as metric basis for that graph and cardinality of a metric basis is known as metric dimension of that graph. In this paper, an important variant of metric dimension known as fault-tolerant edge metric dimension (FTEMD) is taken into consideration and computed it for most important possible allotrope of carbon family, known as crystal cubic carbon (denoted by G(n)). We prove that the FTEMD value of the molecular graph of crystal cubic carbon is unbounded for large n. Also, the comparison between several variants of metric dimension and FTEMD for the molecular graph G(n) has also been incorporated in the paper.' url='https://www.semanticscholar.org/paper/5f3da012d63151c240b1c4488f99de89d8a11a0d' relevance_score=0.34 impact_score=1.0",
  "title='Vertex-Edge Partition Resolvability for Certain Carbon Nanocones' authors=['S. Sharma', 'Malkesh Singh', 'V. K. Bhat'] year=2023 venue='Polycyclic aromatic compounds (Print)' doi='10.1080/10406638.2023.2206142' arxiv_id=None abstract='Abstract Chemical graph theory is an extension of mathematical chemistry that explores chemical phenomena and entities using the conceptual frameworks of graph theory. In particular, chemical graphs are used to represent molecular structures in chemical graph theory. Edges and vertices in this chemical graph substitute for bonds and atoms, respectively. The primary data types used throughout cheminformatics to depict chemical structures are chemical graphs. The basis for (quantitative) structure-property and structure-activity predictions, a central area of cheminformatics, is laid by the computable properties of graphs. The physical characteristics of molecules are thus reflected in these graphs, which can subsequently be reduced to graph-theoretical indices or descriptors. The resolving set Z, which distinguish every pair of distinct vertices in a connected simple graph, is one of the most well-studied distance-based graph descriptors. In this manuscript, we consider the most significant variation of a metric dimension known as partition dimension and determine it for the molecular complex graph of one-pentagonal carbon nanocone (PCN). We demonstrate that all of the vertices and edges in PCN can be uniquely identified only by considering three distinct non-neighboring partition sets (minimal requirement) from PCN.' url='https://www.semanticscholar.org/paper/751c99ccacc02fe077a7d9649a01b28bb18a8924' relevance_score=0.33999999999999997 impact_score=3.0",
  "title='Local Metric Dimension of the Line Graph of a Generalized Petersen Graph' authors=['Nur Fahri Tadjuddin'] year=2024 venue='Proximal' doi='10.30605/proximal.v8i1.4707' arxiv_id=None abstract='Let G be a graph that has a vertex set V(G) and an edge set E(G). Let W={w_1,w_2,…w_k} be a subset of V(G). The representation of a vertex v∈V(G) with respect to W, denoted by r(v|W), is defined as k-vector (d(v,w_1 ),d(v,w_2 ), …, d(v,w_k )). A set W is called a local resolving set of G if r(u│W)≠r(v│W) \\xa0for every two adjacent vertices u,v∈V(G). The smallest cardinality of all local resolving set in G is called the local metric dimension of G, denoted by lmd(G). The local resolving set of G with cardinality\\xa0 lmd\\u2061(G) \\xa0is called a local basis of G. In this paper, we determine the local metric dimension of the line graph of generalized Petersen graph P_(n,1).' url='https://www.semanticscholar.org/paper/1bf766aaede756fcc33ea0851c7e48ac609f8847' relevance_score=0.33 impact_score=0.0",
  "title='On Vertex-Edge Resolvability for the Web Graph and Prism Related Graph' authors=['S. Sharma', 'Vijay Kumar Bhat'] year=2023 venue='Ars Comb.' doi='10.61091/ars157-10' arxiv_id=None abstract='Let E ( H ) and V ( H ) denote the edge set and the vertex set of the simple connected graph H , respectively. The mixed metric dimension of the graph H is the graph invariant, which is the mixture of two important graph parameters, the edge metric dimension and the metric dimension. In this article, we compute the mixed metric dimension for the two families of the plane graphs viz., the Web graph W n and the Prism allied graph D t n . We show that the mixed metric dimension is non-constant unbounded for these two families of the plane graph. Moreover, for the Web graph W n and the Prism allied graph D t n , we unveil that the mixed metric basis set M m G is independent.' url='https://www.semanticscholar.org/paper/c760d73148a8ebb5725019acbf7267ed9618a8a1' relevance_score=0.32 impact_score=1.0",
  "title='Edge Wasserstein Distance Loss for Oriented Object Detection' authors=['Yuke Zhu', 'Yumeng Ruan', 'Zihua Xiong', 'Sheng Guo'] year=2023 venue='arXiv.org' doi='10.48550/arXiv.2312.07048' arxiv_id=None abstract='Regression loss design is an essential topic for oriented object detection. Due to the periodicity of the angle and the ambiguity of width and height definition, traditional L1-distance loss and its variants have been suffered from the metric discontinuity and the square-like problem. As a solution, the distribution based methods show significant advantages by representing oriented boxes as distributions. Differing from exploited the Gaussian distribution to get analytical form of distance measure, we propose a novel oriented regression loss, Wasserstein Distance(EWD) loss, to alleviate the square-like problem. Specifically, for the oriented box(OBox) representation, we choose a specially-designed distribution whose probability density function is only nonzero over the edges. On this basis, we develop Wasserstein distance as the measure. Besides, based on the edge representation of OBox, the EWD loss can be generalized to quadrilateral and polynomial regression scenarios. Experiments on multiple popular datasets and different detectors show the effectiveness of the proposed method.' url='https://www.semanticscholar.org/paper/96eedf259c85ee793648d362bcbeda017549267f' relevance_score=0.32 impact_score=1.0",
  "title='Edge Metric and Fault-Tolerant Edge Metric Dimension of Hollow Coronoid' authors=['Ali N. A. Koam', 'Ali Ahmad', 'Muhammad Ibrahim', 'Muhammad Azeem'] year=2021 venue='Mathematics' doi='10.3390/math9121405' arxiv_id=None abstract='<jats:p>Geometric arrangements of hexagons into six sides of benzenoids are known as coronoid systems. They are organic chemical structures by definition. Hollow coronoids are divided into two types: primitive and catacondensed coronoids. Polycyclic conjugated hydrocarbon is another name for them. Chemical mathematics piques the curiosity of scientists from a variety of disciplines. Graph theory has always played an important role in making chemical structures intelligible and useful. After converting a chemical structure into a graph, many theoretical and investigative studies on structures can be carried out. Among the different parameters of graph theory, the dimension of edge metric is the most recent, unique, and important parameter. Few proposed vertices are picked in this notion, such as all graph edges have unique locations or identifications. Different (edge) metric-based concept for the structure of hollow coronoid were discussed in this study.</jats:p>' url='https://doi.org/10.3390/math9121405' relevance_score=0.32 impact_score=0.0",
  "title='Metric dimension of vertex shackle operation result graph on wheel and star graphs' authors=['Ilham Saifudin', 'R. Umilasari', 'Abdul Jalil'] year=2022 venue='Journal of Physics: Conference Series' doi='10.1088/1742-6596/2279/1/012010' arxiv_id=None abstract='The ordered set W = (w1, w2, w3,…, wk } of vertex set on graph G and a vertex v in G the it form k-vector ordered r(v|W) = (d(v, w1 ), d(v, w2 ),…, (v, wk )) is set of metric coordinate by v to W. W can be said as resolving set of G if every coordinate of W are not same. The number of resolving set or basis of G which minimum is called metric dimension and written by dim(G). Shackle is one technique to construct a graph by attach the vertex or edge between the same graph then it make linkage vertex and edge vertex that every graph which constructed be denoted by Shack(G, v, t) and Shack(G, e, t) means a shackle graph consist of t copy with t > 2. In this study case, we determine metric dimension of vertex shackle products graphs of wheel graph Shack(Wm, v, n) for m > 3, n > 2 and vertex shackle products of star graph Shack(Sm, v, n) for m > 3 and n > 2. In addition, we also determined the implementation of metric dimension theory by finding the coordinate of drone as navigation for traffic monitoring in Jember Regency.' url='https://www.semanticscholar.org/paper/b30251c52b7c28038fa5a29d5b550f2f7e7a803c' relevance_score=0.31 impact_score=2.0",
  "title='The Alternative of Sensor Placement in Multi-Story Buildings through the Metric Dimension Approach: A Representation of Generalized Petersen Graphs' authors=['A. Asmiati', 'A. Junaidi', 'A. Aldino', 'Ari S. Munandar'] year=2022 venue='ComTech' doi='10.21512/comtech.v13i2.7268' arxiv_id=None abstract='In a public facility or private office where many people can get together, a fire detection device is a mandatory tool as an emergency alarm in the facility. However, the expense of the installation of the device is a troublesome matter. So, optimization is needed to minimize the number of these devices. The way to implement is to select the appropriate position to place the devices in public facilities. The research discussed the placement of the sensors in multi-story buildings. The multi-story buildings could be represented as cube composition graphs with the number of rooms, and the connectivity between the floor and its rooms was equal. The concept of this multi-story building was modeled into a generalized Petersen graph where a vertex represented a room, and an edge was the connectivity of rooms. The basis obtained on that metric dimension was represented as a sensor placed on the building. Then, the optimization of device placement was seen as determining the metric dimensions of the Petersen graph. In the research, the alternative sensor placements were computed using the graph metric dimension approach implemented in Python. The research successfully implements the metric dimension of \\xa0to \\xa0using Python code to obtain the alternative of its basis. A basic alternative indicates the location of the device placement like fire detectors, network access points, or other sensors inside a building.' url='https://www.semanticscholar.org/paper/450a8b671eee43b094c4136b60b4e44055d0aaa1' relevance_score=0.31 impact_score=2.0",
  "title='Redefining the Diamond Cutting Edge: A Technique that Complements Nano-Metric Surface Generation' authors=['K. Ramesh', 'W. Lewis', 'S. Veldhuis', 'A. Yui'] year=2005 venue='' doi='10.1081/AMP-200060407' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/8e5ce7be829df8310f1f388e3e07adf743d97f10' relevance_score=0.31 impact_score=11.0",
  "title='Investigating The Metric Basis And Metric Dimension Of Graphene' authors=['Wasim Abbas', 'Faryal Chaudhry', 'Deeba Afzal', 'Umar Farooq'] year=2023 venue='' doi='10.21203/rs.3.rs-3800695/v1' arxiv_id=None abstract='<jats:title>Abstract</jats:title>\\n        <jats:p>This article explores the metric dimension of graphene, atwo-dimensional carbon allotrope, examining how a minimal set of carbon atoms can uniquely determine the distances between all atoms in thegraphene lattice. We investigate the implications of metric dimension for characterizing graphene’s structural features and discuss its potentialapplications in electronics, energy storage, and nanotechnology. Thea rticle aims to contribute to the understanding of graphene’s unique properties and its practical use in various fields</jats:p>' url='https://doi.org/10.21203/rs.3.rs-3800695/v1' relevance_score=0.31 impact_score=0.0",
  "title='A Physical Basis for the Symmetries in the Friedmann-Robertson-Walker Metric' authors=['Fulvio Melia'] year=2023 venue='' doi='10.31219/osf.io/m6rdh' arxiv_id=None abstract=\"<p>Modern cosmological theory is based on the Friedmann-Robertson-Walker (FRW) metric. Oftenwritten in terms of co-moving coordinates, this well-known solution to Einstein's equationsowes its elegant and highly practical formulation to the Cosmological principle and Weyl'spostulate, upon which it is founded. But there is physics behind such symmetries, and not allof it has yet been recognized. In this paper, we derive the FRW metric coefficients from thegeneral form of the spherically-symmetric line element, and demonstrate that, because theco-moving frame also happens to be in free fall, the symmetries in FRW are valid only for a mediumwith zero active mass. In other words, the spacetime of a perfect fluid in cosmology may becorrectly written as FRW only when its equation-of-state is $\\\\rho+3p=0$, in terms of the{\\\\it total} pressure $p$ and {\\\\it total} energy density $\\\\rho$. There is now compelling observationalsupport for this conclusion, including the Alcock-Paczy\\\\'nski test, which shows that only an FRWcosmology with zero active mass is consistent with the latest model-independent BaryonAcoustic Oscillation data.</p>\" url='https://doi.org/10.31219/osf.io/m6rdh' relevance_score=0.31 impact_score=0.0",
  "title='Mix-BEATS: Mixer-enhanced Basis Expansion Analysis for Load Forecasting' authors=['Anuj Kumar', 'H. Saravanan', 'Shivam Dwivedi', 'P. Arjunan'] year=2025 venue='Energy-Efficient Computing and Networking' doi='10.1145/3679240.3734632' arxiv_id=None abstract='Short-term load forecasting (STLF) is crucial for energy management and integrating renewables, but traditional models often fail to generalize across diverse buildings. While Time Series Foundation Models (TSFM) offer potential, most are transformer-based, making them computationally heavy and unsuitable for edge deployment. We introduce Mix-BEATS, a lightweight and accurate model combining N-BEATS and TSMixer architectures for building-level energy prediction. Adapting TSMixer originated from MLP-Mixer, originally designed for vision tasks using pure MLP blocks for patchwise and spatial mixing, we leverage its principles for temporal forecasting. Mix-BEATS is trained on hourly smart-meter data from 38,956 buildings and evaluated on a held-out set of 1,000 buildings using the NRMSE metric. We compare Mix-BEATS against state-of-the-art TSFMs such as Lag-Llama, Moirai, Chronos, and Tiny Time Mixers in zero-shot and fine-tuned settings, as well as generic models including Autoformer, N-BEATS, TS-Mixer, etc., under domain-specific training and testing. In both comparisons, Mix-BEATS consistently outperforms the baselines, demonstrating robust generalization and efficiency for real-world STLF tasks. Code: https://github.com/AI-IoT-Lab/Mix-BEATS.' url='https://www.semanticscholar.org/paper/65af78beb9b61bbc8e83b01f332c30425c3d3c17' relevance_score=0.30000000000000004 impact_score=0.0",
  "title='Edge Metric and Edge Metric Topology on Graph' authors=['Roy John', 'Athira Chandran', 'G. Suresh Singh'] year=2025 venue='Mathematics and Statistics' doi='10.13189/ms.2025.130302' arxiv_id=None abstract='' url='https://doi.org/10.13189/ms.2025.130302' relevance_score=0.30000000000000004 impact_score=0.0",
  "title='Metric, edge-metric, mixed-metric, and fault-tolerant metric dimensions of geometric networks with potential applications' authors=['Sakander Hayat', 'Rishi Naeem', 'Hafiz Muhammad Afzal Siddiqui', 'Amina Riaz', 'Muhammad Imran', 'Melaku Berhe Belay', 'Zeineb Klai'] year=2025 venue='Scientific Reports' doi='10.1038/s41598-025-24939-z' arxiv_id=None abstract='' url='https://doi.org/10.1038/s41598-025-24939-z' relevance_score=0.30000000000000004 impact_score=0.0",
  "title='Computing Metric Dimension and Metric Basis of 2D Lattice of Alpha-Boron Nanotubes' authors=['Zafar Hussain', 'Mobeen Munir', 'Maqbool Chaudhary', 'Shin Min Kang'] year=2018 venue='Symmetry' doi='10.3390/sym10080300' arxiv_id=None abstract='<jats:p>Concepts of resolving set and metric basis has enjoyed a lot of success because of multi-purpose applications both in computer and mathematical sciences. For a connected graph G(V,E) a subset W of V(G) is a resolving set for G if every two vertices of G have distinct representations with respect to W. A resolving set of minimum cardinality is called a metric basis for graph G and this minimum cardinality is known as metric dimension of G. Boron nanotubes with different lattice structures, radii and chirality’s have attracted attention due to their transport properties, electronic structure and structural stability. In the present article, we compute the metric dimension and metric basis of 2D lattices of alpha-boron nanotubes.</jats:p>' url='https://doi.org/10.3390/sym10080300' relevance_score=0.3 impact_score=0.0",
  "title='Metric basis and metric dimension of 1-pentagonal carbon nanocone networks' authors=['Zafar Hussain', 'Mobeen Munir', 'Ashfaq Ahmad', 'Maqbool Chaudhary', 'Junaid Alam Khan', 'Imtiaz Ahmed'] year=2020 venue='Scientific Reports' doi='10.1038/s41598-020-76516-1' arxiv_id=None abstract='<jats:title>Abstract</jats:title><jats:p>Resolving set and metric basis has become an integral part in combinatorial chemistry and molecular topology. It has a lot of applications in computer, chemistry, pharmacy and mathematical disciplines. A subset S of the vertex set V of a connected graph G resolves G if all vertices of G have different representations with respect to S. A metric basis for G is a resolving set having minimum cardinal number and this cardinal number is called the metric dimension of G. In present work, we find a metric basis and also metric dimension of 1-pentagonal carbon nanocones. We conclude that only three vertices are minimal requirement for the unique identification of all vertices in this network.</jats:p>' url='https://doi.org/10.1038/s41598-020-76516-1' relevance_score=0.3 impact_score=0.0",
  "title='Computing edge version of metric and double metric dimensions of Kayak paddle graphs' authors=['Muhammad Ahmad', 'Naeem Ameen', 'Zohaib Zahid', 'Sohail Zafar'] year=2020 venue='Discrete Mathematics, Algorithms and Applications' doi='10.1142/s1793830920500706' arxiv_id=None abstract='<jats:p> Locating the source of diffusion in complex networks is an exciting but challenging task. It is critical for preventing and controlling the epidemic risks. Source localization has been studied under many feasible models. In this paper, we discuss the localization problem in Kayak paddle graphs [Formula: see text] for [Formula: see text] and [Formula: see text] by computing edge version of metric and double metric dimensions. </jats:p>' url='https://doi.org/10.1142/s1793830920500706' relevance_score=0.3 impact_score=0.0",
  "title='METRIC SURVEY DOCUMENTATION AS A BASIS FOR UNDERSTANDING THE DEVELOPMENT OF RURAL ARCHITECTURE' authors=['Zdeněk Poloprutský'] year=2018 venue='Stavební obzor - Civil Engineering Journal' doi='10.14311/cej.2018.01.0005' arxiv_id=None abstract='<jats:p>The paper deals with the use of metric survey documentation as a basis for Artistic and Historical Research of rural architecture. The Artistic and Historical Research focuses on a specific part, an element or a type of surveyed buildings in the selected time period. Its results can be further developed and interpreted in a wider cultural context of the respective rural region. In this way, it is possible to describe the cultural and social environment of the given rural region and external influences which have guided its future development in the given time period. The objective of metric survey documentation is to provide a reliable spatial and temporal framework for future analyses.The article presents practical experience in using metric survey documentation of rural buildings. Its outputs can serve for e.g. drawings, 3D models, photographs, orthophotos, thematic maps and others.</jats:p>' url='https://doi.org/10.14311/cej.2018.01.0005' relevance_score=0.3 impact_score=0.0",
  "title='Computing Basis and Dimension of Chloroquine and Hydroxychloroquine by Using Chemical Graph Theory' authors=['Yogesh Singh', 'H. Raza', 'S. Sharma', 'V. K. Bhat'] year=2022 venue='Polycyclic aromatic compounds (Print)' doi='10.1080/10406638.2022.2086269' arxiv_id=None abstract='Abstract Discovering a vaccine with reliable and effective treatment for the new corona virus disease 2019 (COVID-19) is indeed a long way off, and there seems to be a critical need to research additional viable medications that could save countless lives in the event of the COVID-19 pandemic. Scientists from all over the world are actively developing medical or anti-virus medications, which are safe and effective for COVID-19. The anti-viral drugs of chloroquine (CQ) and hydroxychloroquine (HCQ) have proved to be an efficient inhibitory effect by preventing the binding of spike covid protein. The determination of a pharmaceutical structure using a topological index allows researchers to have a better understanding of the physiological as well as bio-organic properties of drugs. The goal of this study is to employ molecular graph theory to determine some graph-theoretic parameters related to the molecular graph of CQ and HCQ. In this paper, we present some resolvability parameters such as metric dimension (MD), edge metric dimension (EMD), fault-tolerant metric dimension (FTMD), and fault-tolerant edge metric dimension (FTEMD) of CQ and HCQ. We prove that these resolvability parameters for CQ and HCQ are bounded and constant.' url='https://www.semanticscholar.org/paper/7ae5be424b85590e86ba41737e1af388740e457b' relevance_score=0.28 impact_score=4.0",
  "title='Strong Edge Metric Dimension of Graphs' authors=['Mojgan Afkhami'] year=2023 venue='' doi='10.2139/ssrn.4769772' arxiv_id=None abstract='' url='https://doi.org/10.2139/ssrn.4769772' relevance_score=0.26 impact_score=0.0",
  "title='\\u200eFractional $K$-Clique Metric Dimension of (Edge) Corona Products of Graphs' authors=['Zeinab Shahmiri', 'Darko Dimitrov', 'Mostafa Tavakoli'] year=2023 venue='' doi='10.2139/ssrn.4953611' arxiv_id=None abstract='' url='https://doi.org/10.2139/ssrn.4953611' relevance_score=0.26 impact_score=0.0",
  "title='No-reference sharpness metric based on local edge kurtosis' authors=['J. Caviedes', 'S. Gurbuz'] year=2023 venue='Proceedings. International Conference on Image Processing' doi='10.1109/icip.2002.1038901' arxiv_id=None abstract='' url='https://doi.org/10.1109/icip.2002.1038901' relevance_score=0.26 impact_score=0.0",
  "title='Physics Basis, Optimization, and Control for Integrated 3D Edge Long-pulse Tokamak Scenarios' authors=['Zhihong Lin'] year=2023 venue='' doi='10.2172/1995426' arxiv_id=None abstract='' url='https://doi.org/10.2172/1995426' relevance_score=0.26 impact_score=0.0",
  "title='METRIC DIMENSION VULNERABILITY IN TREES UNDER EDGE CONTRACTION' authors=['L. Saha', 'Rupen Lama', 'Kalishankar Tiwary'] year=2022 venue='' doi=None arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/b04f4e1aab96fbecb99747a3af8c9fdb06e55a3e' relevance_score=0.24000000000000002 impact_score=0.0",
  "title='The effect of vertex and edge deletion on the edge metric dimension of graphs' authors=['Meiqin Wei', 'Jun Yue', 'Lily Chen'] year=2022 venue='Journal of Combinatorial Optimization' doi='10.1007/s10878-021-00838-7' arxiv_id=None abstract='' url='https://doi.org/10.1007/s10878-021-00838-7' relevance_score=0.24000000000000002 impact_score=0.0",
  "title='On the edge metric dimension and Wiener index of the blow up of graphs' authors=['M. Afkhami'] year=2021 venue='' doi='10.1285/I15900932V40N2P99' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/5c03119dc8dd3d507e4ab9e543600d39c6c1441e' relevance_score=0.22 impact_score=0.0",
  "title='Metric dimension and edge metric dimension of windmill graphs' authors=['Pradeep Singh', 'Sahil Sharma', 'Sunny Kumar Sharma', 'Vijay Kumar Bhat'] year=2021 venue='AIMS Mathematics' doi='10.3934/math.2021531' arxiv_id=None abstract='' url='https://doi.org/10.3934/math.2021531' relevance_score=0.22 impact_score=0.0",
  "title='A perceived sharpness metric based on the luminance slope and overshoot of the motion‐induced edge‐blur profile' authors=['Yuan Cui', 'Wen Song', 'Xiaohua Li'] year=2012 venue='' doi='10.1002/jsid.132' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/e6179220929e24425b670bf9d5889afe3a0c5545' relevance_score=0.21000000000000002 impact_score=1.0",
  "title='Method and apparatus for deriving the edge composite ties metric between nodes of a telecommunications call graph' authors=['ビー． メンディラッタ，ヴィーナ', 'ドラン，デレク', 'ファク，シトラ', 'ウズナイオグリュー，フセイン', 'クシュニール，ダン'] year=2012 venue='' doi=None arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/6cff34c555d1465ebeb9bbb25ad4269c01865925' relevance_score=0.2 impact_score=0.0",
  "title='Basis Vector Fields and the Metric Tensor' authors=[] year=2007 venue=\"Einstein's General Theory of Relativity\" doi='10.1007/978-0-387-69200-5_4' arxiv_id=None abstract='' url='https://doi.org/10.1007/978-0-387-69200-5_4' relevance_score=0.2 impact_score=0.0",
  "title='Adaptable edge quality metric' authors=['Robin N. Strickland'] year=1993 venue='Optical Engineering' doi='10.1117/12.130263' arxiv_id=None abstract='' url='https://doi.org/10.1117/12.130263' relevance_score=0.2 impact_score=0.0",
  "title='New metric describes edge noise in bilevel images' authors=['Elisa Barney Smith'] year=2009 venue='SPIE Newsroom' doi='10.1117/2.1200910.1829' arxiv_id=None abstract='' url='https://doi.org/10.1117/2.1200910.1829' relevance_score=0.2 impact_score=0.0",
  "title='Improvised Canny Edge Detector &amp; Performance Metric of Edge Detector Using WPR (White Pixel Ratio)' authors=['Naveen Singh Dagar'] year=2013 venue='IOSR Journal of Engineering' doi='10.9790/03752431' arxiv_id=None abstract='' url='https://doi.org/10.9790/03752431' relevance_score=0.2 impact_score=0.0",
  "title='Edge\\u2009quality\\u2009metric\\u2009for\\u2009arbitrary\\u2009two‐dimensional\\u2009edges' authors=['Paul V. Khvorostov'] year=1996 venue='Optical Engineering' doi='10.1117/1.601060' arxiv_id=None abstract='' url='https://doi.org/10.1117/1.601060' relevance_score=0.2 impact_score=0.0",
  "title='The money-metric as a basis for calculation of social welfare functions' authors=[] year=1983 venue='Measuring Economic Welfare' doi='10.1017/cbo9780511571770.009' arxiv_id=None abstract='' url='https://doi.org/10.1017/cbo9780511571770.009' relevance_score=0.2 impact_score=0.0",
  "title='A NOVEL PERFORMANCE METRIC FOR GREY-SCALE EDGE DETECTION' authors=[] year=2010 venue='Proceedings of the International Conference on Computer Vision Theory and Applications' doi='10.5220/0002821700910097' arxiv_id=None abstract='' url='https://doi.org/10.5220/0002821700910097' relevance_score=0.2 impact_score=0.0",
  "title='Metric tensor for multicomponent edge detection' authors=['Sylvain Rousseau', 'David Helbert', 'Philippe Carre', 'Jacques Blanc-Talon'] year=2010 venue='2010 IEEE International Conference on Image Processing' doi='10.1109/icip.2010.5653763' arxiv_id=None abstract='' url='https://doi.org/10.1109/icip.2010.5653763' relevance_score=0.2 impact_score=0.0",
  "title='An image quality assessment metric based on Non-shift Edge' authors=['Wufeng Xue', 'Xuanqin Mou'] year=2011 venue='2011 18th IEEE International Conference on Image Processing' doi='10.1109/icip.2011.6116379' arxiv_id=None abstract='' url='https://doi.org/10.1109/icip.2011.6116379' relevance_score=0.2 impact_score=0.0",
  "title='The Metric Bridge Partition Problem: Partitioning of a Metric Space into Two Subspaces Linked by an Edge in Any Optimal Realization' authors=['Alain Hertz', 'Sacha Varone'] year=2007 venue='Journal of Classification' doi='10.1007/s00357-007-0011-0' arxiv_id=None abstract='' url='https://doi.org/10.1007/s00357-007-0011-0' relevance_score=0.2 impact_score=0.0",
  "title='PARA(NOIA)METRIC: ARCHITECTURE BEYOND THE EDGE OF RATIONALITY' authors=['Marwan Halabi'] year=2020 venue='Architecture and Planning Journal (APJ)' doi='10.54729/2789-8547.1036' arxiv_id=None abstract='' url='https://doi.org/10.54729/2789-8547.1036' relevance_score=0.2 impact_score=0.0",
  "title='Computing the dilation of edge-augmented graphs in metric spaces' authors=['Christian Wulff-Nilsen'] year=2010 venue='Computational Geometry' doi='10.1016/j.comgeo.2009.03.008' arxiv_id=None abstract='' url='https://doi.org/10.1016/j.comgeo.2009.03.008' relevance_score=0.2 impact_score=0.0",
  "title='A metric basis characterization of Euclidean space' authors=['Grattan Murphy'] year=1975 venue='Pacific Journal of Mathematics' doi='10.2140/pjm.1975.60.159' arxiv_id=None abstract='' url='https://doi.org/10.2140/pjm.1975.60.159' relevance_score=0.2 impact_score=0.0",
  "title='Barycentric Subdivision of Cayley Graphs With Constant Edge Metric Dimension' authors=['Ali N. A. Koam', 'Ali Ahmad'] year=2020 venue='IEEE Access' doi='10.1109/access.2020.2990109' arxiv_id=None abstract='' url='https://doi.org/10.1109/access.2020.2990109' relevance_score=0.2 impact_score=0.0",
  "title='Edge resolvability of generalized honeycomb rhombic torus' authors=['Ayesha Andalib Kiran', 'Hani Shaker', 'S. Saputro'] year=2024 venue='Journal of Applied Mathematics and Computation' doi='10.1007/s12190-024-02231-z' arxiv_id=None abstract='' url='https://www.semanticscholar.org/paper/feab18d3362a5b75c9bcfd4e63b2fb37e78bf36b' relevance_score=0.19 impact_score=1.0",
  "title='6Chapter Energy Medicine: Cutting Edge Modalities' authors=[] year=2009 venue='The Scientific Basis of Integrative Medicine' doi='10.1201/b10166-14' arxiv_id=None abstract='' url='https://doi.org/10.1201/b10166-14' relevance_score=0.1 impact_score=0.0",
  "title='' authors=[] year=2023 venue='' doi='10.1117/12.2304701.5783316325001' arxiv_id=None abstract='' url='https://doi.org/10.1117/12.2304701.5783316325001' relevance_score=0.06000000000000001 impact_score=0.0"
]