[
  "id='paper_1770210248.703247' title='Quantum Mycielskians: symmetries, twin vertices and distinguishing labelings' authors=['Arkadiusz Bochniak', 'Igor Chełstowski', 'Paweł Kasprzak', 'Piotr M. Sołtan'] year=2025 venue='arXiv' doi=None arxiv_id='2502.10521' abstract='We investigate a quantum generalization of the Mycielski construction for quantum graphs. In particular, we analyze the quantum symmetries of quantum Mycielskians and their relation to the symmetries of the underlying quantum graphs. We introduce a quantum analogue of graphs with twin vertices and show that, for classical graphs with a small number of vertices, this notion reduces to the classical one. Finally, we propose a quantum extension of the distinguishing number and examine its behavior under the quantum Mycielski construction.' url='http://arxiv.org/abs/2502.10521v2' relevance_score=0.9 impact_score=0.0",
  "id='paper_1770210248.703247' title='Fractional revival between twin vertices' authors=['Hermie Monterde'] year=2023 venue='arXiv' doi=None arxiv_id='2303.04952' abstract='In this paper, we provide a characterization of fractional revival between twin vertices in a weighted graph with respect to its adjacency, Laplacian and signless Laplacian matrices. As an application, we characterize fractional revival between apexes of double cones.' url='http://arxiv.org/abs/2303.04952v1' relevance_score=0.8600000000000001 impact_score=0.0",
  "id='paper_1770210248.703247' title='Laplacian State Transfer on Graphs with an Edge Perturbation Between Twin Vertices' authors=['Hiranmoy Pal'] year=2021 venue='arXiv' doi=None arxiv_id='2109.05306' abstract='We consider quantum state transfer relative to the Laplacian matrix of a graph. Let $N(u)$ denote the set of all neighbors of a vertex $u$ in a graph $G$. A pair of vertices $u$ and $v$ are called twin vertices of $G$ provided $N(u)\\\\setminus\\\\{v \\\\}=N(v)\\\\setminus\\\\{u \\\\}$. We investigate the existence of quantum state transfer between a pair of twin vertices in a graph when the edge between the vertices is perturbed. We find that removal of any set of pairwise non-adjacent edges from a complete graph with a number of vertices divisible by $4$ results Laplacian perfect state transfer (or LPST) at $\\\\fracπ{2}$ between the end vertices of every edge removed. Further, we show that all Laplacian integral graphs with a pair of twin vertices exhibit LPST when the edge between the vertices is perturbed. In contrast, we conclude that LPST can be achieved in every complete graph between the end vertices of any number of suitably perturbed non-adjacent edges. The results are further generalized to obtain a family of edge perturbed circulant graphs exhibiting Laplacian pretty good state transfer (or LPGST) between twin vertices. A subfamily of which is also identified to admit LPST at $\\\\fracπ{2}$.' url='http://arxiv.org/abs/2109.05306v1' relevance_score=0.8200000000000001 impact_score=0.0",
  "id='paper_1770210248.703247' title='Strong Cospectrality and Twin Vertices in Weighted Graphs' authors=['Hermie Monterde'] year=2021 venue='arXiv' doi=None arxiv_id='2111.01265' abstract='We explore algebraic and spectral properties of weighted graphs containing twin vertices that are useful in quantum state transfer. We extend the notion of adjacency strong cospectrality to arbitrary Hermitian matrices, with focus on the generalized adjacency matrix and the generalized normalized adjacency matrix. We then determine necessary and sufficient conditions such that a pair of twin vertices in a weighted graph exhibits strong cospectrality with respect to the above-mentioned matrices. We also generalize known results about equitable and almost equitable partitions, and use these to determine which joins of the form $X\\\\vee H$, where $X$ is either the complete or empty graph, exhibit strong cospectrality.' url='http://arxiv.org/abs/2111.01265v2' relevance_score=0.8200000000000001 impact_score=0.0",
  "id='paper_1770210248.703247' title='Critical ideals of signed graphs with twin vertices' authors=['Carlos A. Alfaro', 'Hugo Corrales', 'Carlos E. Valencia'] year=2015 venue='arXiv' doi=None arxiv_id='1504.06257' abstract='This paper studies critical ideals of graphs with twin vertices, which are vertices with the same neighbors. A pair of such vertices are called replicated if they are adjacent, and duplicated, otherwise. Critical ideals of graphs having twin vertices have good properties and show regular patterns. Given a graph $G=(V,E)$ and ${\\\\bf d}\\\\in \\\\mathbb{Z}^{|V|}$, let $G^{\\\\bf d}$ be the graph obtained from $G$ by duplicating ${\\\\bf d}_v$ times or replicating $-{\\\\bf d}_v$ times the vertex $v$ when ${\\\\bf d}_v>0$ or ${\\\\bf d}_v<0$, respectively. Moreover, given $δ\\\\in \\\\{0,1,-1\\\\}^{|V|}$, let \\\\[ \\\\mathcal{T}_δ(G)=\\\\{G^{\\\\bf d}: {\\\\bf d}\\\\in \\\\mathbb{Z}^{|V|} \\\\text{ such that } {\\\\bf d}_v=0 \\\\text{ if and only if }δ_v=0 \\\\text{ and } {\\\\bf d}_vδ_v>0 \\\\text{ otherwise}\\\\} \\\\] be the set of graphs sharing the same pattern of duplication or replication of vertices. More than one half of the critical ideals of a graph in $\\\\mathcal{T}_δ(G)$ can be determined by the critical ideals of $G$. The algebraic co-rank of a graph $G$ is the maximum integer $i$ such that the $i$-{\\\\it th} critical ideal of $G$ is trivial. We show that the algebraic co-rank of any graph in $\\\\mathcal{T}_δ(G)$ is equal to the algebraic co-rank of $G^δ$. For a large enough ${\\\\bf d}\\\\in \\\\mathbb{Z}^{V(G)}$, we show that the critical ideals of $G^{\\\\bf d}$ have similar behavior to the critical ideals of the disjoint union of $G$ and some set $\\\\{K_{n_v}\\\\}_{\\\\{v\\\\in V(G)| d_v<0\\\\}}$ of complete graphs and some set $\\\\{T_{n_v}\\\\}_{\\\\{v\\\\in V(G) \\\\, |\\\\, {\\\\bf d}_v>0\\\\}}$ of trivial graphs. Additionally, we pose important conjectures on the distribution of the algebraic co-rank of the graphs with twins vertices. These conjectures imply that twin-free graphs have a large algebraic co-rank, meanwhile a graph having small algebraic co-rank has at least one pair of twin vertices.' url='http://arxiv.org/abs/1504.06257v4' relevance_score=0.8 impact_score=0.0",
  "id='paper_1770210249.242838' title='Prime Graphs with Almost True Twin Vertices' authors=['Aymen Ben Amira', 'Moncef Bouaziz'] year=2025 venue='Mathematics' doi='10.3390/math13213466' arxiv_id=None abstract='<jats:p>A graph\\xa0G consists of a possibly infinite set V(G) of vertices with a collection E(G) of unordered pairs of distinct vertices, called the set of edges of G. Such a graph is denoted by (V(G),E(G)). Two distinct vertices u and v of a graph G are adjacent if {u,v}∈E(G). Let G be a graph. A subset M of V(G) is a module of G if every vertex outside M is adjacent to all or none of the vertices in M. The graph G is prime if it has at least four vertices, and its only modules are ∅, the single-vertex sets, and V(G). Given two adjacent vertices u and v of G, v is a negative almost true twin of u in G if there is a vertex xv in V(G)∖{u} non-adjacent to u such that the pair {u,v} is a module of the graph (V(G),E(G)∪{{u,xv}}). In this paper, we study graphs with a negative almost true twin for a given vertex, and we give some applications. Firstly, we characterize these graphs by a special decomposition, and we specify the prime graphs among them. Secondly, we give three applications, giving methods for extending graphs to prime graphs. Finally, we study the prime induced subgraphs of the prime graphs with at least two negative almost true twins for a given vertex.</jats:p>' url='https://doi.org/10.3390/math13213466' relevance_score=0.7000000000000001 impact_score=0.0",
  "id='paper_1770210248.703247' title='Twin Vertices in Fault-Tolerant Metric Sets and Fault-Tolerant Metric Dimension of Multistage Interconnection Networks' authors=['S. Prabhu', 'V. Manimozhi', 'M. Arulperumjothi', 'Sandi Klavžar'] year=2021 venue='arXiv' doi=None arxiv_id='2106.14285' abstract=\"A set of vertices $S\\\\subseteq V(G)$ is a basis or resolving set of a graph $G$ if for each $x,y\\\\in V(G)$ there is a vertex $u\\\\in S$ such that $d(x,u)\\\\neq d(y,u)$. A basis $S$ is a fault-tolerant basis if $S\\\\setminus \\\\{x\\\\}$ is a basis for every $x \\\\in S$. The fault-tolerant metric dimension (FTMD) $β'(G)$ of $G$ is the minimum cardinality of a fault-tolerant basis. It is shown that each twin vertex of $G$ belongs to every fault-tolerant basis of $G$. As a consequence, $β'(G) = n(G)$ iff each vertex of $G$ is a twin vertex, which corrects a wrong characterization of graphs $G$ with $β'(G) = n(G)$ from [Mathematics 7(1) (2019) 78]. This FTMD problem is reinvestigated for Butterfly networks, Benes networks, and silicate networks. This extends partial results from [IEEE Access 8 (2020) 145435--145445], and at the same time, disproves related conjectures from the same paper.\" url='http://arxiv.org/abs/2106.14285v2' relevance_score=0.6200000000000001 impact_score=0.0",
  "id='paper_1770210249.242838' title='Characterizing graph classes using twin vertices of regular induced subgraphs' authors=['Terry A. McKee'] year=2014 venue='Journal of Combinatorics' doi='10.4310/joc.2014.v5.n4.a2' arxiv_id=None abstract='' url='https://doi.org/10.4310/joc.2014.v5.n4.a2' relevance_score=0.5 impact_score=0.0",
  "id='paper_1770210249.242838' title='Twin Vertices in Hypergraphs' authors=['Olivier Raynaud', 'Raoul Medina', 'Caroline Noyer'] year=2006 venue='Electronic Notes in Discrete Mathematics' doi='10.1016/j.endm.2006.08.069' arxiv_id=None abstract='' url='https://doi.org/10.1016/j.endm.2006.08.069' relevance_score=0.5 impact_score=0.0",
  "id='paper_1770210249.242838' title='On microcrack nucleation at twin vertices and boundaries in bcc and fcc metals' authors=['V. A. Fedorov', 'V. A. Kuranova', 'Yu. I. Tyalin', 'S. N. Pluzhnikov'] year=2003 venue='Crystallography Reports' doi='10.1134/1.1578138' arxiv_id=None abstract='' url='https://doi.org/10.1134/1.1578138' relevance_score=0.5 impact_score=0.0",
  "id='paper_1770210248.703247' title='Resolving vertices of graphs with differences' authors=['Iztok Peterina', 'Jelena Sedlar', 'Riste Škrekovski', 'Ismael G. Yero'] year=2023 venue='arXiv' doi=None arxiv_id='2309.00922' abstract='The classical (vertex) metric dimension of a graph G is defined as the cardinality of a smallest set S in V (G) such that any two vertices x and y from G have different distances to least one vertex from S: The k-metric dimension is a generalization of that notion where it is required that any pair of vertices has different distances to at least k vertices from S: In this paper, we introduce the weak k-metric dimension of a graph G; which is defined as the cardinality of a smallest set of vertices S such that the sum of the distance differences from any pair of vertices to all vertices of S is at least k: This dimension is \"stronger\" than the classical metric dimension, yet \"weaker\" than k-metric dimension, and it can be formulated as an ILP problem. The maximum k for which the weak k-metric dimension is defined is denoted by kappa(G). We first prove several properties of the weak k-metric dimension regarding the presence of true or false twin vertices in a graph. Using those properties, the kappa(G) is found for some basic graph classes, such as paths, stars, cycles, and complete (bipartite) graphs. We also find kappa(G) for trees and grid graphs using the observation that the distance difference increases by the increase of the cardinality of a set S. For all these graph classes we further establish the exact value of the weak k-metric dimension for all k <= kappa(G).' url='http://arxiv.org/abs/2309.00922v1' relevance_score=0.45999999999999996 impact_score=0.0",
  "id='paper_1770210248.703247' title='Quantum state transfer between twins in weighted graphs' authors=['Stephen Kirkland', 'Hermie Monterde', 'Sarah Plosker'] year=2022 venue='arXiv' doi=None arxiv_id='2201.02720' abstract='Twin vertices in simple unweighted graphs are vertices that have the same neighbours and, in the case of weighted graphs with possible loops, the corresponding incident edges have equal weights. In this paper, we explore the role of twin vertices in quantum state transfer. In particular, we provide characterizations of periodicity, perfect state transfer, and pretty good state transfer between twin vertices in a weighted graph with respect to its adjacency, Laplacian and signless Laplacian matrices. As an application, we provide characterizations of all simple unweighted double cones on regular graphs that exhibit periodicity, perfect state transfer, and pretty good state transfer.' url='http://arxiv.org/abs/2201.02720v3' relevance_score=0.44 impact_score=0.0",
  "id='paper_1770210248.703247' title='On the Displacement of Eigenvalues when Removing a Twin Vertex' authors=['Johann A. Briffa', 'Irene Sciriha'] year=2019 venue='arXiv' doi=None arxiv_id='1904.05670' abstract='Twin vertices of a graph have the same open neighbourhood. If they are not adjacent, then they are called duplicates and contribute the eigenvalue zero to the adjacency matrix. Otherwise they are termed co-duplicates, when they contribute $-1$ as an eigenvalue of the adjacency matrix. On removing a twin vertex from a graph, the spectrum of the adjacency matrix does not only lose the eigenvalue $0$ or $-1$. The perturbation sends a rippling effect to the spectrum. The simple eigenvalues are displaced. We obtain a closed formula for the characteristic polynomial of a graph with twin vertices in terms of two polynomials associated with the perturbed graph. These are used to obtain estimates of the displacements in the spectrum caused by the perturbation.' url='http://arxiv.org/abs/1904.05670v4' relevance_score=0.4 impact_score=0.0",
  "id='paper_1770210248.703247' title='On the Partition Dimension and the Twin Number of a Graph' authors=['Carmen Hernando', 'Merce Mora', 'Ignacio M Pelayo'] year=2016 venue='arXiv' doi=None arxiv_id='1602.08907' abstract='A partition P of the vertex set of a connected graph G is a locating partition of G if every vertex is uniquely determined by its vector of distances to the elements of P. The partition dimension of G is the minimum cardinality of a locating partition of G. A pair of vertices u,v of a graph G are called twins if they have exactly the same set of neighbors other than u and v. A twin class is a maximal set of pairwise twin vertices. The twin number of a graph G is the maximum cardinality of a twin class of G.   In this paper we undertake the study of the partition dimension of a graph by also considering its twin number. This approach allows us to obtain the set of connected graphs of order n having partition dimension n-2. This set is formed by exactly 15 graphs, instead of 23, as was wrongly stated in the paper: \"Discrepancies between metric dimension and partition dimension of a connected graph\", published in Discrete Mathematics in 2008.' url='http://arxiv.org/abs/1602.08907v3' relevance_score=0.4 impact_score=0.0",
  "id='paper_1770210248.703247' title='Tight lower bounds on the number of bicliques in false-twin-free graphs' authors=['Marina Groshaus', 'Leandro Montero'] year=2015 venue='arXiv' doi=None arxiv_id='1510.01165' abstract='A \\\\emph{biclique} is a maximal bipartite complete induced subgraph of $G$. Bicliques have been studied in the last years motivated by the large number of applications. In particular, enumeration of the maximal bicliques has been of interest in data analysis. Associated with this issue, bounds on the maximum number of bicliques were given. In this paper we study bounds on the minimun number of bicliques of a graph. Since adding false-twin vertices to $G$ does not change the number of bicliques, we restrict to false-twin-free graphs. We give a tight lower bound on the minimum number bicliques for a subclass of $\\\\{C_4$,false-twin$\\\\}$-free graphs and for the class of $\\\\{K_3$,false-twin$\\\\}$-free graphs. Finally we discuss the problem for general graphs.' url='http://arxiv.org/abs/1510.01165v2' relevance_score=0.4 impact_score=0.0",
  "id='paper_1770210248.704247' title='Hamiltonian Cycles in Subdivided Doubles' authors=['David Eppstein'] year=2025 venue='arXiv' doi=None arxiv_id='2510.18359' abstract='The subdivided double construction on 4-regular graphs was used by Potočnik and Wilson to explore semi-symmetric (edge-transitive but not vertex-transitive) graphs, and can be used to construct every semi-symmetric 4-regular graph that contains a pair of twin vertices. We show that (regardless of symmetry) subdivided doubles have another curious property: they have exponentially many Hamiltonian cycles each of which is complementary to another Hamiltonian cycle.' url='http://arxiv.org/abs/2510.18359v1' relevance_score=0.4 impact_score=0.0",
  "id='paper_1770210248.704247' title='Roman $\\\\{2\\\\}$-domination on Graphs with \"few\" 4-paths' authors=['Lara Fernández', 'Valeria Leoni'] year=2025 venue='arXiv' doi=None arxiv_id='2511.17369' abstract='Given a graph $G$ with vertex set $V$, $f : V \\\\rightarrow \\\\{0, 1, 2\\\\}$ is a \\\\emph{Roman $\\\\{2\\\\}$-dominating function} (or \\\\emph{italian dominating function}) of $G$ if for every vertex $v\\\\in V$ with $f(v) =0$, either there exists a vertex $u$ adjacent to $v$ with $f(u) = 2$, or two distinct vertices $x,\\\\; y$ both adjacent to $v$ with $f(x)=f(y)=1$. The decision problem associated with Roman $\\\\{2\\\\}$-domination is NP-complete even for bipartite graphs (Chellali et al., 2016).   In this work we initiate the study of Roman $\\\\{2\\\\}$-domination on graph classes with a limited number of 4-paths. We base our study on a modular decomposition analysis. In particular, we study Roman $\\\\{2\\\\}$-domination under some operations in graphs such as join, union, complementation, addition of pendant vertices and addition of twin vertices. We then obtain the Roman $\\\\{2\\\\}$-domination number of spiders, well-labelled spiders and certain prime split graphs that are crucial in the modular decomposition of partner-limited graphs. In all, we provide linear-time algorithms to compute the Roman $\\\\{2\\\\}$-domination number of cographs, $P_4$-sparse graphs, $P_4$-tidy graphs and partner-limited graphs. Finally, we derive the NP-completeness of Roman $\\\\{2\\\\}$-domination on $P_4$-laden graphs.' url='http://arxiv.org/abs/2511.17369v2' relevance_score=0.4 impact_score=0.0",
  "id='paper_1770210248.704247' title='Locating-dominating partitions for some classes of graphs' authors=['Florent Foucaud', 'Paras Vinubhai Maniya', 'Kaustav Paul', 'Dinabandhu Pradhan'] year=2025 venue='arXiv' doi=None arxiv_id='2506.12933' abstract='A dominating set of a graph $G$ is a set $D \\\\subseteq V(G)$ such that every vertex in $V(G) \\\\setminus D$ is adjacent to at least one vertex in $D$. A set $L\\\\subseteq V(G)$ is a locating set of $G$ if every vertex in $V(G) \\\\setminus L$ has pairwise distinct open neighborhoods in $L$. A set $D\\\\subseteq V(G)$ is a locating-dominating set of $G$ if $D$ is a dominating set and a locating set of $G$. The location-domination number of $G$, denoted by $γ_{LD}(G)$, is the minimum cardinality among all locating-dominating sets of $G$. A well-known conjecture in the study of locating-dominating sets is that if $G$ is an isolate-free and twin-free graph of order $n$, then $γ_{LD}(G)\\\\le \\\\frac{n}{2}$. Recently, Bousquet et al. [Discrete Math. 348 (2025), 114297] proved that if $G$ is an isolate-free and twin-free graph of order $n$, then $γ_{LD}(G)\\\\le \\\\lceil\\\\frac{5n}{8}\\\\rceil$ and posed the question whether the vertex set of such a graph can be partitioned into two locating sets. We answer this question affirmatively for twin-free distance-hereditary graphs, maximal outerplanar graphs, split graphs, and co-bipartite graphs. In fact, we prove a stronger result that for any graph $G$ without isolated vertices and twin vertices, if $G$ is a distance-hereditary graph or a maximal outerplanar graph or a split graph or a co-bipartite graph, then the vertex set of $G$ can be partitioned into two locating-dominating sets. Consequently, this also confirms the original conjecture for these graph classes.' url='http://arxiv.org/abs/2506.12933v1' relevance_score=0.4 impact_score=0.0",
  "id='paper_1770210249.242838' title='Topological Twin Graphs. Smallest Pair of Isospectral Polyhedral Graphs with Eight Vertices' authors=['Haruo Hosoya', 'Umpei Nagashima', 'Sachiko Hyugaji'] year=1994 venue='Journal of Chemical Information and Computer Sciences' doi='10.1021/ci00018a033' arxiv_id=None abstract='' url='https://doi.org/10.1021/ci00018a033' relevance_score=0.4 impact_score=0.0",
  "id='paper_1770210248.704247' title='Saturated Partial Embeddings of Planar Graphs' authors=['Alexander Clifton', 'Nika Salia'] year=2024 venue='arXiv' doi=None arxiv_id='2403.02458' abstract='In this work, we study how far one can deviate from optimal behavior when embedding a planar graph. For a planar graph $G$, we say that a plane subgraph $H\\\\subseteq G$ is a \\\\textit{plane-saturated subgraph} if adding any edge (possibly with new vertices) to $H$ would either violate planarity or make the resulting graph no longer a subgraph of $G$. For a planar graph $G$, we define the \\\\textit{plane-saturation ratio}, $\\\\psr(G)$, as the minimum value of $\\\\frac{e(H)}{e(G)}$ for a plane-saturated subgraph $H$ of $G$ and investigate how small $\\\\psr(G)$ can be. While there exist planar graphs where $\\\\psr(G)$ is arbitrarily close to $0$, we show that for all twin-free planar graphs, $\\\\psr(G)>1/16$, and that there exist twin-free planar graphs where $\\\\psr(G)$ is arbitrarily close to $1/16$. In fact, we study a broader category of planar graphs, focusing on classes characterized by a bounded number of degree $1$ and degree $2$ twin vertices. We offer solutions for some instances of bounds while positing conjectures for the remaining ones.' url='http://arxiv.org/abs/2403.02458v1' relevance_score=0.38 impact_score=0.0",
  "id='paper_1770210248.704247' title='Metric dimensions of generalized Sierpiński graphs over squares' authors=['Savari Prabhu', 'T. Jenifer Janany', 'Sandi Klavžar'] year=2024 venue='arXiv' doi=None arxiv_id='2404.00771' abstract='Metric dimension is a valuable parameter that helps address problems related to network design, localization, and information retrieval by identifying the minimum number of landmarks required to uniquely determine distances between vertices in a graph. Generalized Sierpiński graphs represent a captivating class of fractal-inspired networks that have gained prominence in various scientific disciplines and practical applications. Their fractal nature has also found relevance in antenna design, image compression, and the study of porous materials. The hypercube is a prevalent interconnection network architecture known for its symmetry, vertex transitivity, regularity, recursive structure, high connectedness, and simple routing. Various variations of hypercubes have emerged in literature to meet the demands of practical applications. Sometimes, they are the spanning subgraphs of it. This study examines the generalized Sierpiński graphs over $C_4$, which are spanning subgraphs of hypercubes and determines the metric dimension and their variants. This is in contrast to hypercubes, where these properties are inherently complicated. Along the way, the role of twin vertices in the theory of metric dimensions is further elaborated.' url='http://arxiv.org/abs/2404.00771v1' relevance_score=0.38 impact_score=0.0",
  "id='paper_1770210248.703247' title='New results in vertex sedentariness' authors=['Hermie Monterde'] year=2023 venue='arXiv' doi=None arxiv_id='2401.00362' abstract='A vertex in a graph is said to be sedentary if a quantum state assigned on that vertex tends to stay on that vertex. Under mild conditions, we show that the direct product and join operations preserve vertex sedentariness. We also completely characterize sedentariness in blow-up graphs. These results allow us to construct new infinite families of graphs with sedentary vertices. We prove that a vertex with a twin is either sedentary or admits pretty good state transfer. Moreover, we give a complete characterization of twin vertices that are sedentary, and provide sharp bounds on their sedentariness. As an application, we determine the conditions in which perfect state transfer, pretty good state transfer and sedentariness occur in complete bipartite graphs and threshold graphs of any order.' url='http://arxiv.org/abs/2401.00362v1' relevance_score=0.36 impact_score=0.0",
  "id='paper_1770210248.703247' title='Constructing graphs having Laplacian pair state transfer by an edge perturbation' authors=['Wei Wang', 'Xiaogang Liu', 'Jing Wang'] year=2022 venue='arXiv' doi=None arxiv_id='2202.04957' abstract='In this paper, we give some sufficient conditions for graphs with an edge perturbation between twin vertices to have Laplacian perfect pair state transfer as well as Laplacian pretty good pair state transfer. By those sufficient conditions, we also construct many new graphs having Laplacian perfect pair state transfer as well as Laplacian pretty good pair state transfer.' url='http://arxiv.org/abs/2202.04957v1' relevance_score=0.33999999999999997 impact_score=0.0",
  "id='paper_1770210248.704247' title='Graphs defined on groups' authors=['Peter J. Cameron'] year=2021 venue='arXiv' doi=None arxiv_id='2102.11177' abstract='These notes concern aspects of various graphs whose vertex set is a group $G$ and whose edges reflect group structure in some way (so that they are invariant under the action of the automorphism group of $G$). The graphs I will discuss are the power graph, enhanced power graph, deep commuting graph, commuting graph, and non-generating graph, though I give a briefer discussion of the nilpotence and solvability graphs, and make some remarks on more general graphs. Aspects to be discussed include induced subgraphs, forbidden subgraphs, connectedness, and automorphism groups. We can also ask about the graphs formed by the edges in one graph but not in an earlier graph in the hierarchy. I have included some results on intersection graphs of subgroups of various types, which are often in a dual relation to one of the other graphs considered. Another actor is the Gruenberg--Kegel graph, or prime graph, of a group: this very small graph influences various graphs defined on the group. I say little about Cayley graphs, since (except in special cases) these are not invariant under the automorphism group of $G$.   The graphs all have the property that they contain \\\\emph{twins}, pairs of vertices with the same neighbours (save possibly one another). Being equal or twins is an equivalence relation, and the automorphism group of the graph has a normal subgroup inducing the symmetric group on each twin class. For some purposes, we can merge twin vertices and get a smaller graph. Continuing until no further twins occur, the result is independent of the reduction, and is the $1$-vertex graph if and only if the original graph is a \\\\emph{cograph}. So I devote a section to cographs and twin reduction, and another to consequences for automorphism groups.   There are briefer discussions of related matters.' url='http://arxiv.org/abs/2102.11177v3' relevance_score=0.32 impact_score=0.0",
  "id='paper_1770210248.703247' title='Splitting cubic circle graphs' authors=['Lorenzo Traldi'] year=2015 venue='arXiv' doi=None arxiv_id='1504.01143' abstract='We show that every 3-regular circle graph has at least two pairs of twin vertices; consequently no such graph is prime with respect to the split decomposition. We also deduce that up to isomorphism, K_4 and K_{3,3} are the only 3-connected, 3-regular circle graphs.' url='http://arxiv.org/abs/1504.01143v1' relevance_score=0.3 impact_score=0.0",
  "id='paper_1770210248.703247' title='A bracket polynomial for graphs. III. Vertex weights' authors=['Lorenzo Traldi'] year=2009 venue='arXiv' doi=None arxiv_id='0905.4879' abstract='In earlier work the Kauffman bracket polynomial was extended to an invariant of marked graphs, i.e., looped graphs whose vertices have been partitioned into two classes (marked and not marked). The marked-graph bracket polynomial is readily modified to handle graphs with weighted vertices. We present formulas that simplify the computation of this weighted bracket for graphs that contain twin vertices or are constructed using graph composition, and we show that graph composition corresponds to the construction of a link diagram from tangles.' url='http://arxiv.org/abs/0905.4879v3' relevance_score=0.3 impact_score=0.0",
  "id='paper_1770210248.704247' title='The normalized distance Laplacian' authors=['Carolyn Reinhart'] year=2019 venue='arXiv' doi=None arxiv_id='1903.04575' abstract='The distance matrix $\\\\mathcal{D}(G)$ of a graph $G$ is the matrix containing the pairwise distances between vertices. The transmission of a vertex $v_i$ in $G$ is the sum of the distances from $v_i$ to all other vertices and $T(G)$ is the diagonal matrix of transmissions of the vertices of the graph. The normalized distance Laplacian, $\\\\mathcal{D}^{\\\\mathcal {L}}(G)=I-T(G)^{-1/2}\\\\mathcal{D}(G) T(G)^{-1/2}$, is introduced. This is analogous to the normalized Laplacian matrix, $\\\\mathcal{L}(G)=I-D(G)^{-1/2}A(G)D(G)^{-1/2}$, where $D(G)$ is the diagonal matrix of degrees of the vertices of the graph and $A(G)$ is the adjacency matrix. Bounds on the spectral radius of $\\\\mathcal{D}^{\\\\mathcal {L}}$ and connections with the normalized Laplacian matrix are presented. Twin vertices are used to determine eigenvalues of the normalized distance Laplacian. The generalized distance characteristic polynomial is defined and its properties discussed. Finally, $\\\\mathcal{D}^{\\\\mathcal {L}}$-cospectrality is studied for all graphs on 10 and fewer vertices, providing evidence that the normalized distance Laplacian has fewer cospectral pairs than other matrices.' url='http://arxiv.org/abs/1903.04575v2' relevance_score=0.3 impact_score=0.0",
  "id='paper_1770210248.704247' title='Isotropic matroids III: Connectivity' authors=['Lorenzo Traldi', 'Robert Brijder'] year=2016 venue='arXiv' doi=None arxiv_id='1602.03899' abstract=\"The isotropic matroid $M[IAS(G)]$ of a graph $G$ is a binary matroid, which is equivalent to the isotropic system introduced by Bouchet. In this paper we discuss four notions of connectivity related to isotropic matroids and isotropic systems. We show that the isotropic system connectivity defined by Bouchet is equivalent to vertical connectivity of $M[IAS(G)]$, and if $G$ has at least four vertices, then $M[IAS(G)]$ is vertically 5-connected if and only if $G$ is prime (in the sense of Cunningham's split decomposition). We also show that $M[IAS(G)]$ is $3$-connected if and only if $G$ is connected and has neither a pendant vertex nor a pair of twin vertices. Our most interesting theorem is that if $G$ has $n\\\\geq7$ vertices then $M[IAS(G)]$ is not vertically $n$-connected. This abstract-seeming result is equivalent to the more concrete assertion that $G$ is locally equivalent to a graph with a vertex of degree $<\\\\frac{n-1}{2}$.\" url='http://arxiv.org/abs/1602.03899v2' relevance_score=0.3 impact_score=0.0",
  "id='paper_1770210248.704247' title='Multiple Petersen subdivisions in permutation graphs' authors=['Tomáš Kaiser', 'Jean-Sébastien Sereni', 'Zelealem Yilma'] year=2012 venue='arXiv' doi=None arxiv_id='1204.1989' abstract='A permutation graph is a cubic graph admitting a 1-factor M whose complement consists of two chordless cycles. Extending results of Ellingham and of Goldwasser and Zhang, we prove that if e is an edge of M such that every 4-cycle containing an edge of M contains e, then e is contained in a subdivision of the Petersen graph of a special type. In particular, if the graph is cyclically 5-edge-connected, then every edge of M is contained in such a subdivision. Our proof is based on a characterization of cographs in terms of twin vertices. We infer a linear lower bound on the number of Petersen subdivisions in a permutation graph with no 4-cycles, and give a construction showing that this lower bound is tight up to a constant factor.' url='http://arxiv.org/abs/1204.1989v1' relevance_score=0.3 impact_score=0.0",
  "id='paper_1770210248.704247' title='Determining Number and Cost of Generalized Mycielskian Graphs' authors=['Debra Boutin', 'Sally Cockburn', 'Lauren Keough', 'Sarah Loeb', 'K. E. Perry', 'Puck Rombach'] year=2020 venue='arXiv' doi=None arxiv_id='2007.15284' abstract='A set $S$ of vertices is a determining set for a graph $G$ if every automorphism of $G$ is uniquely determined by its action on $S$. The size of a smallest determining set for $G$ is called its determining number, $Det(G)$. A graph $G$ is said to be $d$-distinguishable if there is a coloring of the vertices with $d$ colors so that only the trivial automorphism preserves the color classes. The smallest such $d$ is the distinguishing number, $Dist(G)$. If $Dist(G) = 2$, the cost of 2-distinguishing, $ρ(G)$, is the size of a smallest color class over all 2-distinguishing colorings of $G$. The Mycielskian, $μ(G)$, of a graph $G$ is constructed by adding a shadow master vertex $w$, and for each vertex $v_i$ of $G$ adding a shadow vertex $u_i$ with edges so that the neighborhood of $u_i$ in $μ(G)$ is the same as the neighborhood of $v_i$ in $G$ with the addition of $w$. That is, $N(u_i)=N_G(v_i)\\\\cup\\\\{w\\\\}$. The generalized Mycielskian $μ^{(t)}(G)$ of a graph $G$ is a Mycielskian graph with $t$ layers of shadow vertices, each with edges to layers above and below, and $w$ only adjacent to the top layer of shadow vertices. A graph is twin-free if it has no pair of vertices with the same set of neighbors. This paper examines the determining number and, when relevant, the cost of 2-distinguishing for Mycielskians and generalized Mycielskians of simple graphs with no isolated vertices. In particular, if $G \\\\neq K_2$ is twin-free with no isolated vertices, then $Det(μ^{(t)}(G)) = Det(G)$. Further, if $Det(G) = k \\\\geq 2$ and $t \\\\ge k-1$, then $Dist(μ^{(t)}(G))=2$, and $Det(μ^{(t)}(G)) = ρ(μ^{(t)}(G))= k$. For $G$ with twins, we develop a framework using quotient graphs with respect to equivalence classes of twin vertices to give bounds on the determining number of Mycielskians. Moreover, we identify classes of graphs with twins for which $Det(μ^{(t)}(G)) = (t{+}1) Det(G)$.' url='http://arxiv.org/abs/2007.15284v2' relevance_score=0.3 impact_score=0.0",
  "id='paper_1770210248.704247' title='The negative tetrahedron and the first infinite family of connected digraphs that are strongly determined by the Hermitian spectrum' authors=['Pepijn Wissing', 'Edwin R. van Dam'] year=2019 venue='arXiv' doi=None arxiv_id='1903.09531' abstract='Thus far, digraphs that are uniquely determined by their Hermitian spectra have proven elusive. Instead, researchers have turned to spectral determination of classes of switching equivalent digraphs, rather than individual digraphs. In the present paper, we consider the traditional notion: a digraph (or mixed graph) is said to be strongly determined by its Hermitian spectrum (abbreviated SHDS) if it is isomorphic to each digraph to which it is cospectral. Convincing numerical evidence to support the claim that this property is extremely rare is provided. Nonetheless, the first infinite family of connected digraphs that is SHDS is constructed. This family is obtained via the introduction of twin vertices into a structure that is named negative tetrahedron. This special digraph, that exhibits extreme spectral behavior, is contained in the surprisingly small collection of all digraphs with exactly one negative eigenvalue, which is determined as an intermediate result.' url='http://arxiv.org/abs/1903.09531v2' relevance_score=0.3 impact_score=0.0",
  "id='paper_1770210248.704247' title='Locally identifying coloring in bounded expansion classes of graphs' authors=['Daniel Gonçalves', 'Aline Parreau', 'Alexandre Pinlou'] year=2012 venue='arXiv' doi=None arxiv_id='1212.5468' abstract='A proper vertex coloring of a graph is said to be locally identifying if the sets of colors in the closed neighborhood of any two adjacent non-twin vertices are distinct. The lid-chromatic number of a graph is the minimum number of colors used by a locally identifying vertex-coloring. In this paper, we prove that for any graph class of bounded expansion, the lid-chromatic number is bounded. Classes of bounded expansion include minor closed classes of graphs. For these latter classes, we give an alternative proof to show that the lid-chromatic number is bounded. This leads to an explicit upper bound for the lid-chromatic number of planar graphs. This answers in a positive way a question of Esperet et al [L. Esperet, S. Gravier, M. Montassier, P. Ochem and A. Parreau. Locally identifying coloring of graphs. Electronic Journal of Combinatorics, 19(2), 2012.].' url='http://arxiv.org/abs/1212.5468v2' relevance_score=0.3 impact_score=0.0",
  "id='paper_1770210248.703247' title='Domination and location in twin-free digraphs' authors=['Florent Foucaud', 'Shahrzad Heydarshahi', 'Aline Parreau'] year=2019 venue='arXiv' doi=None arxiv_id='1910.05311' abstract='A dominating set $D$ in a digraph is a set of vertices such that every vertex is either in $D$ or has an in-neighbour in $D$. A dominating set $D$ of a digraph is locating-dominating if every vertex not in $D$ has a unique set of in-neighbours within $D$. The location-domination number $γ_L(G)$ of a digraph $G$ is the smallest size of a locating-dominating set of $G$. We investigate upper bounds on $γ_L(G)$ in terms of the order of $G$. We characterize those digraphs with location-domination number equal to the order or the order minus one. Such digraphs always have many twins: vertices with the same (open or closed) in-neighbourhoods. Thus, we investigate the value of $γ_L(G)$ in the absence of twins and give a general method for constructing small locating-dominating sets by the means of special dominating sets. In this way, we show that for every twin-free digraph $G$ of order $n$, $γ_L(G)\\\\leq\\\\frac{4n}{5}$ holds, and there exist twin-free digraphs $G$ with $γ_L(G)=\\\\frac{2(n-2)}{3}$. If moreover $G$ is a tournament or is acyclic, the bound is improved to $γ_L(G)\\\\leq\\\\lceil\\\\frac{n}{2}\\\\rceil$, which is tight in both cases.' url='http://arxiv.org/abs/1910.05311v2' relevance_score=0.2 impact_score=0.0",
  "id='paper_1770210248.704247' title='Sedentariness in quantum walks' authors=['Hermie Monterde'] year=2023 venue='arXiv' doi=None arxiv_id='2303.06297' abstract='We formalize the notion of a sedentary vertex and present a relaxation of the concept of a sedentary family of graphs introduced by Godsil [Linear Algebra Appl. 614:356-375, 2021]. We provide sufficient conditions for a given vertex in a graph to exhibit sedentariness. We also show that a vertex with at least two twins (vertices that share the same neighbours) is sedentary. We prove that there are infinitely many graphs containing strongly cospectral vertices that are sedentary, which reveals that, even though strong cospectrality is a necessary condition for pretty good state transfer, there are strongly cospectral vertices which resist high probability state transfer to other vertices. Moreover, we derive results about sedentariness in products of graphs which allow us to construct new sedentary families, such as Cartesian powers of complete graphs and stars.' url='http://arxiv.org/abs/2303.06297v3' relevance_score=0.16000000000000003 impact_score=0.0",
  "id='paper_1770210249.242838' title=\"Vertices: Duke's Undergraduate Research Journal\" authors=[] year=2023 venue='' doi='10.55894/vdur0609' arxiv_id=None abstract='' url='https://doi.org/10.55894/vdur0609' relevance_score=0.16000000000000003 impact_score=0.0",
  "id='paper_1770210249.242838' title='Figure 1: Random FVS and optimal FVS (the vertices of FVS are in orange and the other vertices are in blue).' authors=[] year=2023 venue='' doi='10.7717/peerj-cs.1245/fig-1' arxiv_id=None abstract='' url='https://doi.org/10.7717/peerj-cs.1245/fig-1' relevance_score=0.16000000000000003 impact_score=0.0",
  "id='paper_1770210249.242838' title='Video 5. Myosin II flows toward vertices.' authors=[] year=2023 venue='' doi='10.7554/elife.34586.019' arxiv_id=None abstract='' url='https://doi.org/10.7554/elife.34586.019' relevance_score=0.16000000000000003 impact_score=0.0",
  "id='paper_1770210249.242838' title='Video 2. Contracting vertices slide along cell interfaces.' authors=[] year=2023 venue='' doi='10.7554/elife.34586.007' arxiv_id=None abstract='' url='https://doi.org/10.7554/elife.34586.007' relevance_score=0.16000000000000003 impact_score=0.0",
  "id='paper_1770210249.242838' title='SUSY based displaced vertices in ATLAS detector' authors=['Selim Unal'] year=2023 venue='' doi='10.54014/b37h-5s5a' arxiv_id=None abstract='' url='https://doi.org/10.54014/b37h-5s5a' relevance_score=0.16000000000000003 impact_score=0.0",
  "id='paper_1770210249.242838' title='' authors=[] year=2025 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv4.1' arxiv_id=None abstract='' url='https://doi.org/10.55894/dv4.1' relevance_score=0.1 impact_score=0.0",
  "id='paper_1770210249.242838' title='Clinical use of the concept of vertices:' authors=[] year=2018 venue='Studies in Extended Metapsychology' doi='10.2307/jj.23338178.12' arxiv_id=None abstract='' url='https://doi.org/10.2307/jj.23338178.12' relevance_score=0.1 impact_score=0.0",
  "id='paper_1770210249.242838' title='Vertices of space curves' authors=['Stanislav Šmakal'] year=1973 venue='Czechoslovak Mathematical Journal' doi='10.21136/cmj.1973.101147' arxiv_id=None abstract='' url='https://doi.org/10.21136/cmj.1973.101147' relevance_score=0.1 impact_score=0.0",
  "id='paper_1770210249.242838' title='Gender Inequality in Healthcare Delivery: Differences in System Satisfaction During the COVID-19 Pandemic in the United States' authors=['Haizhu Song'] year=2025 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv4.13' arxiv_id=None abstract='<jats:p>This study examines gender differences in healthcare satisfaction during the COVID-19 pandemic inthe United States using data from the 2021-2022 General Social Survey (GSS). Although existing literature generally points to the disadvantages women face in terms of healthcare access and health outcomes, this study assesses gender differences in satisfaction with the U.S. healthcare system, controlling for health conditions.This study is the first to systematically assess gender differences in healthcare satisfaction during an epidemic from a quantitative perspective using large-scale representative data, filling a gap in the existing literature on this critical issue. Bivariate and multivariate analyses of the article showed no statistically significant relationship between gender and healthcare satisfaction, challenging the hypothesis that women are less satisfied. However, the findings also suggest that it is difficult to capture small gender differences by relying solely on broad satisfaction metrics. Future research could consider introducing more specific variables and exploring the interaction between gender and socioeconomic factors. The results of the study not only provide data-based insights for policymakers, but also provide a quantitative foundation for achieving gender equity in the U.S. health system.</jats:p>' url='https://doi.org/10.55894/dv4.13' relevance_score=0.1 impact_score=0.0",
  "id='paper_1770210249.242838' title='Impact of Aged Tumor Microenvironment and Chemosensitivity on Sub-types of Ovarian Cancer' authors=['Lila Taylor', 'Zhiqing Huang'] year=2025 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv3.21' arxiv_id=None abstract='<jats:p>Ovarian cancer (OC) is the most lethal female reproductive cancer––with a 5-year survival rate of 50.9%––and is diagnosed on average in patients in their 60s. Often OC patients enter an initial remission following chemotherapeutic or surgical interventions; however, ~75% of patients experience chemotherapy-resistant OC recurrence. This study aims to investigate the impact of aging on the tumor microenvironment (TME) and chemosensitivity of various subtypes of ovarian cancer (OC) to therapies targeting slower proliferating OC cells, which often lie dormant in patients and lead to disease recurrence. We have found slower proliferating OC cells exhibited a statistically significant higher sensitivity to the chemotherapy treatment ibrutinib compared to faster-proliferating cells in high-grade serous ovarian carcinomas (HGSOCs) in vitro. Cisplatin-resistant HGSOC cell lines displayed increased chemosensitivity to ibrutinib compared with the cisplatin-sensitive HGSOC cell lines. In clear cell ovarian carcinomas (CCOCs), we did not see dose-dependent chemosensitivity to duvelisib or ibrutinib, but there was an increased sensitivity when compared to the fast-proliferating HGSOC control. CCOC cell lines JHOC5 and TOV21-G showed increased responses to higher doses of UCN-01, but OVISE, the slowest proliferating CCOC did not. When looking at OC cell proliferation in conditioned medium from aged versus young WI-38 fibroblasts, OC cells were less proliferative in aged WI-38 medium when compared with the OC cells in young WI-38 medium in both HEYA8 and CAOV2 cell lines. Furthermore, we found that older WI-38 fibroblast coculture increased chemosensitivity for M41 HGSOC cells treated with duvelisib but not carboplatin. Future directions will be focused on the mechanisms of chemosensitivity in varying tumor microenvironments.</jats:p>' url='https://doi.org/10.55894/dv3.21' relevance_score=0.1 impact_score=0.0",
  "id='paper_1770210249.242838' title='On ordering vertices of infinite trees' authors=['František Neuman'] year=1966 venue='Časopis pro pěstování matematiky' doi='10.21136/cpm.1966.108099' arxiv_id=None abstract='' url='https://doi.org/10.21136/cpm.1966.108099' relevance_score=0.1 impact_score=0.0",
  "id='paper_1770210249.242838' title='The (signless) Laplacian spectral radii of c-cyclic graphs with n vertices and k pendant vertices' authors=['Muhuo Liu'] year=2012 venue='The Electronic Journal of Linear Algebra' doi='10.13001/1081-3810.1567' arxiv_id=None abstract='' url='https://doi.org/10.13001/1081-3810.1567' relevance_score=0.1 impact_score=0.0",
  "id='paper_1770210249.242838' title='Kinematic Fitting of Detached Vertices' authors=['Paul Mattione'] year=2007 venue='' doi='10.2172/903056' arxiv_id=None abstract='' url='https://doi.org/10.2172/903056' relevance_score=0.1 impact_score=0.0",
  "id='paper_1770210249.242838' title='Identity, Resilience and their Psychological Impact Among Older Adults with Cancer' authors=['Bianca DeSilva', 'Timothy Strauman', 'Katherine Ramos'] year=2025 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv3.22' arxiv_id=None abstract='<jats:p>Older adults (65+) make up 60% of cancer diagnoses and 70% of deaths related to cancer (Marosi &amp; Köller,\\n2016). Although this age group experiences significant distress, behavioral studies investigating distress tend\\nto be overrepresented by younger populations, leaving a gap in the knowledge about the distress needs of\\nolder adults (Chang et al., 2020). To bridge this gap, Dr. Katherine Ramos and Dr. Timothy Strauman of Duke\\nUniversity’s Psychology Department conducted a pilot study that found two major themes related to distress\\nin older adults: identity and resilience. The purpose of this study is to investigate the psychological impact\\nof identity and resilience on the distress experienced by older adults with cancer. Using the two qualitative\\nthemes, identity and resilience, the researchers of this study conducted a narrative synthesis of contemporary\\nliterature surrounding identity, resilience, and their psychological impact on distress in older adults with cancer. Following the Preferred Reporting Items for Systematic Review and Meta-Analyses (PRIMSA) guidelines,\\nthe study found nine eligible articles. The study conducted a thematic analysis of the articles in this synthesis\\nand found six themes: (1) reconstructing identity after diagnosis, (2) experiencing anxiety due to uncertainty of\\ncancer outcomes, (3) needing to “push along” through a cancer diagnosis, (4) having access to social support\\nincreases resilience, (5) experiencing low resilience leads to demoralization, and (6) navigating cancer requires\\nredefining oneself to confront cancer challenges. Future directions and clinical implications include adapting\\nSelf-System Therapy (SST) as a mental health intervention for older adults with cancer.</jats:p>' url='https://doi.org/10.55894/dv3.22' relevance_score=0.1 impact_score=0.0",
  "id='paper_1770210249.242838' title='Beyond Existing Analysis: The Rigorous Illumination of Choice from Extant Neuroscience and Philosophy' authors=['Shambhavi Sinha', 'Stratton Black'] year=2025 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv3.24' arxiv_id=None abstract='<jats:p>The age-old question of the existence of human free has been tackled by the field of philosophy traditionally. However, this question has recently been challenged by neuroscience experiments suggesting our decisions are made unconsciously by our brains before we’re aware of them. In this article, we explore the validity of this argument and the conclusions it brings regarding human responsibility and morality, and whether this experiment is sufficient to declare the death of human free will as we know it.</jats:p>' url='https://doi.org/10.55894/dv3.24' relevance_score=0.1 impact_score=0.0",
  "id='paper_1770210249.242838' title='Cut Vertices and Degree One Vertices of Zero-Divisor Graphs' authors=['Shane P. Redmond'] year=2012 venue='Communications in Algebra' doi='10.1080/00927872.2011.585192' arxiv_id=None abstract='' url='https://doi.org/10.1080/00927872.2011.585192' relevance_score=0.1 impact_score=0.0",
  "id='paper_1770210249.242838' title='Evaluating SLAM Performance with Synthesized Datasets from Unreal-Based Emulators' authors=['Muchang Bahng'] year=2024 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv2.22' arxiv_id=None abstract='<jats:p>The rapid advancement in visual-inertial simultaneous localization and mapping (SLAM) has opened numerous applications in computer vision. However, the scarcity of high quality, publicly accessible datasets hampers the evaluation of SLAM performance in varied and tailored environments. In this study, I employed the AirSim simulator and the Unreal Engine 4 to generate a trajectory resembling that of the TUM VI Room 1 ground truth dataset within the ArchViz indoor environment representing a well-lit, furnished room. I further modified the environment and trajectory through various expansions, addition of features, and data smoothing to ensure a more stable sequence of input frames into the SLAM architecture. I then examined the efficiency of visual ORB-SLAM3 by inputting images of resolution 256×144 and 512×288 at 30 frames per second (FPS), while also adjusting the feature threshold - the maximum number of feature points that ORB-SLAM3 tracks per frame. This investigation of the camera parameters within AirSim and ORB-SLAM3 has led to the essential finding that the resolution of the input images must coincide with the dimensions of the film. The subsequent runs under these variables reveal that higher resolution images lead to considerably better tracking, with an optimal feature threshold ranging between 3000~12000 feature points per frame. Moreover, ORB- SLAM3 demonstrated significantly enhanced robustness within dynamic environments containing moving objects when using higher resolution inputs, with a decreased error of close to 0cm compared to 23.19cm for lower resolutions (averaged over three runs). Finally, I conducted qualitative testing using real-life indoor environments recorded with an iPhone Xr camera, which produces results that highlight the challenges faced by ORB-SLAM3 due to factors such as glare and motion blur.</jats:p>' url='https://doi.org/10.55894/dv2.22' relevance_score=0.08 impact_score=0.0",
  "id='paper_1770210249.242838' title='Investigating Serotonin Dynamics and Simulating Effects of Antidepressants Using Variation in Enzyme Expression' authors=['Alexander Diefes'] year=2024 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv2.21' arxiv_id=None abstract='<jats:p>Serotonin plays a crucial role in the symptoms of depression, and understanding its dynamics in the brain is of the utmost importance in determining how to mitigate the effects of depression. We investigate a mathematical model presented by Best et al. (2020) that examines serotonin dynamics in the substantia nigra pars reticulata. By incorporating experimental data and a stochastic systems population model, several biological mechanisms and observations are further understood. A populations model is utilized to account for enzymatic expression level variation from 75% to 125% of their base values. When generating the population model, uniform distributions are assumed when simulating maximum velocity values, which correspond to enzyme expression levels. We investigate this assumption and show that it is reasonably insensitive; that is, changes in the distributions used to generate these values do not significantly change the results of the model. We also use the model to simulate the effects of monoamine oxidase inhibitors (MAOIs), one of the first treatments discovered for depression. We then use similar methods to simulate the effects of selective serotonin reuptake inhibitors (SSRIs), the most common antidepressant used today. We demonstrate that low enzyme expression levels of tryptophan hydroxylase and neutral amino acid transporter are most associated with low extracellular serotonin values at the steady state, indicating that these two enzymes may play key roles in predicting which patients may or may not respond to SSRI treatment.</jats:p>' url='https://doi.org/10.55894/dv2.21' relevance_score=0.08 impact_score=0.0",
  "id='paper_1770210249.242838' title='Identification of cis-acting elements that regulate expression of the progesterone receptor gene PGR in the uterus.' authors=['Skylar Redecke'] year=2024 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv3.11' arxiv_id=None abstract='<jats:p>The steroid hormone progesterone regulates a wide range of functions in the uterus, including menstruation, pregnancy establishment, pregnancy maintenance, and labor. The cellular effects of progesterone are mediated by the nuclear progesterone receptor (PGR). Progesterone resistance, a decreased cellular response to progesterone,is implicated in a wide range of pathologies including endometriosis, preterm birth, and endometrial cancer. Up to 10% of females within reproductive age are impacted by endometriosis, and no cure is available. This study hypothesizes that misregulation of PGR by upstream regulators is a potential cause of progesterone resistance. However, much remains unknown about the regulation of PGR expression, including the location of enhancers and the identity of transcriptional regulators that control PGR expression. In this study, candidate regulatory elements of PGR were identified by integrative analysis of genomic data, and their function was tested using the CRISPR activation system, with PGR mRNA levels as the readout. Using these methods, two PGR enhancers located at the PGR 3’ untranslated region and 200 kbs upstream of the PGR transcription start site were identified. These enhancers permitted the identification of candidate upstream regulators of PGR expression in the uterus, including GATA2, ARID1A, KLF9, and ESR1. Activation of ESR1 increased PGR mRNA levels in the presence of estradiol in cultured uterine cells. Through the discovery of PGR regulators, we can improve our understanding of molecular mechanisms of progesterone resistance. Ultimately, these regulators could be evaluated in cases of progesterone resistance and targeted in the development of therapies.</jats:p>' url='https://doi.org/10.55894/dv3.11' relevance_score=0.08 impact_score=0.0",
  "id='paper_1770210249.242838' title='An Examination of Two Competing Interpretations of Quantum Mechanics with a Critique of the Kochen-Specker Theorem' authors=['Eliza Miller'] year=2024 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv2.23' arxiv_id=None abstract='<jats:p>There is ongoing discourse in philosophical and physics literature about whether the probabilistic essence of quantum mechanics indicates that deterministic interpretations of nature must be false. In 1967 two mathematicians, Simon Kochen and Ernst Specker, developed a mathematical theorem to the effect that particles do not have well-defined property values at a given time. A logical consequence of this is that there can be no well-defined hidden variables responsible for the outcomes of mysterious quantum behaviors. The theorem is thus fatal to the many deterministic interpretations of quantum mechanics that assume hidden variables, including pilot wave mechanics, a quantum theory developed by Louis de Broglie and David Bohm a few decades prior to the formulation of the Kochen-Specker Theorem. The purpose of this essay is to evaluate the legitimacy of the logical basis of Kochen’s and Specker’s argument considering its severe implications. It is concluded that Kochen and Specker do not provide sufficient evidence that deterministic theories must fail, due to their misinterpretation of the axioms on which hidden variable theories rely. This paper also finds that pilot wave mechanics is mathematically successful while remaining consistent with the deterministic understanding of broader physics and deserving of more serious consideration as a quantum theory. Above all it is emphasized that the nonsensicality of absolute randomness and indeterminism should be acknowledged, and theorems purporting to prove their existence should be critically examined, for such a discovery would undermine the legitimacy of logic itself.</jats:p>' url='https://doi.org/10.55894/dv2.23' relevance_score=0.08 impact_score=0.0",
  "id='paper_1770210249.242838' title='Effects on Status Striving: How Self-Perceived Value, Self-Esteem, and Personality Traits Impact Preferred Status' authors=['Sua Cho'] year=2024 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv2.24' arxiv_id=None abstract='<jats:p>Prior research shows that despite the belief that humans universally desire high status in group settings (i.e., leadership roles), individuals with low self-perceived value (SPV) perceive themselves as being unable to make meaningful contributions to the group’s success. Thus, they prefer low status to conform to the external social pressure of other group members’ expectations. Yet, internal factors such as self-esteem and personality traits may also shape individuals’ preferred status by buffering the effects of external factors. To examine these hypotheses, two studies were conducted, in which the participants’ self-perceived value and self-esteem were manipulated. The results from these studies were consistent with previous studies, showing that participants with higher SPV preferred and expected higher status than participants with lower SPV. Moreover, individuals’ personality traits predicted the status they preferred and expected: more extroverted participants preferred and expected higher status than less extroverted participants, while participants with higher levels of neuroticism preferred and expected lower status than participants with lower levels of neuroticism. Participants with higher self-esteem were also more likely to prefer and expect higher status. Lastly, low self-esteem was associated with lower preferred status for participants with low SPV, but not high SPV. Because self-esteem is correlated with individuals’ socioeconomic status (SES), this study further highlights the need to address the self-esteem gap between individuals in high and low SES to prevent pre-established social hierarchies from perpetuating.</jats:p>' url='https://doi.org/10.55894/dv2.24' relevance_score=0.08 impact_score=0.0",
  "id='paper_1770210249.242838' title='A Correlational Study of the Relationship Between ChatGPT Usage &amp; Cognitive Flexibility' authors=['Victoria Szymkiewicz', 'Edgar Carvalho', 'Ezra Ford'] year=2024 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv3.13' arxiv_id=None abstract='<jats:p>Amidst the growing integration of AI into educational practices, concerns arise regarding how unregulated interaction with AI outside the structured classroom environment may influence university students’ cognitive functions. This research examines the differential effects of ChatGPT usage intensity on university students’ cognitive flexibility. The researchers hypothesize a negative correlation between ChatGPT usage and cognitive flexibility, measurable by increased response times and decreased accuracy between the two tasks of the Arrow Switch Test. We employed this test to contrast the performance of frequent (participants who used ChatGPT ≥ 50% of the time on academic assignments) and infrequent (participants who used ChatGPT ≤ 35% of the time on academic assignments) groups. For the purpose of this study, infrequent users were used as a control group. Both groups displayed a statistically significant decrease in task accuracy—highlighting the Arrow Switch Task’s efficacy in assessing cognitive flexibility—and response time between the first and second task. Notably, infrequent users of ChatGPT demonstrated a larger decline in accuracy and response time following changed task conditions compared to frequent users. This finding calls for further investigation into the longitudinal effects of AI tools on learning processes, necessitating a larger sample size and a more granular analysis of usage patterns to understand the subtleties of AI’s impact on cognitive flexibility.</jats:p>' url='https://doi.org/10.55894/dv3.13' relevance_score=0.08 impact_score=0.0",
  "id='paper_1770210249.242838' title='Exploring Serotonin in Catch Contractions and Specific Dynamic Action in Postprandial Metabolism: Insights from Aquatic Models' authors=['Caroline Zhang', 'Jack Fallon'] year=2024 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv3.12' arxiv_id=None abstract='<jats:p>Animal model organisms have long been instrumental in unraveling complex biological processes relevant to human physiology. The first study investigates how exercise and food intake affect metabolism, using zebrafish as our model. The second experiment dives into how neurotransmitters like dopamine and serotonin control muscle movements, particularly catch contractions, in mussels. Examining these processes provides insights into how muscle function and metabolism are regulated, potentially shedding light on human health and conservation efforts.</jats:p>' url='https://doi.org/10.55894/dv3.12' relevance_score=0.08 impact_score=0.0",
  "id='paper_1770210249.242838' title='Vértices' authors=[] year=2023 venue='' doi='10.11606/issn.2179-5894' arxiv_id=None abstract='' url='https://doi.org/10.11606/issn.2179-5894' relevance_score=0.06000000000000001 impact_score=0.0",
  "id='paper_1770210249.242838' title='iPSC differentiation into various neuron subtypes' authors=['Emily Cruz', 'Mohamad Mikati MD, PhD'] year=2023 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv1.21' arxiv_id=None abstract='<jats:p>Induced pluripotent stem cells (iPSCs) have been demonstrated to be a valuable tool in modeling diseases, investigating drug mechanisms, and understanding manifestations of disease in specific cell types. In the field of neurology, current studies are investigating the use of iPSCs as a regenerative therapy, which could be extremely beneficial for understanding and treating neurodegenerative diseases. While iPSCs have been used in various studies, a lack of familiarity with all available protocols for neuronal differentiation makes it difficult to identify best practices. Further, because neurological diseases can selectively impact certain types of neurons, it is useful to compile protocols to make different neuronal types. In this article, methods of differentiating iPSCs into various neuron subtypes are described in order to provide a consolidated list of protocols that will aid the analysis of suitable and available methods for specific research protocols. By compiling and summarizing these various methods, future studies can determine which methods are best for their specific research goals, regarding timing, efficiency, and accuracy.</jats:p>' url='https://doi.org/10.55894/dv1.21' relevance_score=0.06000000000000001 impact_score=0.0",
  "id='paper_1770210249.242838' title='Relations of and between Family Business and Private Enterprise' authors=['Michael Cao'] year=2023 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv2.13' arxiv_id=None abstract='<jats:p>In this paper, I draw from economic and organizational sociology to study a psychosocial dimension of modern entrepreneurial dynamics. Namely, I employ a mixed-methods approach to the study of family business members in the U.S and their corresponding economic attitudes about private enterprise as a superlative solution to economic problems. I incorporate quantitative cross tabulation analyses of multivariate relationships derived from data provided by the 2021 General Social Survey (GSS), as well as original qualitative interview data collected from family business members. Based on my findings, I argue role involvement in family business has a significant bearing towards generally positive views of private enterprise ideology. However, the relationship between family business involvement and belief in private enterprise is specified along lines of social class. I further argue how private enterprise belief is differentially associated with the lower and upper class of family business members, an important finding given the systematic impact family businesses can have on the economic fabric of American society.</jats:p>' url='https://doi.org/10.55894/dv2.13' relevance_score=0.06000000000000001 impact_score=0.0",
  "id='paper_1770210249.242838' title='Quorum Sensing in Pseudomonas aeruginosa: Mechanisms, strategies, and a novel inhibitor' authors=['Aditya Raj', 'Natasha Kirienko'] year=2023 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv2.11' arxiv_id=None abstract='<jats:p>Pseudomonas aeruginosa, an opportunistic life-threatening bacterial pathogen, uses quorum sensing signals to modulate the expression of virulent genes. These bacteria exhibit high levels of antimicrobial resistance, which reduces the effectiveness of current antibiotics, highlighting the need for treatments that do not induce selective pressure. A comprehensive understanding of the factors inhibiting quorum sensing in P. aeruginosa is necessary to design an alternative therapeutic strategy for long-term treatments that do not function by traditional bactericidal or bacteriostatic mechanisms. This manuscript is a literature review highlighting a novel, naturally occurring molecule with a high potential to inhibit quorum sensing and virulence. It covers methods by which the anti- virulent nature of this molecule can be verified and how it can be used as a supplement to traditional antibiotics and as a possible new stand-alone medicine.</jats:p>' url='https://doi.org/10.55894/dv2.11' relevance_score=0.06000000000000001 impact_score=0.0",
  "id='paper_1770210249.242838' title='Modeling the Northern Great Barrier Reef Population of Green Sea Turtles' authors=['Jackson D. Nowacek'] year=2023 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv2.12' arxiv_id=None abstract='<jats:p>Population modeling is an established, effective tool for assessing the effects of environmental conditions on a specific population. The model this paper outlines is based on the Green Sea Turtle (Chelonia mydas) population of the Northern Great Barrier Reef. The model shows the effects of variable temperature, light, nutrients, predation, and availability of food (seagrass) on the long-term health of the population. Several tests were run by adjusting variables such as initial seagrass levels, seagrass threshold, mortality rates, nest temperature, light, and nutrients. The model showed biologically and ecologically plausible reactions to each variable change.</jats:p>' url='https://doi.org/10.55894/dv2.12' relevance_score=0.06000000000000001 impact_score=0.0",
  "id='paper_1770210249.242838' title='Application of Palladium Chemistry in Organic Synthesis Techniques: the Larock Indole Synthesis, a Literature Review' authors=['Angikar Ghosal'] year=2023 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv1.22' arxiv_id=None abstract='<jats:p>As one of the most important biologically active and naturally occurring molecules, indole is an organic compound of great importance. For more than a century, the standard method of lab preparation of the indole family of compounds has been the Fischer indole synthesis. In 1994, Richard C. Larock and Eul Kgun Yum prepared indole and indole derivatives using a new technique involving organometallic chemistry, what has since then come to be known as the Larock indole synthesis [1]. In this literature review, we give a background to the techniques involved in the Larock indole synthesis, including similar precursor methods in palladium chemistry. We mention the motivations for this reaction method, based on earlier work done. We then give a detailed overview of Larock’s work, including the reaction mechanism, kinetic effects, and effects of substituents. We also consider limitations of the Larock indole synthesis. We then study the various applications of this synthesis technique, especially synthesis of those compounds with pharmaceutical applications. We also then consider improvement to Larock’s original work, including newer, more improved techniques that built on Larock’s work, and how these newer discoveries are more beneficial to us. We end this review paper with some future questions to pursue.</jats:p>' url='https://doi.org/10.55894/dv1.22' relevance_score=0.06000000000000001 impact_score=0.0",
  "id='paper_1770210249.242838' title='Data Corroboration of The Catastrophic Chernobyl Tragedy Using Arc-Length Estimate Conjecture' authors=['Manan Choudhury', 'Anurag Dutta', 'Arnab Kumar De'] year=2023 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv1.24' arxiv_id=None abstract='<jats:p>Nuclear power is perhaps one of the biggest keys to empowerment for any country. In fact, nuclear power has been the backbone of the international superpowers like the US and USSR since the 20th Century. Alongside its merits, nuclear power carried some demerits propping on it. One of the biggest amongst all was the Chernobyl nuclear cataclysm that occurred on the 26’th April 1986. Within hours of the explosion, nuclear radiation blanketed the whole city of Pripyat, Ukraine. In this paper, we have developed a notion namely “Arc-Length Estimate Conjecture” to detect anomaly, and fairness in data sets. If an anomaly is found, the Arc Length Estimate Conjecture is capable of dissecting the anomality in magnitudical terms. Further we have analyzed the Radiation that emerged from the Chernobyl Catastrophe by looking at the concentration of radioactive elements that were measured from different parts of the world. We have considered the elements I131 and Cs134 as elements of utmost importance and have tried to verify the data put forward by USSR regarding the radiation emission level of these radio actives. social-circles, and non-religious students. The results of this study and related studies to follow will be used to inform improvements to mental health counseling and outreach to at- risk individuals at universities across the United States.</jats:p>' url='https://doi.org/10.55894/dv1.24' relevance_score=0.06000000000000001 impact_score=0.0",
  "id='paper_1770210249.242838' title='Comparing experiences with mental health issues to perceptions of their prevalence: A study of Duke University undergraduates' authors=['Sean Woytowitz', 'Paul Seli Ph.D.'] year=2023 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv1.23' arxiv_id=None abstract='<jats:p>Mental illness affects all populations but has disproportionately affected college students in the recent past. Universities provide a unique setting in which students often live away from their families and must make an effort to stay socially engaged. While plenty of research on mental health has been conducted on children and adults, the field is lacking in research on college-aged individuals. The present study identifies the frequency of symptoms of depression and anxiety among the Duke University undergraduate community, as well as demographic factors that are correlated with these symptoms. The data were obtained through a survey asking students about their experiences with well-established symptoms of Major Depressive Disorder and Generalized Anxiety Disorder. The data indicate that students at Duke University experience symptoms of depression and anxiety at a higher rate compared to the average 18-29 year old person in the United States. Other findings include a greater prevalence of mental illness symptoms among low-income students, students with small social-circles, and non-religious students. The results of this study and related studies to follow will be used to inform improvements to mental health counseling and outreach to at-risk individuals at universities across the United States.</jats:p>' url='https://doi.org/10.55894/dv1.23' relevance_score=0.06000000000000001 impact_score=0.0",
  "id='paper_1770210249.242838' title='Masculinity and Novel Male Contraceptives: Does Masculine Norm Conformity Influence Preference?' authors=['Connie Dean'] year=2022 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv1.11' arxiv_id=None abstract='<jats:p>Background: The impact of masculine norm endorsement on decision making regarding male contraceptive methods is a bounteous, yet unexplored, area of research. Aim: The aim of this paper is to understand how masculinity and attitudes towards sex impact male contraceptive usage and how preference could inform strategies to ultimately improve uptake and usage. Increased contraceptive use could have profound public health and financial impact given the potential to prevent unwanted pregnancies and promote equitable family planning. Method: 103 male participants aged 18+ completed a self-report electronic survey assessing masculine norm endorsement, attitudes towards sexuality and likelihood-of-usage of three novel male contraceptives; namely Nestorone, MENT and RISUG. Masculine norm endorsement was measured using an adapted version of Parent and Moradi’s Conformity to Masculine Norms Inventory-46, and the Sexual Opinion Survey was used to assess positive-negative attitudes toward sex. Participants were also asked which of the three contraceptive they would be most likely to use and why Results: The data showed no significant correlation between either masculine norm endorsement or attitudes towards sexuality and likelihood-of-usage for novel male contraceptives. However, the sample did show a hierarchy of preference; Nesterone was the most preferred method, followed by RISUG, and finally the sample indicated a significant aversion to MENT. For each contraceptive, common themes for preference were easily identifiable. Those who preferred Nesterone cited ‘Non-invasiveness’ and ‘Ease of use’ as their reasoning. Those who preferred RISUG indicated the ‘Convenience’ and ‘Longevity’ of the method as the reason for preference. Those who preferred MENT, cited ‘Non-daily use’ and ‘Less invasive [than RISUG]’. Those who preferred MENT seemed to fit a niche between RISUG and Nesterone: while they do not wish to partake in the daily application of Nesterone, they are also opposed to the procedure involved with RISUG. Conclusions: The results of this study indicate that the sample showed preference with regards to the novel forms of male contraceptives. The reasons indicated by the sample regarding their preference pointed to specific driving factors, motivated by what the individual values. Namely: ease of use, longevity, and surgical procedure avoidance. Furthermore, this suggests the need for multiple methods of male contraceptives to satisfy a broader range of individuals. Thus, this study yields important data that may help to inform future contraceptive design and research to meet the needs and preferences of young adult males.</jats:p>' url='https://doi.org/10.55894/dv1.11' relevance_score=0.04 impact_score=0.0",
  "id='paper_1770210249.242838' title='Customizable crying and connection: personalization and its effect on player emotion and empathy' authors=['Devinne Moses'] year=2022 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv1.14' arxiv_id=None abstract='<jats:p>Player choice sets video games apart from other visual media, and narrative designers work with game developers to implement tools that allow players to make choices and feel involved. Prior research focuses on games that include emotional themes and character customization, which are seen as effective ways to create empathy between player and protagonist. However, most research compares different games with various levels of customization, opening doors to several confounding variables. To address this gap, it is essential to explore how character customization and narrative context influence player emotion, character connection, morality, and engagement in a single game. This study involved participants playing a custom-built interactive fiction game demo (MOSAIC). Overall, players’ attitudes toward the demo were consistent across all three experimental groups and the control group, although character connection was higher in groups where participants were given additional story information and/or opportunities to customize the protagonist. This is a valuable step towards understanding video games and player emotion, especially considering gaming’s global presence and constant expansion.</jats:p>' url='https://doi.org/10.55894/dv1.14' relevance_score=0.04 impact_score=0.0",
  "id='paper_1770210249.242838' title='Utilizing Patient Characteristics to Predict the Likelihood of Heart Condition' authors=['Jackson Cathey', 'Carson Herman', 'Michelle Tetro', 'Melody Gao'] year=2022 venue=\"Vertices: Duke's Undergraduate Research Journal\" doi='10.55894/dv1.12' arxiv_id=None abstract='<jats:p>As primary care providers deal with a multitude of chronic conditions, cardiovascular disease may often be overlooked. Finding cardiovascular disease early in a patient increases treatment options and reduces the likelihood of further complications. Thus, it is important that providers have tools at their disposal to assess patients’ odds of heart disease, given past medical histories and vital signs in clinic. Utilizing patient data from the Cleveland Heart Clinic, we developed a predictive model for assessing the odds that a patient evaluated in clinic may have an underlying heart condition. We selected each variable based on its relative capacity for prediction of heart condition, then further analyzed the contributes of this feature in the model. The final model includes the sex of the patient, their self-reported experience of exercise-induced angina, and resting ECG results. This model can be used in the clinic to estimate a patient’s odds of heart disease. Unlike current models used in primary care clinics, this model uses fewer variables and specifically assesses the odds of a current condition, as opposed to the future development of cardiovascular disease. Testing directly for heart disease is costly and time-consuming, so it’s useful to build a predictive diagnostic model.</jats:p>' url='https://doi.org/10.55894/dv1.12' relevance_score=0.04 impact_score=0.0"
]